INSERT INTO DPISEMP1.BACKOFFICE_MENU_BAR_LV3 (FID,LANGCODE,MENU_ID,MENU_ORDER,MENU_ICON,MENU_LABEL,FLAG_SHOW,TYPE_LINKTO,LINKTO_WEB,LINKTO_TID,PARENT_ID_LV0,PARENT_ID_LV1,PARENT_ID_LV2,CREATE_DATE,CREATE_BY,UPDATE_DATE,UPDATE_BY) VALUES
	 (1,'EN',1,1,NULL,'S030201 บันทึกอัตราเงินเดือนที่จะเลื่อนขึ้นแต่งตั้งให้ดำรงตำแหน่งในระดับที่สูงขึ้น','S','W','cond_level_salary.html',0,34,255,138,'2006-06-07 18:58:47',1,'2007-02-01 20:57:20',1),
	 (1,'TH',1,1,NULL,'S030201 บันทึกอัตราเงินเดือนที่จะเลื่อนขึ้นแต่งตั้งให้ดำรงตำแหน่งในระดับที่สูงขึ้น','S','W','cond_level_salary.html',0,34,255,138,'2006-06-07 18:58:47',1,'2007-02-01 20:57:20',1),
	 (1,'EN',2,2,NULL,'S030202 บันทึกรายละเอียดจำแนกตามสายงาน','S','W','cond_assign_type.html',0,34,255,138,'2006-06-07 18:59:14',1,'2007-02-01 20:58:04',1),
	 (1,'TH',2,2,NULL,'S030202 บันทึกรายละเอียดจำแนกตามสายงาน','S','W','cond_assign_type.html',0,34,255,138,'2006-06-07 18:59:14',1,'2007-02-01 20:58:04',1),
	 (1,'EN',3,3,NULL,'S030203 บันทึกระยะเวลาการดำรงตำแหน่ง','S','W','cond_time_position.html',0,34,255,138,'2006-06-07 18:59:35',1,'2007-02-01 20:58:16',1),
	 (1,'TH',3,3,NULL,'S030203 บันทึกระยะเวลาการดำรงตำแหน่ง','S','W','cond_time_position.html',0,34,255,138,'2006-06-07 18:59:35',1,'2007-02-01 20:58:16',1);
