INSERT INTO DPISEMP1.MSGBOX (MSG_ID,MSG_DESC,MSG_1,MSG_2,MSG_3) VALUES
	 (1,'บันทึกข้อมูลไม่ครบถ้วน','โปรดระบุข้อมูล',NULL,NULL),
	 (2,'บันทึกข้อมูลผิดรูปแบบ','รูปแบบของข้อมูล','ไม่ถูกต้อง','โปรดระบุใหม่'),
	 (3,'บันทึกข้อมูลซ้ำ','ข้อมูล','ซ้ำ โปรดระบุใหม่',NULL),
	 (4,'ไม่พบข้อมูลที่ระบุ','ไม่พบข้อมูล','ที่ระบุ',NULL),
	 (5,'ข้อมูลไม่สอดคล้องกัน','ข้อมูล','ไม่ถูกต้อง','โปรดระบุใหม่'),
	 (6,'ไม่สามารถเพิ่มข้อมูลได้','ไม่สามารถเพิ่มข้อมูลได้',NULL,NULL),
	 (7,'ไม่สามารถแก้ไขข้อมูลได้','ไม่สามารถแก้ไขข้อมูลได้',NULL,NULL),
	 (8,'ไม่สามารถลบข้อมูลได้','ไม่สามารถลบข้อมูลได้',NULL,NULL),
	 (9,'เสร็จสิ้นการประมวลผล','การ','เสร็จสมบูรณ์',NULL),
	 (10,'ไม่สามารถประมวลผลได้','พบข้อผิดผลาดในการ',NULL,NULL);
INSERT INTO DPISEMP1.MSGBOX (MSG_ID,MSG_DESC,MSG_1,MSG_2,MSG_3) VALUES
	 (11,'ชื่อผู้ใช้/รหัสผ่านไม่ถูกต้อง','ชื่อผู้ใช้/รหัสผ่านไม่ถูกต้อง',NULL,NULL),
	 (12,'รหัสผ่านไม่ถูกต้อง','รหัสผ่านไม่ถูกต้อง',NULL,NULL);
