INSERT INTO DPISEMP1.PER_STATUS (PS_CODE,PS_NAME,PS_ACTIVE,UPDATE_USER,UPDATE_DATE,PS_SEQ_NO,PS_OTHERNAME) VALUES
	 ('01        ','หัวหน้ากระทรวง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('02        ','หัวหน้ากรม',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('03        ','รองหัวหน้ากระทรวง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('04        ','รองหัวหน้ากรม',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('05        ','ผู้ช่วยหัวหน้ากระทรวง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('06        ','ผู้ช่วยหัวหน้ากรม',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('07        ','ผู้ตรวจราชการกระทรวง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('08        ','ผู้ตรวจราชการกรม',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('09        ','หัวหน้าส่วนราชการประจำจังหวัด',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('10        ','รองหัวหน้าส่วนราชการประจำจังหวัด',1,1,'2001-06-01 12:00:00',NULL,NULL);
INSERT INTO DPISEMP1.PER_STATUS (PS_CODE,PS_NAME,PS_ACTIVE,UPDATE_USER,UPDATE_DATE,PS_SEQ_NO,PS_OTHERNAME) VALUES
	 ('11        ','ผอ.สำนัก/กอง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('12        ','รอง ผอ.สำนัก/กอง',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('13        ','อื่นๆ',1,1,'2001-06-01 12:00:00',NULL,NULL),
	 ('001       ','ปลัดกระทรวงหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('002       ','อธิบดีหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('003       ','รองปลัดกระทรวงหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('004       ','ผู้ว่าราชการจังหวัด',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('005       ','เอกอัครราชทูต',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('006       ','ผู้ตรวจราชการระดับกระทรวง',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('007       ','อื่นๆ (ตำแหน่งประเภทบริหารระดับสูง)',1,1,'2008-11-14 11:17:32',NULL,NULL);
INSERT INTO DPISEMP1.PER_STATUS (PS_CODE,PS_NAME,PS_ACTIVE,UPDATE_USER,UPDATE_DATE,PS_SEQ_NO,PS_OTHERNAME) VALUES
	 ('008       ','รองอธิบดีหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('009       ','รองผู้ว่าราชการจังหวัดหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('010       ','อัครราชทูต',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('011       ','อื่นๆ (ตำแหน่งประเภทบริหารระดับต้น)',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('012       ','ผอ.สำนักหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('014       ','อื่นๆ (ตำแหน่งประเภทอำนวยการระดับสูง)',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('015       ','ผู้อำนวยการกองหรือเทียบเท่า',1,1,'2008-11-14 11:17:32',NULL,NULL),
	 ('017       ','อื่นๆ (ตำแหน่งประเภทอำนวยการระดับต้น)',1,1,'2008-11-14 11:17:32',NULL,NULL);
