INSERT INTO DPISEMP1.PER_POS_GROUP (PG_CODE,PG_NAME,PG_ACTIVE,UPDATE_USER,UPDATE_DATE,PG_SEQ_NO,PG_NAME_SALARY,PG_OTHERNAME) VALUES
	 ('10        ','แรงงาน',0,1,'2003-12-18 14:46:27',NULL,'แรงงาน',NULL),
	 ('20        ','กึ่งฝีมือ',0,1,'2003-12-18 14:46:45',NULL,'กึ่งฝีมือ',NULL),
	 ('30        ','ฝีมือ',0,1,'2003-12-18 14:46:55',NULL,'ฝีมือ',NULL),
	 ('41        ','ฝีมือพิเศษระดับต้น',0,1,'2003-12-18 14:47:16',NULL,'ฝีมือพิเศษระดับต้น',NULL),
	 ('42        ','ฝีมือพิเศษระดับกลาง',0,1,'2003-12-18 14:47:36',NULL,'ฝีมือพิเศษระดับกลาง',NULL),
	 ('43        ','ฝีมือพิเศษระดับสูง',0,1,'2003-12-18 14:47:52',NULL,'ฝีมือพิเศษระดับสูง',NULL),
	 ('44        ','ฝีมือพิเศษเฉพาะ',0,1,'2003-12-18 14:48:12',NULL,'ฝีมือพิเศษเฉพาะ',NULL),
	 ('50        ','ตำแหน่งซับซ้อนคงได้',0,1,'2003-12-18 14:48:12',NULL,'ตำแหน่งซับซ้อนคงได้',NULL),
	 ('1000      ','กลุ่มงานบริการพื้นฐาน',1,1,'2010-05-31 10:47:01',10,'กลุ่มที่ 1',NULL),
	 ('2000      ','กลุ่มงานสนับสนุน',1,1,'2010-05-31 10:47:01',20,'กลุ่มที่ 2',NULL);
INSERT INTO DPISEMP1.PER_POS_GROUP (PG_CODE,PG_NAME,PG_ACTIVE,UPDATE_USER,UPDATE_DATE,PG_SEQ_NO,PG_NAME_SALARY,PG_OTHERNAME) VALUES
	 ('3000      ','กลุ่มงานช่าง',1,1,'2010-05-31 10:47:01',30,'กลุ่มที่ 3',NULL),
	 ('4000      ','กลุ่มงานเทคนิคพิเศษ',1,1,'2010-05-31 10:47:01',40,'กลุ่มที่ 4',NULL);
