INSERT INTO DPISEMP1.PER_TYPE (PT_CODE,PT_NAME,PT_GROUP,PT_ACTIVE,UPDATE_USER,UPDATE_DATE,PT_SEQ_NO,PT_OTHERNAME) VALUES
	 ('11        ','ทั่วไป',1,1,1,'2004-01-06 16:56:59',NULL,NULL),
	 ('12        ','ว',1,0,1,'2004-01-06 16:56:59',NULL,NULL),
	 ('21        ','วช.',2,1,1,'2004-01-06 16:56:59',NULL,NULL),
	 ('22        ','ชช.',2,1,1,'2019-11-20 13:14:46',NULL,NULL),
	 ('31        ','บก.',3,0,1,'2004-01-06 16:56:59',NULL,NULL),
	 ('32        ','บส.',3,0,1,'2004-01-06 16:56:59',NULL,NULL),
	 ('14        ','กลุ่มทั่วไป',1,1,1,'2019-11-20 13:13:57',NULL,'กลุ่มทั่วไป'),
	 ('15        ','กลุ่มวิชาการ',1,1,1,'2019-11-20 13:15:42',NULL,'กลุ่มวิชาการ'),
	 ('23        ','กลุ่มวิชาชีพเฉพาะ',2,1,1,'2019-11-20 13:16:22',NULL,'กลุ่มวิชาชีพเฉพาะ'),
	 ('13        ','กลุ่มสนับสนุน',1,1,1,'2019-11-20 13:12:57',NULL,'กลุ่มสนับสนุน');
INSERT INTO DPISEMP1.PER_TYPE (PT_CODE,PT_NAME,PT_GROUP,PT_ACTIVE,UPDATE_USER,UPDATE_DATE,PT_SEQ_NO,PT_OTHERNAME) VALUES
	 ('24        ','กลุ่มวิชาชีพการลงทุน',2,1,1,'2019-11-20 13:17:05',NULL,'กลุ่มวิชาชีพการลงทุน');
