INSERT INTO DPISEMP1.PER_JOB_FAMILY (JF_CODE,JF_NAME,JF_ACTIVE,UPDATE_USER,UPDATE_DATE,JF_SEQ_NO) VALUES
	 ('01','กลุ่มงานสนับสนุนทั่วไป',1,1,'2007-05-11 13:22:07',NULL),
	 ('02','กลุ่มงานสนับสนุนงานหลักทางเทคนิคเฉพาะด้าน',1,1,'2007-05-11 13:22:07',NULL),
	 ('03','กลุ่มงานให้คำปรึกษา',1,1,'2007-05-11 13:22:07',NULL),
	 ('04','กลุ่มงานบริหาร',1,1,'2007-05-11 13:22:07',NULL),
	 ('05','กลุ่มงานนโยบายและวางแผน',1,1,'2007-05-11 13:22:07',NULL),
	 ('06','กลุ่มงานศึกษาวิจัยและพัฒนา',1,1,'2007-05-11 13:22:07',NULL),
	 ('07','กลุ่มงานข่าวกรองและสืบสวน',1,1,'2007-05-11 13:22:07',NULL),
	 ('08','กลุ่มงานออกแบบเพื่อพัฒนา',1,1,'2007-05-11 13:22:07',NULL),
	 ('09','กลุ่มงานความสัมพันธ์ระหว่างประเทศ',1,1,'2007-05-11 13:22:07',NULL),
	 ('10','กลุ่มงานบังคับใช้กฏหมาย',1,1,'2007-05-11 13:22:07',NULL);
INSERT INTO DPISEMP1.PER_JOB_FAMILY (JF_CODE,JF_NAME,JF_ACTIVE,UPDATE_USER,UPDATE_DATE,JF_SEQ_NO) VALUES
	 ('11','กลุ่มงานเผยแพร่ประชาสัมพันธ์',1,1,'2007-05-11 13:22:07',NULL),
	 ('12','กลุ่มงานส่งเสริมความรู้',1,1,'2007-05-11 13:22:07',NULL),
	 ('13','กลุ่มงานบริการประชาชนด้านสุขภาพและสวัสดิภาพ',1,1,'2007-05-11 13:22:07',NULL),
	 ('14','กลุ่มงานบริการประชาชนทางศิลปวัฒนธรรม',1,1,'2007-05-11 13:22:07',NULL),
	 ('15','กลุ่มงานบริการประชาชนทางเทคนิคเฉพาะด้าน',1,1,'2007-05-11 13:22:07',NULL),
	 ('16','กลุ่มงานเอกสารราชการและทะเบียน',1,1,'2007-05-11 13:22:07',NULL),
	 ('17','กลุ่มงานการปกครอง',1,1,'2007-05-11 13:22:07',NULL),
	 ('18','กลุ่มงานอนุรักษ์',1,1,'2007-05-11 13:22:07',NULL);
