INSERT INTO DPISEMP1.PER_COMPETENCE (CP_CODE,CP_NAME,CP_MEANING,CP_MODEL,CP_ACTIVE,UPDATE_USER,UPDATE_DATE,CP_ENG_NAME,CP_ASSESSMENT,DEPARTMENT_ID,DEF_WEIGHT) VALUES
	 ('101','การมุ่งผลสัมฤทธิ์',NULL,1,1,1,'2007-05-11 13:22:07',NULL,'Y',3062,20),
	 ('102','การบริการที่ดี',NULL,1,1,1,'2020-11-24 14:55:03','การบริการที่ดี','Y',3062,20),
	 ('103','การสั่งสมความเชี่ยวชาญในงานอาชีพ',NULL,1,1,1,'2007-05-11 13:22:07',NULL,'Y',3062,20),
	 ('104','การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม',NULL,1,1,1,'2020-11-24 14:54:45','การยึดมั่นในความถูกต้องชอบธรรมและจริยธรรม','Y',3062,20),
	 ('105','การทำงานเป็นทีม',NULL,1,1,1,'2020-11-24 14:54:13','การทำงานเป็นทีม','Y',3062,20),
	 ('201','การวางแผนและการจัดระบบงาน',NULL,2,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('202','การพัฒนาผู้ใต้บังคับบัญชา',NULL,2,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('203','ความเป็นผู้นำ',NULL,2,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('301','การคิดวิเคราะห์',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('302','การมองภาพองค์รวม',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL);
INSERT INTO DPISEMP1.PER_COMPETENCE (CP_CODE,CP_NAME,CP_MEANING,CP_MODEL,CP_ACTIVE,UPDATE_USER,UPDATE_DATE,CP_ENG_NAME,CP_ASSESSMENT,DEPARTMENT_ID,DEF_WEIGHT) VALUES
	 ('303','การพัฒนาศักยภาพคน',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('304','การสั่งการตามอำนาจหน้าที่',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('305','การสืบเสาะหาข้อมูล',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('306','ความเข้าใจข้อแตกต่างทางวัฒนธรรม',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('307','ความเข้าใจผู้อื่น',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('308','ความเข้าใจองค์กรและระบบราชการ',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('309','การดำเนินการเชิงรุก',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('310','ความถูกต้องของงาน',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('311','ความมั่นใจในตนเอง',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('312','ความยืดหยุ่นผ่อนปรน',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL);
INSERT INTO DPISEMP1.PER_COMPETENCE (CP_CODE,CP_NAME,CP_MEANING,CP_MODEL,CP_ACTIVE,UPDATE_USER,UPDATE_DATE,CP_ENG_NAME,CP_ASSESSMENT,DEPARTMENT_ID,DEF_WEIGHT) VALUES
	 ('313','ศิลปะการสื่อสารจูงใจ',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('314','สภาวะผู้นำ',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('315','สุนทรียภาพทางศิลปะ',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('316','วิสัยทัศน์',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('317','การวางกลยุทธ์ภาครัฐ',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('318','ศักยภาพเพื่อนำการปรับเปลี่ยน',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('319','การควบคุมตนเอง',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL),
	 ('320','การให้อำนาจแก่ผู้อื่น',NULL,3,1,1,'2007-05-11 13:22:07',NULL,'N',3062,NULL);
