INSERT INTO DPISEMP1.PER_HEIRTYPE (HR_CODE,HR_NAME,HR_ACTIVE,UPDATE_USER,UPDATE_DATE,HR_SEQ_NO,HR_OTHERNAME) VALUES
	 ('01','บิดา',1,1,'2003-07-30 13:56:42',NULL,NULL),
	 ('02','มารดา',1,1,'2003-07-30 13:57:00',NULL,NULL),
	 ('03','บุตร',1,1,'2003-07-30 13:57:16',NULL,NULL),
	 ('04','บุตรบุญธรรม',1,1,'2003-07-30 13:57:26',NULL,NULL),
	 ('05','พี่ร่วมบิดามารดาเดียวกัน',1,1,'2003-07-30 13:57:38',NULL,NULL),
	 ('06','น้องร่วมบิดามารดาเดียวกัน',1,1,'2003-07-30 13:57:57',NULL,NULL),
	 ('07','ญาติ หรือ อื่นๆ',1,1,'2003-07-30 13:58:12',NULL,NULL),
	 ('08','สามี หรือ ภรรยา',1,1,'2003-09-10 10:30:21',NULL,NULL);
