INSERT INTO DPISEMP1.PER_MESSAGE (MSG_ID,MSG_HEADER,MSG_DETAIL,MSG_SOURCE,MSG_POST_DATE,MSG_START_DATE,MSG_FINISH_DATE,USER_ID,MSG_TYPE,MSG_DOCUMENT,MSG_ORG_NAME,MSG_SHOW,UPDATE_USER,UPDATE_DATE) VALUES
	 (7,'สรุปการปรับปรุงระบบ DPIS 4.0.0.38','
P0101 ข้อมูลบุคคล แสดงจำนวนไม่ถูกต้อง เมื่อตรวจสอบกับเมนู A03 จำนวนไม่เท่ากัน
P0311 โปรแกรมจัดคนลงตามส่วนราชการใหม่ เมื่อยืนยันแล้ว ระบบไม่ update ข้อมูลให้
R0406 รายงานประวัติข้าราชการ วันเกษียณอายุราชการมีทั้งวันที่ 1 ต.ค. และ 30 ก.ย. ที่ถูกต้อง ต้องเป็นวันที่ 1 ต.ค.
P0307 หลังจากยืนยันคำสั่งแล้ว ในประวัติตรงส่วนหน่วยงานไม่บันทึกให้ / ข้อมูลทั่วไป ระดับตำแหน่งไม่แสดง
R0201 จำนวนข้าราชการแยกตามระดับตำแหน่ง เมื่อออกรายงานเป็นระดับสำนักฯ และจำแนกข้อมูลตามต่ำกว่าสำนัก / กอง 1 ระดับ บรรทัดสุดท้ายแสดงข้อมูลชื่อฝ่ายซ้ำกัน
R0310 รายชื่อข้าราชการที่บรรจุในปีงบประมาณ ในส่วนของการจำแนกข้อมูล ให้สามารถเลือกเงื่อนไขได้
R0407 รายชื่อข้าราชการ ในส่วนของลูกจ้างประจำ,พนักงานราชการ แสดงผลไม่ถูกต้อง
การเลื่อนเงินเดือนลูกจ้าง เมื่อทำบัญชีแล้ว ยืนยัน ในประวัติรายการล่าสุดที่ยืนไม่ใส่ให้ว่าเป็นรายการล่าสุด
S0201 ตำแหน่งข้าราชการ ปุ่มแสดงทั้งหมด ใช้ไม่ได้ 
S0201 ตำแหน่งข้าราชการ ส่งออกเป็น Excel หัวตารางไปทับข้อมูล คนที่ 1
S0203 แสดงข้อมูลซ้ำ เฉพาะตำแหน่งที่มีคนเคยครอง แต่พ้นไปแล้ว
A06 ทำบัญชีเลื่อนเงินเดือนข้าราชการ กรณีเพิ่มข้อมูลเอง ระบบ นำข้อมูลคนที่พ้นจากส่วนราชการแล้ว  มาเข้าสู่บัญชีด้วย
			','สำนักงาน ก.พ.','2011-10-01','2011-10-01','2012-10-01',1,0,NULL,NULL,1,1,'2011-11-18 13:59:15'),
	 (2,'สรุปการปรับปรุงระบบ DPIS 4.0.0.27','P0805 เมื่อยืนยันข้อมูลแล้ว ไม่ไปบันทึกที่ประวัติการอบรม
เพิ่มฟิลด์ เทียบเท่าสำนัก / กอง ที่ประวัติการดำรงตำแหน่ง และ R0406 ตรงส่วนของประวัติการรับราชการ
M0311 ประเภทการเคลื่อนไหว ไม่สามารถแสดงข้อมูลและเพิ่มได้
K08 ส่วนที่ 2 การให้คะแนนสมรรถนะ ไม่สามารถให้คะแนนเป็นทศนิยมได้
P0102 ประวัติการดำรงตำแหน่ง ฐานข้อมูล Access ไม่สามารถเพิ่มข้อมูลได้
P0103 ประวัติเงินเดือน ฐานข้อมูล Access ไม่สามารถเพิ่มข้อมูลได้
P1404 สำนักงบประมาณ ขึ้น Error Active X Controls
R0406 สำนักงบประมาณ เลือกรายงาน PDF แล้วขึ้น Error
R0406 สำนักงบประมาณ เลือกรายงาน Excel แล้วขึ้นหน้าจอว่าง ๆ
รายงาน R0703 ให้ข้าราชการ / ลูกจ้าง สามารถเข้าดูข้อมูลเป็นรายบุคคลได้
เมนู P0103 (สำนักงานอัยการสูงสุด) เมื่อเลือกประเภทการเคลื่อนไหวแล้วข้อมูลไม่แสดง
ประวัติการรับเงินเดือน ข้อมูลของกรมประชาสัมพันธ์ ตรงลงวันที่ กรณีที่ไม่มีข้อมูลวันที่ ระบบจะแสดงเป็น 543
รายงาน R0206 รายงานแสดง ชาย / หญิง ซ้ำ
รายงาน R0202 เมื่อจำแนกข้อมูลเป็นประเทศ กับ จำแนกเป็นสำนักกอง ข้อมูลทั้งสองรวมออกมาไม่เท่ากัน
รายงาน R0208 ผลรวมจำนวนคนทั้งหมด ไม่ตรงกับข้อมูลจริงที่มี
รายงาน R0209 ผลรวมจำนวนคนทั้งหมด ไม่ตรงกับข้อมูลจริง
รายงาน R0203 นับจำนวนคนออกมาไม่ถูกต้อง
รายงาน R0301 รายงาน ไม่แสดงข้อมูล แสดงแต่ตาราแต่ภายในตารางไม่มีข้อมูล
รายงาน R0306 รายงาน ไม่แสดงข้อมูล แสดงแต่ตาราแต่ภายในตารางไม่มีข้อมูล
รายงาน R0307 รายงานแสดงไม่ถูกต้อง
รายงาน R0308 รายงานแสดงไม่ถูกต้อง','สำนักงาน ก.พ.','2010-11-20 14:25:24','2010-11-01 14:25:24','2011-11-01 14:25:24',1,0,NULL,'สำนักงาน ก.พ.',0,1,'2010-11-20 14:25:24'),
	 (3,'สรุปการปรับปรุงระบบ DPIS 4.0.0.30','M0310 ชื่อตำแหน่งพนักงานราชการ สำหรับฐานข้อมูล Access ระบบไม่บันทึกข้อมูล
P0101 ประวัติครอบครัว ไม่บันทึกข้อมูลในส่วนของ ณ จังหวัด และ อาศัยในจังหวัด
P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ เมื่อคลิกที่ เพิ่มรายการบุคคลแล้ว หลังจากคลิกปุ่มเลือกกรม จะไม่ปรากฏข้อมูลกรมให้เลือก
P0101 ประวัติการดำรงตำแหน่ง เมื่อคลิกรายการขึ้นมาแก้ไข ข้อมูลส่วนของกระทรวงจะขึ้นเป็น ส่วนราชการไทย
รายงาน R0406 ในส่วนของปีที่เกษียณ แสดงข้อมูลเป็น 603 หรือไม่ก็ 604
P0601 การลา / สาย คลิกที่ เลือกประเภทการลาแล้วเกิด Script Error
P0501 ในส่วนของ Report ข้อมูลวันที่แสดงรูปแบบผิด
P0501 ในส่วนของ Report ข้อมูลสำนัก / กอง ไม่แสดงข้อมูล
P0101 คำนำหน้าชื่อคู่สมรส ไม่แสดง
P0101 จัดหน้าตาใหม่โดยเอาข้อมูล กระทรวง,กรม,สำนัก/กอง ไว้ที่ด้านขวา และเอาชื่อ ,นามสกุล , เลขที่ตำแหน่ง ฯลฯ ไว้ที่ด้านซ้าย
P0119 เพิ่มฟิลด์ เลขที่แฟ้มขึ้นมา
เมนู S0202 และ S0203 ในการส่งออกข้อมูลเป็น Excel อยากให้มีข้อมูลเช่น กลุ่มบัญชีค่าจ้าง , หมายเหตุ ด้วย
C02 กลุ่มผู้ใช้งาน ไม่สามารถเข้าไปจัดการ User ได้ เนื่องจากไม่สามารถเลือกรายการจาก Dropdown List ชื่อกลุ่มได้
ประวัติทายาท ให้ฟิลด์ วันเดือน ปีเกิด ไม่บังคับคีย์ เนื่องจากบางทีไม่มีข้อมูลวันเดือน ปีเกิด
R0406 ถ้าเลือกเงื่อนไข "เลือกรายชื่อ" ถ้ายังไม่ได้เลือกรายชื่อใครเลยให้มีข้อความ alert แจ้งเตือนว่าให้เลือกรายชื่อก่อน
S0201 เมื่อเพิ่มเลขที่ตำแหน่งต่อเนื่องเรื่อย ๆ ระบบจะ alert ขึ้นมาว่า กรุณาระบุ สำนัก/กอง ทั้ง ๆ ที่ข้อมูล สำนัก/กอง ได้เลือกไว้ให้อยู่แล้ว
ปรับ Session การใช้งานเป็น 20 นาที','สำนักงาน ก.พ.','2011-03-01 11:40:34','2011-02-01 11:40:34','2012-02-01 11:40:34',1,0,NULL,'สำนักงาน ก.พ.',0,1,'2011-03-01 11:40:34'),
	 (9,'Patch Update DPIS Release 5.0.0.26','
1. K08 การประเมิน KPI รายบุคคล
แก้ข้อผิดพลาดเรื่อง คัดลอกข้อมูลรอบการประเมินก่อนมาแล้วเอกสารแนบมาด้วย เมื่อลบเอกสารแนบ ข้อมูลเอกสารแนบของปีที่คัดลอกมาก็หายไปด้วย
2. P0101 ข้อมูลบุคคล
แก้ข้อผิดพลาดเรื่อง ข้าราชการรับโอนเนื่องจากสอบแข่งขันได้เปลี่ยนระดับ ระบบแสดงผลผิดวัน
3. R0701 รายงานการมาปฏิบัติราชการ ประจำวัน
แก้ข้อผิดพลาดเรื่อง ลูกจ้างประจำไม่มีข้อมูล
4. P0601 การลา
แก้ข้อผิดพลาดเรื่อง ไม่สามารถค้นหาจากสำนัก และหาจากรายชื่อได้ เข้าเป็น Admin 
5. K08 การประเมิน KPI รายบุคคล
แก้ข้อผิดพลาดเรื่อง เพิ่มตัวชี้วัดเลือก ตามหน้าที่ความรับผิดชอบหลัก แล้วออกรายงานไม่แสดงข้อมูล
6. P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
แก้ข้อผิดพลาดเรื่อง ไม่มีข้อมูล 
7. A03 ผลการประเมินการปฏิบัติราชการ
แก้ข้อผิดพลาดเรื่อง ไม่สามารถบริหารค่าตอบแทนในระดับต่ำกว่าสำนัก/กอง 1 ระดับได้
คะแนน ระบบแสดงหมดทั้งสำนัก
8. A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
แก้ข้อผิดพลาดเรื่อง ไม่สามารถบริหารค่าตอบแทนในระดับต่ำกล่าสำนัก/กอง 1 ระดับได้
ไม่แสดงชื่อระดับผลการประเมินย่อย (ใช้ระดับผลการประเมินย่อยเหมือนกันทั้งกรม)
บริหารแล้วไม่พบคน
9. C02 กลุ่มผู้ใช้งาน 
แก้ข้อผิดพลาดเรื่อง เอาสิทธิของกลุ่มข้าราชการออกในส่วนของวันหยุดพิเศษและพ้นจากส่วนราชการออกไม่ได้
10. P0304 บัญชีแนบท้ายคำสั่งย้าย
P0310 บัญชีแนบท้ายคำสั่งเลื่อน
แก้ข้อผิดพลาดเรื่อง ไม่สามารถทำบัญชีย้ายเลื่อนในระดับกระทรวงได้ ที่กระทรวงว่าใช้ได้ เค้า Test แล้วยังไม่ได้ Release 24a 
11. K08 การประเมิน KPI รายบุคคล
แก้ข้อผิดพลาดเรื่อง แสดงจำนวนสมรรถนะไม่ถูกต้อง
12. R0202 จำนวนข้าราชการจำแนกตามระดับการศึกษาและประเทศที่สำเร็จการศึกษา
แก้ข้อผิดพลาดเรื่อง ชื่อระดับ บริหาร และ อำนวยการ มีแต่คำว่า สูง กับ ต้น
13. R0302 จำนวนข้าราชการที่ออกจากราชการในปีงบประมาณ
แก้ข้อผิดพลาดเรื่อง ไม่แสดงจำนวนข้าราชการที่ออกจากราชการ 
14. P0140 ประวัติการแก้ไขวันเดือนปีเกิด
แก้ข้อผิดพลาดเรื่อง แก้วันเดือนปีเกิดแล้ววันเกษียณไม่เปลี่ยน
15. R0400 ก.พ.7 อิเล็กทรอนิกส์
แก้ข้อผิดพลาดเรื่อง คลิกปุ่ม ก.พ.7 ทั้งฉบับ ในตัวรายงานระบบจะไม่แสดงประวัติการศึกษา ประวัติการฝึกอบรม ที่อยู่ปัจจุบัน / ที่อยู่ตามทะเบียนบ้าน และจำนวนวันลาหยุด ขาดราชการ มาสาย
	ฯลฯ
				','สำนักงาน ก.พ.','2014-04-01','2014-04-01','2015-04-01',1,0,NULL,NULL,1,1,'2014-05-28 14:39:45'),
	 (11,'Patch Update DPIS Release 5.0.0.30','
1. P0109 ทายาทผู้รับผลประโยชน์
ส่วนของทายาทผู้รับผลประโยชน์  ควรมีการระบุ 2 ประเภท คือ
- ผู้รับบำเหน็จตกทอด   มีได้หลายคน  รายละเอียดประกอบด้วย ชื่อ-นามสกุล 
ที่อยู่ เบอร์โทรติดต่อ
- ผู้รับเงินช่วยเหลือกรณีข้าราชการเสียชีวิต มีได้ 1 คน	ชื่อ-นามสกุล ที่อยู่ เบอร์โทรติดต่อ
2. P0110 ประวัติการลา
จำนวนวันลาคลอดบุตรแสดงไม่ถูกต้องเช่น
ลาวันที่ 1/4/57 - 24/4/57 ต้องเป็น 24 วัน แต่ระบบแสดงเป็น 25 วัน
ลาวันที่ 1/4/57 - 30/4/57 ต้องเป็น 30 วัน แต่ระบบแสดงเป็น 31 วัน
3. P0115 ประวัติการเปลี่ยนชื่อ-สกุล 
ไม่สามารถแก้ไขคำนำหน้าชื่อเดิมได้
4. P0129 ครอบครัว 
ตรงรายละเอียดสถานะการเป็นบิดา มารดา หรือบุตร ไม่เปลี่ยนตามที่เลือก
5. P0131 ภาพถ่าย/ลายเซ็นต์ 
ไม่สามารถเพิ่มภาพถ่ายได้
6. P0133 เอกสารหลักฐาน 
ไม่แสดงเมนูหากเข้าระบบด้วยสิทธิ์บุคลากร
7. P0203  บัญชีแนบท้ายคำสั่งบรรจุ/รับโอน 
ในส่วนของพนักงานราชการแสดงข้อมูลผิดพลาด ในส่วนของตำแหน่งที่ได้รับการคัดเลือก/สอบแข่งขันได้ และในส่วนของรายงาน ในช่องตำแหน่งตำแหน่ง/สังกัด ไม่แสดงข้อมูล
8. P0303 สอบถามข้อมูลข้าราชการ/ลูกจ้างสมควรสับเปลี่ยน
- ขอให้เพิ่มวันที่ที่ระบบคำนวณให้ด้วย (เดิมเคยเห็นว่ามี แต่ตอนนี้ไม่มีแล้ว) อย่างเช่น อายุราชการ 2 ปี 3 เดือน ก็อยากให้ใส่ด้วยว่า 2 ปี 3 เดือน นี้คำนวณจากวันที่เท่าไหร่
- การส่งออกรายงาน ระบบแสดงผลผิด column ครับ เช่น column อายุราชการ แต่ระบบนำค่าของจำนวนวันที่อยู่ในระดับ มาใส่ให้
9. P0304  บัญชีแนบท้ายคำสั่งย้าย 
ติดสังกัดเดิมในส่วนของการเพิ่มรายการบุคคล
10. P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่ 
ไม่สามารถยืนยันคำสั่งได้ เท่าที่ตรวจสอบดูเหมือนว่าเลขที่ตำแหน่งที่ซ้ำนั้น ระบบไปเช็คของ สำนักงานรัฐมนตรีด้วย
11. P0403 เลื่อนขั้นเงินเดือน
P0404 บัญชีแนบท้ายคำสั่งเลื่อนขั้นเงินเดือน
ในส่วนกลางจะใช้บัญชีเดียวกัน แต่ระบบให้ระบุทีละสำนัก/กอง ซึ่งไม่สะดวกในการทำงาน เลยอยากให้เพิ่มส่วนที่เลือกทีเดียวทั้งส่วนกลางเลย
12. P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ 
ไม่แสดงข้อมูลลูกจ้างประจำหลังจากคลิกปุ่มเลือกรายชื่อ
13. P1108 ระบบเครื่องราชฯ ของสำนักเลขาธิการคณะรัฐมนตรี
เงินประจำตำแหน่งจากเดิมเป็น อ.ต้น 5600 แต่ลดตำแหน่งเป็น ชพ 3500  แต่ดึงข้อมูลมาแล้วยังเป็น 5600 อย่างเดิม
14. R0310 รายชื่อข้าราชการที่บรรจุในปีงบประมาณ
รายงานผิด บรรจุปี 2555 แต่ปรากฏปี 2556
15. R0311 รายชื่อข้าราชการที่ออกจากราชการในปีงบประมาณ
รายชื่อคนที่พ้นจากส่วนราชการ จำนวนคนออกมาไม่ตรง มีรายชื่อซ้ำด้วย รบกวนตรวจสอบให้ด้วย
รายงานออกมาซ้ำซ้อนกัน  และขอเพิ่มเติมกอง/สำนักที่สังกัดสุดท้ายก่อนออกด้วย
16. R0400 ก.พ.7 อิเล็กทรอนิกส์
การออกรายงาน ก.พ.7 ตรงเอกสารอ้างอิง ไม่ต้องการให้โชว์ administration 
17. R0702 รายงานการมาปฏิบัติราชการชองข้าราชการ ประจำเดือน
กำหนดสิทธิ์ให้หน่วยงานในสังกัดเข้าถึงข้อมูลในแต่ระดับสำนัก/กองตามมอบหมายงาน ซึ่งกำหนดให้เห็นรายงาน (ในหลายรายงาน) เฉพาะในข้อมูลของสำนัก/กองตน แต่ปรากฏว่า ระบบออกรายงาน เป็นทั้งส่วนราชการ 
18. K08 การประเมิน KPI รายบุคคล
หากเพิ่มแฟ้มการประเมินไปแล้ว เมื่อมีการย้ายสังกัด ระบบไม่สามารถแก้ไขสังกัดใหม่ได้
19. M0311 ประเภทการเคลื่อนไหว
ข้อมูลหลัก ประเภทการเคลื่อนไหวเลื่อนเงินเดือนดีเด่น ประเภทการเคลื่อนไหวเงินเดือน ประเภทย่อย ดีเด่น เข้าไปเพิ่มในประวัติการเลื่อนเงินเดือนแล้วหาไม่เจอ
กำหนดสิทธิการใช้งาน จำนวน 65 ข้อมูล แต่พอเวลามีเพิ่ม ปรับปรุง แก้ไข ข้อมูลบุคคล ในเมนู เงินเดือน ปรากฏว่า ข้อมูลเคลื่อนไหวบางอย่างหายไป เช่น การเลื่อนเงินเดือนระดับดีมาก หายไป จึงทำให้ไม่สามารถแก้ไขข้อมูลบุคคลได้
				','สำนักงาน ก.พ.','2014-08-01','2014-08-01','2015-08-01',1,0,NULL,NULL,1,1,'2014-09-26 11:11:27'),
	 (13,'Patch Update DPIS Release 5.0.0.36','
1. R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ เรียงตามลำดับอาวุโส กรณีเลือกหน่วยงานตามมอบหมาย จะแสดงหน่วยงานระดับต่ำกว่ากองผิด
2. S0202 ตำแหน่งลูกจ้างประจำ ไม่แสดงชื่อผู้ครองตำแหน่งเมื่อส่งออกรายงาน
3. P1503 บัญชีแนบท้ายคำสั่งช่วยราชการ ส่งออกไฟล์ PDF, RTF, EXCEL ระบบไม่แสดงชื่อหน่วยงานที่ไปช่วยราชการ เมื่อทำการเพิ่มรายการบุคคล ไม่สามารถเลือกสำนัก/กองได้
4. S0201 ตำแหน่งข้าราชการ ไม่สามารถค้นหาตำแหน่งตามสถานภาพของตำแหน่งได้อย่างถูกต้อง 
5. R0905 รายงานตัวชี้วัดรายบุคคล ไม่แสดงชื่อหน่วยงาน ตามภาพที่แนบมาด้วย
6. K08 การประเมิน KPI รายบุคคล แบบฟอร์มการประเมินผลการปฏิบัติราชการ ส่วนที่ 2 น้ำหนัก ให้ผู้รับการประเมินสามารถเพิ่มน้ำหนักด้วยตนเอง เพื่อให้เป็นแนวทางเดียวกันกับส่วนของผลสัมฤทธิ์ของงานและลดภาระของผู้ประเมินกรณีมีผู้รับการประเมินหลายคน คลิกปุ่มคัดลอกสมรรถนะ แล้วระบบไม่คัดลอกสมรรถนะจาก K07 ให้
7. R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด ต้องการเพิ่มเติมในการดึงรูปพร้อมรายงาน เพื่อใช้ประกอบการพิจารณาและการทำ PW ให้ผู้บริหารทราบ
8. P0106 ประวัติการอบรม/ดูงาน/สัมมนา เมื่อทำการเพิ่มข้อมูลและคลิกเลือกหลักสูตรการฝึกอบรม/ดูงาน พบว่ามีข้อความขึ้นมา 
9. P0101 ข้อมูลบุคคลากร เมื่อทำการบันทึกที่อยู่และเบอร์โทรแล้ว เบอร์โทรไม่ไปปรากฏที่ข้อมูลทั่วไป
10. P0303 สอบถามข้อมูลข้าราชการ/ลูกจ้างสมควรสับเปลี่ยน พบปัญหาดังนี้
- เลือกระดับตำแหน่ง ถึง ระดับตำแหน่ง และคลิก เลือก นับถึงวันที่ หน้าจอจะล้างค่าการเลือกระดับที่เลือกไว้ก่อนหน้า และปฏิทินไม่แสดงให้
- การนับถึงวันที่ ขอให้ทุกเงื่อนไขที่ระบุจำนวนปี อ้างอิงจากวันที่ที่ต้องการให้นับถึง
- เมื่อส่งออกไฟล์ PDF และ EXCEL ระบบไม่แสดงค่าของระยะเวลาที่อยู่ในเลขที่ตำแหน่ง และ ระยะเวลาที่อยู่ในสำนัก/กอง
- คลิกปุ่ม ล้างหน้าจอ ช่องนับถึงวันที่ ไม่ล้างค่าให้
11. R0406 ประวัติข้าราชการ ในข้อมูลประวัติดำรงตำแหน่ง ระบบมีข้อมูลประเภทตำแหน่ง เช่น ว วช แต่เมื่อพิมพ์รายงาน R0406 ในตัวเลือก ก.พ.7 PDF แล้ว ว วช ไม่มีออกมาด้วย
12. P0129 ครอบครัว
- ในส่วนของมารดา เลือก เป็นมารดาโดยสารเลือด เมื่อใส่ประเภทเอกสาร โดยกรอกเลขที่เอกสารและ วันที่ แล้วทำการบันทึก  จากนั้นทำการเปิดใหม่อีกครั้ง พบว่าข้อมูลเลขที่เอกสารที่กรอกไว้หายไป ไม่ได้ถูกบันทึก 
- ในส่วนของบิดา เลือก เป็นบิดาโดยสมรสกับมารดา เมื่อใส่ประเภทเอกสาร โดยกรอกเลขที่เอกสารและ วันที่ แล้วทำการบันทึก  จากนั้นทำการเปิดใหม่อีกครั้ง พบว่าข้อมูลเลขที่เอกสารที่กรอกไว้หายไป ไม่ได้ถูกบันทึก รวมทั้งการเป็นบิดาโดยสมรสกับมารดา ก็ไม่ได้ถูกเลือก
				','สำนักงาน ก.พ.','2015-02-01','2015-02-01','2016-02-01',1,0,NULL,NULL,1,1,'2015-03-03 14:09:10'),
	 (10,'Patch Update DPIS Release 5.0.0.27','
1. R0406 ประวัติข้าราชการ
ออกรายงาน ก.พ.7 PDF ข้อมูลการเลื่อนเงินเดือน ช่องตำแหน่ง และเลขตำแหน่ง เป็นเครื่องหมาย –
2. R0103 รายชื่อตำแหน่งว่าง 
เข้าเป็นสำนัก/กอง แล้วสำนัก/กองไม่แสดง
ไม่แสดงข้อมูลของพนักงานราชการ
3. R0402 รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณ
ลูกจ้างประจำ ไม่แสดงชื่อสำนัก/กองให้ ที่ปุ่ม บัญชีรายชื่อ
4. K08 การประเมิน KPI รายบุคคล
ไม่ให้ผู้ประเมินแนบไฟล์ของลูกน้อง
รายงาน K08 พิมพ์แล้วปรากฏว่าตำแหน่งและสังกัดหายไป   ในช่วงเช้าปรากฏ  แต่ในช่วงบ่ายข้อมูลหายไป
5. P1103 แบบ คปร.7
แสดงไม่ครบทุกตำแหน่ง มีตำแหน่งว่างบางตำแหน่งไม่แสดงขึ้นมา
6. R0703 รายงานการลารายบุคคล
ในรูปแบบ excel ไม่แสดงข้อมูลช่องการลากิจส่วนตัวเพื่อเลี่ยงดูบุตร  แต่เมื่อเรียกรายงาน PDF ระบบแสดงข้อมูล
7. R0406 ประวัติข้าราชการ
ในส่วนของพนักงานราชการ ก.พ.7(PDF) ไม่แสดงชื่อตำแหน่ง และเงินเดือน 
ดูรายงานรูปแบบ PDF ไม่แสดงชื่อตำแหน่ง
8. A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน
เวลาทำคำสั่ง เลือนเงินเดือน ในช่องหมายเหตุ (ขณะเวลาทำคำสั่ง) กรอกไปแล้ว พอกดยืนยันคำสั่ง ไปแล้วไม่วิ่งมาในประวัติเงินเดือนในช่องหมายเหตุ 
9. R0406 ประวัติข้าราชการ
ขอเพิ่มเติม ในส่วน ของการรายงาน ก.พ.7 ทั้งฉบับ ที่เป็นรายบุคคล คือ ในการายงานออกมาของไฟล์ที่เป็นไฟล์ Excel ประวัติการศึกษา และ ประวัติการอบรม ยังไม่ออก มาให้ครบตามที่ กรอกเข้าไปในระบบ ในส่วนของประวัติการรักษาราชการแทน มอบหมายงาน ให้รายงานออกมาด้วย
ในส่วนของประวัติเงินเดือน ให้ รายงานในช่อง หมายเหตุ ออกมากับรายงานด้วย 
10. M0602 ปฏิทินวันหยุด
เพิ่มข้อมูล(5 ธ.ค. 57) แล้ว ไม่แสดงข้อมูล / เพิ่มวันซ้ำแล้วระบบไม่รับ
11. R0702 รายงานการมาปฏิบัติราชการ ประจำเดือน
วันลาพักผ่อน 21/04/2557, 30/04/2557 - 02/05/2557 รายงานนับจำนวนวันไม่ถูกต้อง โดยแสดงเพียง 2 วัน
12. P0103 ประวัติการรับเงินเดือน 
เงินประจำตำแหน่ง ป้อนวันที่สิ้นสุดแล้ว ยังแสดงข้อมูลในหน้าข้อมูลบุคคล
13. P0106 ประวัติการอบรม/ดูงาน/สัมมนา
เพิ่มค่าใช้จ่ายในการอบรม
14. P0303 สอบถามข้อมูลข้าราชการ/ลูกจ้างสมควรสับเปลี่ยน
เพิ่มข้อความ ใช้กับโครงสร้างตามกฎหมาย
15. P0301 ข้อมูลข้าราชการ/ลูกจ้างขอย้าย
หน้าจอแสดงข้อมูลไม่ถูกต้อง
16. ข่าวสารและประชาสัมพันธ์ 
Default ประเภทหาย เมื่อคลิกปุ่มเลือกรายชื่อ ใส่เงื่อนไขที่ต้องการ คลิกปุ่มค้นหา หน้าต่างจะปิดไป และไม่สามารถเลื่อนไปดูหน้าถัดไปได้
17. R0600 รายงานการเลื่อนเงินเดือนรายบุคคล
ระบบแสดงหนังสือแจ้งผลการเลื่อนเงินเดือนเพียงรายการเดียว
18. R0702 รายงานการมาปฏิบัติราชการ ประจำเดือน
- หากเป็นประเภทการลาคือ ไปปฏิบัติราชการ ระบบจะนับเกินจำนวนวันที่ลาจริง
- พนักงานราชการ ระบบไม่แสดงรายละเอียดการลา
- การนับจำนวนครั้งของการลา หากเป็นการลาคร่อมเดือน ให้ระบบนับเฉพาะในเดือนแรกของการลาเท่านั้น
19. K08 การประเมิน KPI รายบุคคล
เลือกตัวชี้วัดอ้างอิงแล้ว ระบบไม่แสดงประเด็นของตัวชี้วัดนั้น (ซึ่งอ้างอิงมาจาก K01)
คัดลอกข้อมูลให้ใช้สำนัก/กองปัจจุบัน
จำนวนไฟล์แนบไม่แสดง
20. K01 การประเมินผลการปฏิบัติราชการ  
เมื่อต้องการเพิ่มประเด็นตัวชี้วัดแล้วคลิกที่ข้อความ "การประเมินผลการปฏิบัติราชการ ประจำปีงบประมาณ 25XX" ที่กรอบตารางด้านซ้ายแล้ว หน้าจอไม่แสดงกล่องข้อความให้เพิ่มข้อมูลประเด็นตัวชี้วัด
21. R0400 ก.พ.7 อิเล็กทรอนิกส์
ปุ่ม ใบ ก.พ. 7, ประวัติย่อ ข้อมูลระดับไม่ตัดบรรทัดให้
22. R0302 จำนวนข้าราชการที่ออกจากราชการในปีงบประมาณ
เลือกสำนัก/กอง ไม่พบข้อมูล 
23. P0601 การลา
เลือกผู้ตรวจสอบการลาไม่ได้
24. P0131 ภาพถ่าย/ลายเซ็นต์
เพิ่มปี พ.ศ. รูป
25. เพิ่มรายชื่อเครื่องราชอิสริยาภรณ์ตามที่สำนักเลขาธิการคณะรัฐมนตรีส่งมาให้
				','สำนักงาน ก.พ.','2014-05-01','2014-05-01','2015-05-01',1,0,NULL,NULL,1,1,'2014-06-27 14:58:51'),
	 (12,'Patch Update DPIS Release 5.0.0.33','
1. K08 การประเมิน KPI รายบุคคล เมื่อทำการแก้ไขข้อมูลของผู้ให้ประเมิน ปรากฏว่ารายงาน PDF ออกมาไม่ถูกต้อง ตามไฟล์ที่แนบมาด้วย
2. P0604 ตั้งค่าวันลาพักผ่อนสะสมในส่วนของข้าราชการ การคำนวณวันลาสะสมเกิดความผิดพลาด
3. ข่าวสารและประชาสัมพันธ์ ให้นำ Alert Box ออก และไม่สามารถแนบไฟล์ได้
4. P08 ศึกษาต่อ/ฝึกอบรม การฝึกอบรม เมื่อใส่ข้อมูลที่จะค้นหา P0119 หรือ ค้นหา ปี พ.ศ. ที่จะอบรม ไม่พบข้อมูลที่ค้นหา
5. S0102 โครงสร้างตามมอบหมายงาน เมื่อทำการนำเข้าข้อมูล ระบบแจ้งว่าไม่สามารถเพิ่มได้ เนื่องจากชื่อซ้ำกับโครงสร้างตามกฎหมาย
6. R0402 รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณ การออกรายงาน อยากให้เพิ่มข้อมูล กลุ่ม/ฝ่ายด้วย เนื่องจากทางหน่วยงานมีความจำเป็นต้องใช้ข้อมูลดังกล่าว
7. R0400 ก.พ.7 อิเล็กทรอนิกส์ การพิมพ์ ก.พ.7 ทั้งฉบับ ไม่ได้ใส่วันเริ่มต้นในตอนบันทึก ประวัติ การอบรม/ดูงาน/สัมมนา แต่พอพิมพ์รายงาน ก.พ.7 ทั้งฉบับ PDF ระบบใส่วันที่ให้เองอัตโนมัติ
8. R0402 รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณไม่แสดงชื่อหน่วยงาน ดังรูปตัวอย่าง  อยากรบกวนให้เพิ่มชื่อหน่วยงานในตัวรายงาน
9. รหัสมาตรฐานระบบสารสนเทศทรัพยากรบุคคล เมื่อทำการเพิ่มข้อมูลใน M0703 สาขาวิชาเอก เมื่อทำการค้นหาปรากฎว่าไม่พบข้อมูลที่ได้เพิ่มเข้าไป
10. P0101 ข้อมูลบุคคลากร ไม่สามารถเปลี่ยนภาพถ่ายได้
11. K08 การประเมิน KPI รายบุคคล เมื่อทำการเปลี่ยนชื่อผู้บังคับบัญชา/ผู้ประเมินแล้ว ปรากฎว่าชื่อตำแหน่งทางการบริหารงานและระดับตำแหน่งของผู้ประเมินไม่ถูกต้อง
12. A03 ผลการประเมินการปฏิบัติราชการ หากคลิกปุ่มเพิ่มข้อมูล ระบบจะดึงรายชื่อของข้าราชการทั้งหมดมาแสดง ซึ่งในความเป็นจริงหากข้าราชการที่บรรจุหลังวันที่ 31 มีนาคม หรือ 30 กันยายน ข้าราชการรายนั้นไม่ควรมีชื่ออยู่ในรอบการประเมินนั้นๆ ทั้งนี้เสนอแนะว่า หากคลิกเลือกรอบที่ 1 ให้ระบบดึงข้อมูลข้าราชการที่บรรจุก่อนวันที่ 1 เมษายน ของรอบการประเมินนั้น หรือ หากคลิกเลือกรอบที่ 2 ให้ระบบดึงข้อมูลข้าราชการเฉพาะที่บรรจุก่อนวันที่ 1 ตุลาคม ของรอบการประเมินนั้น
13. K08 ตำแหน่งทางการบริหารและระดับตำแหน่งไม่ถูกล้างค่า เมื่อคลิกปุ่มล้างค่าในส่วนที่ต้องการ
				','สำนักงาน ก.พ.','2014-11-01','2014-11-01','2015-11-01',1,0,NULL,NULL,1,1,'2015-01-26 10:57:09'),
	 (14,'Patch Update DPIS Release 5.0.0.38','
1. P0119 สอบถามข้อมูลพนักงานราชการ ในส่วนของตำแหน่งปัจจุบัน ไม่สามารถเลือกตำแหน่งในสายงานได้
2. P1503 แนบท้ายคำสั่งช่วยราชการ
-. เวลาลงคำสั่งช่วยลูกจ้างประจำ P1503 แนบท้ายคำสั่งช่วย เพิ่มบัญชี เพิ่มรายบุคคล เลือกเลขที่ตำแหน่ง ตรงสถานะการดำรงตำแหน่งระบบดึงมาเอง เป็นช่วยราชการ 
-. เวลาจะดูข้อมูล เข้ารายละเอียด การดำรงตำแหน่ง เลขที่ตำแหน่งไม่ขึ้น ชื่อตำแหน่งขึ้นเป็นช่วยราชการ 
3. P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ 
เมื่อยืนยันคำสั่งแล้ว เข้าไปดูข้อมูลบุคคล ตรงสถานภาพบุคคล เหตุที่พ้นจากราชการ วันที่ออก เลขที่คำสั่ง ลงวันที่ ไม่ปรากฏข้อมูลอะไรเลย ต้องไปบันทึกที่ ปุ่มรูปดินสอ ก็จะแสดงข้อมูลเพียงเหตุที่ออก ลงวันที่ และเลขที่คำสั่งเท่านั้น
4. R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด
 เมื่อ export ไฟล์ เป็น pdf มีรูปซ้ำกัน เช่น นาย ก มีรูปไปขึ้นซ้ำของ นาย ข เนื่องจาก นาย ข ยังไม่มีการเพิ่มรูปในระบบ
5. P0310 บัญชีแนบท้ายคำสั่งเลื่อน  แสดง code
6. R0103 รายชื่อตำแหน่งว่าง วันที่ตำแหน่งว่าง ในกรณีนี้หมายถึงวันไหน เพราะในระบบ ตำแหน่ง เช่น 1633 เคยมีผู้ดำรงตำแหน่งและย้ายไป เมื่อ 22 พ.ค. 2557 แต่ในระบบกลับลงเป็น 11 ธ.ค. 2551 เป็นวันที่จัดตำแหน่งครั้งแรก
7. P0304 บัญชีแนบท้ายคำสั่งย้าย ไม่สามารถทำแนบท้ายคำสั่งย้ายพนักงานราชการได้ เมื่อเลือกเลขที่ตำแหน่งแล้วข้อมูลที่แสดงในส่วนที่แต่งตั้งข้อมูลหน่วยงานไม่ถูกต้อง
8. R0202 จำนวนข้าราชการจำแนกตามระดับการศึกษาและประเทศที่สำเร็จการศึกษา  R0205 โครงสร้างอายุราชการ รายละเอียดส่วนหัวตารางผิด โดย R0202 มีคอลัมน์วุฒิการศึกษาต่ำกว่าปริญญาตรีซ้ำกัน 2 คอลัมน์ และ R0205 หัวตารางไม่แสดงวันที่ที่นับอายุราชการ
9. P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ พนักงานราชการลาออก แต่ในส่วนของรายละเอียดตำแหน่งในสายงาน ยังแสดงตำแหน่งในสายงาน  เมื่อทำแนบท้ายเรียบร้อยแล้ว หลังจากนั้นคลิกเข้าไปเมนูข้อมูลบุคคล ในส่วนการดำรงตำแหน่ง ชื่อตำแหน่งพนักงานราชการไม่แสดง
10. P0102 ประวัติการดำรงตำแหน่ง ไม่สามารถแก้ไขส่วนราชการระดับกรม ในโครงสร้างตามมอบหมายงานได้
11. P1108 ระบบเครื่องราชฯ ของสำนักเลขาธิการคณะรัฐมนตรี ไม่สามารถส่งออกไฟล์ เหรียญจักรพรรดิมาลา (2) ได้
12. R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ เรียงตามลำดับอาวุโส การออกรายงาน PDF ในคอลัมน์เครื่องราชฯ อยากให้เพิ่มปี พ.ศ.ที่ได้รับเครื่องราชฯ ด้วย
13. K08 การประเมิน KPI รายบุคคล ในส่วนของผู้รับการประเมิน ตำแหน่งในสายงานผิด 
14. P0310 บัญชีแนบท้ายการเลื่อน ในช่องการดำรงตำแหน่งในระดับปัจจุบันเมื่อ .................  ให้นำวันที่เข้าสู่ระดับนั้นจริง อาทิ ปัจจุบันเป็นปฏิบัติการให้เอาวันที่ได้ระดับปฏิบัติการจริงครั้งแรกมาใส่โดยไม่ต้องดูตำแหน่ง แล้วก็เวลาบันทึกข้อมูลยืนยันแล้ว ไม่ต้องมีการเปลี่ยนแปลงข้อมูลใด เนื่องจากเมื่อกดยืนยันแล้ว ปรากฏว่าในช่องดำรงตำแหน่งในระดับปัจจุบันมีการเปลี่ยนแปลงเป็นวันที่ได้รับแต่ตั้งใหม่ ทั้งนี้ขอให้ตรวจสอบรายงานทั้งหมดด้วยว่าเป็นในลักษณะนี้หรือไม่อย่างไร รายงานทุกรายงานไม่ควรมีการเปลี่ยน แปลงหลังกดยืนยัน เนื่องจากหากกลับมาดูอีกครั้งจะผิดไป
15. R0413 รายงานข้อมูลข้าราชการที่ผ่านการฝึกอบรมหลักสูตร ต้องการให้เพิ่มคอลัมน์ในรายงาน
				','สำนักงาน ก.พ.','2015-04-01','2015-04-01','2016-04-01',1,0,NULL,NULL,1,1,'2015-06-19 15:16:22'),
	 (15,'Patch Update DPIS Release 5.0.0.41','
1. A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน เมื่อทำการออกรายงาน Excel พบว่า ข้อมูลในตารางไม่ตรงกับหัวตาราง เช่น ในคอลัมน์ระดับตำแหน่ง มีข้อมูลเงินเดือนเต็มขั้นแทนที่จะเป็นข้อมูลระดับตำแหน่ง
2. P0101 ข้อมูลบุคลากร และ A03 ผลการประเมินการการปฏิบัติราชการ แสดงผลข้อมูลจำนวนข้าราชการไม่ตรงกัน 
3. P0406 บัญชีแนบท้ายคำสั่งปรับอัตราเงินเดือนใหม่ ดึงรายชื่อลูกจ้างประจำไม่ครบ 
4. P1119 การนำเข้าข้อมูลการปรับเงินเดือนซึ่งมีผลวันที่ 1 ธ.ค.57 เมื่อนำเข้าข้อมูลสำหรับลูกจ้างประจำแล้ว ระบบเพิ่มประวัติเงินให้ แต่ไม่ปรับปรุงเงินเดือนปัจจุบันให้เป็นไปตามไฟล์ที่นำเข้า
5. เมื่อค้นหารายชื่อบุคลากรใน K08 การประเมิน KPI รายบุคคล พบว่าไม่มีรายชื่อข้าราชการบางราย (ส่วนใหญ่เป็นคนที่บรรจุใหม่) 
6. สำนักงบประมาณได้ทำการลบข้อมูลคำสั่ง P0406 บัญชีแนบท้ายคำสั่งปรับอัตราเงินเดือนใหม่ในระบบออก และนำเข้าข้อมูลการเลื่อนเงินเดือน ณ วันที่ 1 ธันวาคม 2557 ที่เมนู P1119 นำเข้าข้อมูลการปรับบัญชีเงินเดือนใหม่ เมื่อทำการตรวจสอบข้อมูลระบบแสดงข้อมูลแถบเมนู เงิน พบปัญหาอัตราเงินเดือนไม่ปรับให้เป็นอัตราเงินเดือนที่ปรับ ณ ปัจจุบัน
7. P0119 สอบถามข้อมูล เมื่อค้นหาตามเงื่อนไขตำแหน่งปัจจุบัน > ตำแหน่งในสายงาน > วิศวกรปิโตเลียม ปรากฏว่าพบข้อมูล 6 รายการ แต่เมื่อออกรายงาน excel พบข้อมูล 5 รายการ
8. P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ > หน้าข้อมูลบุคคล ในส่วนของข้อมูลสถานภาพบุคคล ซึ่งจะแสดงในบุคลากรที่พ้นจากราชการไปแล้ว
ข้อมูลสถานภาพบุคคลควรจะแสดงข้อมูลคำสั่งสุดท้ายเช่น ลาออก/โอน
แต่ปัจจุบันระบบจะแสดงข้อมูลที่ยืนยันท้ายสุด ซึ่งถ้าคำสั่งเลื่อนเงินเดือนออกภายหลังจากคำสั่งที่ลาออกหรือโอนไปแล้ว จะทำให้คำสั่งเงินเดือนแสดงขึ้นมาแทน ทำให้ผู้ใช้งานได้รับข้อมูลที่ผิดและสับสนได้
9 R0400 ก.พ.7 อิเล็กทรอนิกส์ พบปัญหาดังนี้
- ทำใบต่อ ก.พ.7 โดยไม่ได้ใส่วันเริ่มต้นในตอนบันทึก  แต่เมื่อทำการออกรายงานพบว่าระบบใส่วันที่ให้เองอัตโนมัติ โดยดึงวันที่ออกคำสั่งของข้อมูลก่อนหน้านั้นมาใส่แทน
- เมื่อทำการออกรายงาน ก.พ.7 ทั้งฉบับ และ ก.พ.7 ทั้งฉบับ (RTF) ไม่พบข้อมูลเลย
10. P0103 ประวัติการรับเงินเดือน หนังสือแจ้งผลการเลื่อนเงินเดือนพบปัญหาดังนี้
- การพิมพ์หนังสือแจ้งผลการเลื่อนเงินเดือน จะแสดงตำแหน่งปัจจุบันของข้าราชการหรือตำแหน่ง ณ เวลานั้นๆ
- หนังสือแจ้งมีเครื่องหมายถูกหน้าข้อความว่า กรณีไม่ได้รับการเลื่อนเงินเดือน  เกิดจากสาเหตุอะไร เพราะเป็นการเลื่อนเงินเดือนปกติ
- ข้อมูลการเลื่อนเงินเดือน มีมาตั้งแต่ปี 2528  จนถึง 2558  โดยเครื่องหมายถูก จะไปแสดงหน้าข้อความว่า ได้รับการเลื่อนเงินเดือน ในข้อมูลปี 2552 เป็นต้นไป ก่อนหน้านั้นจะเป็น ไม่ได้รับการเลื่อนเงินเดือน
11. P0402 ตรวจสอบผู้สมควร/ไม่สมควรได้เลื่อนขั้นเงินเดือน จะทำการเลื่อนเงินค่าจ้างลูกจ้างประจำ รอบ 1 เม.ย. 2558 พบว่าอัตราเงินเดือนไม่อยู่ในแท่งและขั้นที่กำหนด  จำนวน 26 ราย เมื่อจะทำการแก้ไข พบว่าไม่สามารถกดปุ่มเครื่องหมายดินสอได้
12. เมื่อถ่ายโอนข้อมูลด้วยเมนู P1119 นำเข้าข้อมูลการปรับบัญชีเงินเดือนใหม่ พบว่าประเภทการเคลื่อนไหวใน P0103 ประวัติการรับเงินเดือน แสดงเป็น ประเภทปรับเงินเดือน
แต่เมื่อใช้เมนู P0406 บัญชีแนบท้ายคำสั่งปรับอัตราเงินเดือนใหม่  ประเภทความเคลื่อนไหว แสดงเป็น ปรับเงินเดือนตามกฎหมาย
13. R0400 ก.พ.7 อิเล็กทรอนิกส์ การออกรายงาน ก.พ. 7 ทั้งฉบับ มีการนำสถานภาพการดำรงตำแหน่ง และประเภทการเคลื่อนไหว มาแสดงผลด้วย ทำให้ข้อมูลซ้ำกัน 2 ครั้ง (เฉพาะของรักษาราชการแทนและรักษาราชการในตำแหน่ง)
14. R0703 รายงานการลารายบุคคล หากเป็นการเรียกดูรายงานซึ่งระบุช่วงวันที่ในแต่ละเดือน สำหรับบุคลากรที่มีรายการลาคร่อมเดือน ระบบจะไม่แสดงวันลาของรายการนั้น
15. R0495 รายชื่อข้าราชการ (โครงสร้างตามมอบหมายงาน) เงื่อนไขการออกรายงาน ประเภทบุคลากรข้าราชการ / โครงสร้างตามกฎหมาย / ทั้งส่วนราชการ / จำแนกข้อมูลตาม (ติ๊กถูกทั้งหมด) เมื่อทำการออกรายงานทั้ง PDF และ Excel ไม่พบข้อมูลเลย
16. P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน ขึ้นข้อความว่า Fatal error: Call to a member function on a non-object 
in :\appserv\dpis35\admin\ import_forms\per_salaryhis_form.php on line 117
17. P1114 นำเข้าข้อมูลสลิปเงินเดือน ตรวจสอบข้อมูลแล้วไม่มี error  กดนำเข้าฐานข้อมูล แสดงผลหน้าจอว่า นำข้อมูลเข้าเรียบร้อย 211 รายการ
แต่เมื่อตรวจสอบแล้วไม่มีข้อมูลเดือน 07/2558
18. C02 กลุ่มผู้ใช้ ในกลุ่มผู้ใช้ที่ตั้ง username เอง ในตารางด้านล่าง คอลัมน์ ชื่อ-สกุล ไม่แสดงข้อมูล
				','สำนักงาน ก.พ.','2015-07-01','2015-07-01','2016-07-01',1,0,NULL,NULL,1,1,'2015-08-29 14:40:55');
INSERT INTO DPISEMP1.PER_MESSAGE (MSG_ID,MSG_HEADER,MSG_DETAIL,MSG_SOURCE,MSG_POST_DATE,MSG_START_DATE,MSG_FINISH_DATE,USER_ID,MSG_TYPE,MSG_DOCUMENT,MSG_ORG_NAME,MSG_SHOW,UPDATE_USER,UPDATE_DATE) VALUES
	 (1,'สรุปการปรับปรุงระบบ DPIS 4.0.0.22','
รายงาน Excel ที่ A06 บัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน หัวบัญชียังใช้คำว่า เลื่อนขั้นเงินเดือน
รายงาน R0406 ประวัติ ข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ ตรงประวัติการฝึกอบรม สัมนา และ ดูงาน กับ ประวัติ การสมรส การแสดงผลของตาราง ขาด ๆ หาย ไป
เมนู P0101 รายละเอียดข้อมูลข้าราชการ / ลูกจ้างประจำ ข้อมูลตรง ต่ำกว่าสำนัก/กอง 1 ระดับ ไมแสดงข้อมูล
เมนู P0101 รายละเอียดข้อมูลข้าราชการ / ลูกจ้างประจำ ในส่วนของข้อมูลบุคคลจะไม่แสดงข้อมูล กรณีที่เป็นข้อมูลของลูกจ้างประจำ
เมนู P0101 รายละเอียดข้อมูลข้าราชการ / ลูกจ้างประจำ ในส่วนของประวัติการดำรงตำแหน่ง ให้สามารถใส่ข้อมูลของ ต่ำกว่าสำนัก / กอง 1 ระดับ และ ต่ำกว่าสำนัก / กอง 2 ระดับ ได้ทั้งแบบ คีย์เอง และแบบเลือกจาก list box
P0101 ประวัติการรับเงินเดือน ให้สามารถใส่ข้อมูล เปอร์เซ็นต์ที่เลื่อน ทศนิยม 4 ตำแหน่งได้
เมนู S0402 เมื่อทำการแก้ไขข้อมูลรายละเอียดบัญชีขอปรับปรุง/ตัดโอนตำแหน่ง เมื่อทำการเปลี่ยนแปลงข้อมูล ต่ำกว่าสำนัก/กอง 1 ระดับแล้วเลือก อนุมัติ ข้อมูลจะต้องไปแก้ไขที่เมนู S0201 ด้วย
เมนู P0101 นำปุ่ม ถือจ่าย ออกไป (ใช้แต่กรณีกรมการปกครองเท่านั้น)
','สำนักงาน ก.พ.','2010-06-01','2010-06-01','2011-06-01',1,0,NULL,'สำนักงาน ก.พ.',0,1,'2010-11-19 16:16:12'),
	 (5,'สรุปการปรับปรุงระบบ DPIS 4.0.0.36','
P0101 ประวัติการดำรงตำแหน่ง เมื่อเลือกเงื่อนไขแก้ไข แล้ว กระทรวง กรม แสดงไม่ถูกต้อง
รายงาน R0406 เพิ่มเติมประวัติรักษาราชการ/มอบหมายงาน
R0406 รายงาน ก.พ.7(Excel) เพิ่มคอลัมน์ กรม สำนัก/กอง
R0407 จำแนกข้อมูลกดเลื่อนขึ้น ลง ไม่ได้
R0604 เปลี่ยนการแสดงชื่อระดับตำแหน่งให้เป็นแบบใหม่
P0101 ข้อมูลรูปภาพ ระบบจะแจ้งเตือน Error JavaScript เมื่อคลิกเปลี่ยนรูป
R0413 ค้นหาหลักสูตร ระบบ บอกว่าพบ 1 รายการ แต่ไม่แสดงข้อมูล
R0413 เลือกเงื่อนไข ลูกจ้างประจำ และ พนักงานราชการ แล้วรายงานแสดงข้อความว่าไม่มีข้อมูล แต่ที่จริงมีข้อมูล
P0203 บัญชีแนบท้ายคำสั่งบรรจุ กรณีเพิ่มรายชื่อบุคคล ถ้าเป็นข้าราชการ ให้กรอกเงินเดือนเอง แต่ถ้าเป็นลูกจ้างให้เป็นแบบเลือกเงินเดือน
R0406 ระบุเงื่อนไขการค้นหา แล้วไม่สามารถเรียกดูรายงานได้
P0101 เปลี่ยนแปลงชื่อคอลัมน์ ถ้าเป็นข้าราชการให้แสดงคำว่าตำแหน่งในการบริหารงาน ถ้าเป็นลูกจ้างให้แสดงคำว่า กลุ่มงาน แต่ถ้าเลือกทั้งหมดให้แสดงคำว่า ตำแหน่งในการบริหารงาน / กลุ่มงาน
R0205 โครงสร้างอายุราชการ Excel ไม่แสดงข้อมูล
R0416 รายงานข้อมูลข้าราชการที่ลาศึกษาในประเทศ แยกตามสำนัก/กอง แก้ไขให้รายงานแสดงเป็นระดับตำแหน่งใหม่
R0311 รายชื่อข้าราชการที่ออกจากราชการในปีงบประมาณ ไม่แสดงข้อมูล
			','สำนักงาน ก.พ.','2011-08-01','2011-08-01','2012-08-01',1,0,NULL,NULL,1,1,'2011-08-23 10:35:45'),
	 (8,'สรุปการปรับปรุงระบบ DPIS 5','
	ปรับปรุงโครงสร้างส่วนราชการตามกฎหมายให้สามารถใช้งานได้ในระดับกระทรวง กรม สำนัก/กอง ต่ำกว่าสำนัก/กอง 1 ระดับ, 2 ระดับ, 3 ระดับ, 4 ระดับ และ 5 ระดับ ได้
	ปรับปรุงโครงสร้างส่วนราชการตามมอบหมายงานให้สามารถใช้งานได้ในระดับกระทรวง กรม สำนัก/กอง ต่ำกว่าสำนัก/กอง 1 ระดับ, 2 ระดับ, 3 ระดับ, 4 ระดับ และ 5 ระดับ ได้
	ปรับปรุงการกำหนดสิทธิ์การเข้าถึงข้อมูลให้มีระดับ ประเทศ จังหวัด กระทรวง กรม สำนัก/กอง และ ต่ำกว่าสำนัก/กอง 1 ระดับ
	มีการกำหนดสิทธิ์การเข้าถึงทั้งโครงสร้างตามกฎหมายและโครงสร้างตามมอบหมายงาน
	ปรับปรุงการปรับเปลี่ยนโครงสร้าง หากมีการปรับเปลี่ยนโครงสร้างตามกฎหมายให้ระบบมีการปรับเปลี่ยนข้อมูลตำแหน่ง และข้อมูลบุคคลภายใต้ส่วนราชการนั้น ๆ ด้วย
	ปรับปรุงรายงานต่าง ๆ ในระบบให้สอดคล้องกับระบบที่ปรับปรุงใหม่
	สามารถเก็บแฟ้มข้อมูลที่เป็นสื่ออิเล็กทรอนิกส์เข้าสู่ประวัติข้อมูลรายบุคคลได้
	ปรับปรุงระบบลูกจ้างประจำให้สอดคล้องกับ ว14/2553 ของสำนักงาน ก.พ. เรื่องการจัดระบบตำแหน่งลูกจ้างประจำของส่วนราชการ
	ปรับปรุงระบบพนักงานราชการ
	เพิ่มการจัดเก็บข้อมูลระบบลูกจ้างชั่วคราว
	ปรับปรุงระบบการค้นหาข้อมูลให้สามารถค้นหาประวัติต่าง ๆ ของ ข้าราชการ ลูกจ้างประจำ พนักงานราชการ ลูกจ้างชั่วคราว ได้ อย่างมีประสิทธิภาพ
	เพิ่มระบบการฝึกอบรมให้สามารถจัดเก็บข้อมูลตั้งแต่การตั้งโครงการฝึกอบรม ค่าใช้จ่าย ระยะเวลา ทั้งการอบรมภายในหน่วยงาน และ ภายนอกหน่วยงาน พร้อมทั้งมีระบบในการจัดประวัติการฝึกอบรมสำหรับบุคลากรที่ผ่านหรือไม่ผ่านการอบรม
	เพิ่มการปรับฐานเงินเดือน เป็นเปอร์เซ็นต์
	เพิ่มระบบการทำบัตรข้าราชการ
	เพิ่มระบบการจัดทำนามบัตร
	ปรับปรุงระบบการลา
	มีระบบการถ่ายโอนข้อมูล จากระบบ DPIS 5.0 ไปยัง ระบบข้อมูลเพื่อการวางแผนกำลังคนภาครัฐ (GPIS) ระบบสารสนเทศพนักงานราชการ (GEIS)
	มีระบบการพิมพ์ประวัติบุคคล ลงฟอร์ม
	มีระบบถ่ายโอนข้อมูลจากระบบสารสนเทศทรัพยากรบุคคลระดับกรม ไป ระบบสารสนเทศทรัพยากรบุคคลระดับจังหวัด (ข้อมูลบุคคล) 
	มีระบบถ่ายโอนข้อมูลจากระบบสารสนเทศทรัพยากรบุคคลระดับจังหวัด ไป ระบบสารสนเทศทรัพยากรบุคคลระดับกรม (การเลื่อนเงินเดือน)
	มีระบบถ่ายโอนข้อมูลจ่ายตรงเงินเดือนให้กรมบัญชีกลาง (ข้าราชการ/พนักงานราชการ)
	มีระบบการบันทึกข้อมูลจากส่วนภูมิภาค (สำหรับส่วนราชการที่มีส่วนภูมิภาค)
	มีระบบเก็บประวัติรูปบุคลากร
	มีระบบการจัดทำ Slip เงินเดือนรายบุคคล
	มีระบบตรวจสอบการต้องเปลี่ยนรหัสผ่านตามระยะเวลาที่กำหนด
	ฯลฯ
				','สำนักงาน ก.พ.','2012-01-01','2012-01-01','2013-01-01',1,0,NULL,NULL,1,1,'2012-02-27 11:55:07'),
	 (4,'สรุปการปรับปรุงระบบ DPIS 4.0.0.35','
P0406 บัญชีแนบท้ายคำสั่งปรับอัตราเงินเดือนใหม่ ไม่สามารถแก้ไขข้อมูลได้
รายงาน R0406 ประวัติเงินพิเศษ และ เงินเพิ่มพิเศษ สลับกัน
P0203 บัญชีแนบท้ายคำสั่งบรรจุ ระบบจะดึงเงินเดือนมาแสดงไม่ถูกต้อง
P0304 บัญชีแนบท้ายคำสั่งย้าย ทำคำสั่งย้ายลูกจ้างประจำ เมื่อเลือกเลขที่ตำแหน่งแล้ว จะไม่สามารถเลือกระดับได้
P0310 บัญชีแนบท้ายคำสั่งเลื่อน ทำคำสั่งเลื่อนลูกจ้างประจำ เมื่อเลือกเลขที่ตำแหน่งแล้ว จะไม่สามารถเลือกระดับได้
รายงาน R0407 ขอให้แยกคอลัมน์ ตำแหน่ง ประเภท ระดับ ออกจากกัน เป็นคนละคอลัมน์
P0101 คลิกแก้ไขลูกจ้างประจำแล้วตรงส่วนของตำแหน่งปัจจุบันกลายเป็นของข้าราชการ
R0604 บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี วันที่มีผลในประวัติเงินเดือน กับ ในตัวรายงานไม่สัมพันธ์กัน เช่น กรณี ถ้าคำนวณจาก วันที่มีผล คือ 1/10/2553 ควรจะเป็น ปีงบ 2554 ครั้งที่ 1
R0604 บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี กรณีขั้นเงินเดือนเป็น เปอร์เซ็นต์ ควรนำเปอร์เซ็นต์มาแสดง
P0101 ให้สิทธิ์แค่เพิ่ม ลบ แก้ไข แค่การลาอย่างเดียว แต่ว่าเมื่อเข้ามาที่เมนู P0101 กลับมีปุ่มให้เพิ่มรายชื่อบุคคล
P0101 เพิ่มข้อมูลลูกจ้างประจำ เมื่อคลิกเลือกตำแหน่งลูกจ้างประจำ ใส่เงื่อนไขการค้นหาจากเลขที่ตำแหน่ง เมื่อคลิกค้นหาข้อมูล ระบบแสดงข้อมูลทั้งหมดมาให้
S0201 รายงานประวัติตำแหน่ง เอาคอลัมน์สถานภาพตำแหน่งออกไป
			','สำนักงาน ก.พ.','2011-07-01','2011-07-01','2012-07-01',1,0,NULL,NULL,1,1,'2011-07-15 09:56:35'),
	 (6,'สรุปการปรับปรุงระบบ DPIS 4.0.0.37','
P0101 ข้อมูลข้าราชการ ค้นหาข้อมูลแล้วคลิกไปดูหน้าถัดไป ระบบไม่แสดงข้อมูล (Access)
P0101 ระบบไม่สามารถค้นหาด้วยเลขที่บัตรประชาชนได้
A06 บัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน เมื่อกดเพิ่มข้อมูลแล้ว รูปแบบวันที่เปลี่ยนไปเป็น yyyy-mm-dd
P0304 บัญชีแนบท้ายคำสั่งย้าย เลือกตำแหน่งที่แต่งตั้งแล้ว Alert JavaScript ว่า "level" is undefined
P0101 คลิกที่ปุ่ม รายละเอียด > รักษาราชการ / มอบหมายงาน ในส่วนของพนักงานราชการไม่สามารถเพิ่มข้อมูลได้
P0101 ไม่สามารถแก้ไขเลขที่บัตรประชาชนได้
R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส เพิ่มฟิลด์วันเข้าสู่ระดับ(ใหม่) ขึ้นมา
เมนูรายงาน เมื่อกำหนดค่าโปรแกรมให้แสดงเป็นเลขไทยแล้ว เลขหน้าของรายงานแต่ละตัวจะแสดงผิด โดยจะแสดงเป็น ๑ / 2
P0105 ประวัติการศึกษา ตอนค้นหาสถานศึกษา ข้อมูลแสดงไม่ครบถ้วน
R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด ให้ดีฟอล์ดการเลือกข้อมูลเป็น ข้าราชการ
P1108 ถ่ายโอนข้อมูลเครื่องราชย์ พนักงานราชการ ไม่แสดงข้อมูลที่ฟิลด์ POS_NAME
			','สำนักงาน ก.พ.','2011-09-01','2011-09-01','2012-09-01',1,0,NULL,NULL,1,1,'2011-09-19 10:25:50'),
	 (24,'Patch Update DPIS Release 5.2.1.14','1.เมนู K08 การประเมิน KPI รายบุคคล
-ปรับปรุงส่วนของการแสดงผลไฟล์แนบ ในบทบาทของผู้ประเมินให้สามารถมองเห็นไฟล์แนบได้
-ปรับปรุงส่วนที่ 2.2 เรื่องของสิทธิ์การบันทึกข้อมูลของผู้ประเมิน
-ปรับปรับเปลี่ยนในส่วนของพิมพ์รายงาน ในส่วนที่ 3  ความเห็นของผู้บังคับบัญชาเบื้องต้น ให้รูปแบบการแสดงคล้ายกับส่วนที่ 5 ความเห็นของผู้บังคับบัญชาเหนือขึ้นไป โดยดึงข้อความมาจาก ส่วนที่ 3 แถบ ความเห็นผู้บังคับบัญชาเบื้องต้น มาแสดง
-ปรับปรับ ส่วนที่ 3 ในกรณีที่ไปแก้ไขสัดส่วนในหน้า K13  แล้ว อยากให้คะแนนในส่วนที่ 3 มันประมวลผลคะแนนตลอด (เฉพาะในกรณีที่ยังไม่ได้กดติกให้แสดงคะแนน) 
2.เมนู S0201 ตำแหน่งข้าราชการ
-ปรับแก้ไขในหน้า P0101 เมื่อทำการแก้ไขระดับตำแหน่งในหน้า P0101 ให้ทำการอัพเดท ไปที่ระดับตำแหน่งของตารางข้อมูลตำแหน่ง
-ตรวจสอบเพิ่มเติ่ม ว่ามีช่องวันที่ตำแหน่ง นั้น ๆ ว่างลง หรือไม่ ถ้าหากมีอยากให้เปิดเพื่อให้สามารถใช้งานได้
และตรวจสอบการทำงาน ในหน้างาน  P0502  และ p0101  หาก บันทึกพ้นโดยไม่ใช้ P0502 ให้ มา update PER_POSITION POS_VACANT_DATE ด้วยครับ
3.เมนูเปลี่ยนรหัส
-แก้ไขการแสดงผลเดิมจะแสดงรหัสผ่านที่ช่องเบอร์โทรเพื่อเอาตรวจสอบกรณีที่ผู้ใช้เปลี่ยนรหัสแล้วแจ้งว่าเข้าระบบอีกครั้งไม่ได้ ตอนนี้ได้นำการ Debug ส่วนนี้ออกไปแล้ว
4.เมนูP0404 บัญชีแนบท้ายคำสั่งเลื่อนขั้นเงินเดือน (เฉพาะลูกจ้างประจำ)
-ปรับปรุงเงื่อนไขการเลื่อนขั้นเงินเดือนของบางตำแหน่งที่ยังเลื่อนไม่ถูกต้อง
5.เมนูP0119 สอบถามข้อมูล
-ปรับปรุงให้สามารถ export ได้ เดิมระบบถูก debug ไว้จึงไม่แสดงผล
6.เมนูR0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส
-ปรับปรุงวันที่เข้าสู่ระดับของตำแหน่งก่อนหน้า ให้ดึงวันแรกที่เข้าสู่ระดับนั้นๆ มาแสดง
7.เมนูR0702 รายงานการมาปฏิบัติราชการของข้าราชการ ประจำเดือน
-ปรับปรุงการแสดงจำนวนวันมาปฏิบัติราชการเดิมแสดงเป็น 22 วัน ซึ่งจริงแล้ว มีแค่ 21 วัน ได้แก้ไขวิธีการนับใหม่
8.เมนูP0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ (รายละเอียด - เงิน)
-เมื่อทำการกดพิมพ์ PDF ผลการเลื่อนเงินเดือนอันเก่า พบว่า ตำแหน่ง และสังกัด แสดงเป็นปัจจุบัน ปรับให้แสดงตำแหน่งของรอบนั้นๆ โดยการหยิบตำแหน่งและสังกัดที่ได้ทำการกรอกไว้(ข้อความ)นำไปแสดงในรายงาน
-ในส่วนของ เลขที่ตำแหน่ง ตำแหน่ง สังกัด  ทั้งด้านบนและด้านล่าง ให้แสดงเป็น ณ รอบที่ทำการดึงรายงาน
-ในส่วนของตำแหน่ง ให้นำตำแหน่ง + กับระดับ มาแสดง และถ้าในกรณีที่ตำแหน่งมีระดับอยู่ด้วยให้ระบบตัดระดับในตำแหน่งออก เช่น นักคอมพิวเตอร์ปฏิบัติ ระดับ ปฏิบัติการ  ให้ระบบแสดงแค่นักคอมพิวเตอร์ปฏิบัติการ   
-สังกัด ถ้ามีการคีย์สังกัดในช่อง ให้ดึงสังกัดในช่องไปแสดงในรายงานค่ะ
9.เมนูR0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด
-ปรับปรุงช่องการแสดงตำแหน่ง หากเลขที่ตำแหน่งที่ไม่มีตำแหน่งทางการบริหาร จะไม่ให้ไปหยิบ ตำแหน่งทางการบริหารของเลขตำแหน่ง ก่อนหน้ามาแสดง
10.เมนูR1201 บัญชีลงเวลาการปฏิบัติราชการของบุคลากร
-ปรับปรุงกรณีที่ข้าราชการมีการใช้ลงเวลา 8 ชั่วโมง เมื่อทำการแสกนนิ้วมือก่อน 8 ชั่วโมง ระบบจะลงในช่องหมายเหตุเป็น ไม่ได้ลงเวลา อยากปรับเปลี่ยน ในกรณีที่ข้าราชการใช้ 8 ชั่วโมง แล้วสแกนนิ้วก่อน 8 ชั่วโมง ให้ระบบแสดงเป็นค่าว่าง ในช่องหมายเหตุ
11.เมนูP0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ
-เพิ่มเงื่อนไข ในหน้าเมนู P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ โดยสร้างเป็นปุ่มเงื่อนไข ติก  ไม่มี , ประกาศเกษียณ
12.เมนูP0601 การลา
-เพิ่มเติมกล่องข้อความแสดง ความเห็น ใต้ตัวเลือก เห็นควรอนุญาต/ไม่เห็นควรอนุญาต ทั้งในส่วนของ ผู้บังคับบัญชาชั้นต้น, ผู้บังคับบัญชาชั้นต้นเหนือขึ้นไป, ผู้ตรวจสอบการลา  และ   ผู้อนุญาตการลา
13.เมนูP1115 นำเข้าข้อมูลการเลื่อนเงินเดือน
-ปรับเปลี่ยน/เพิ่มเติม ในกรณีถ้าไม่ได้ใส่ยอดในช่อง จำนวนที่ได้รับการเลื่อนจริง ให้ระบบนำจำนวนเงินในช่อง เงินเด่ือนหลังเลื่อน ไปแสดงในช่องอัตราเงินเดือน ในหน้า P0101  แต่ถ้าไม่ได้มีการใส่ยอดเงินในช่อง เงินเดือนหลังเลื่อน ให้ระบบนำจำนวนเงินในช่อง เงินเดือน และ จำนวนที่ได้รับการเลื่อนจริง บวกกันและนำผลลัพท์ไปแสดงที่ช่องอัตราเงินเดือน ','สำนักงาน ก.พ.','2017-11-01','2017-11-01','2017-12-30',1,0,NULL,NULL,1,1,'2018-01-08 09:27:01'),
	 (25,'Patch Update DPIS Release 5.2.1.18','P0101 ข้อมูลบุคคล
  ปรับปรุงเรื่องสิทธิ์การลบที่หน้างาน  หักภาษี ณ ที่จ่าย
  ปรับปรุงเรื่องการจัดเรียงข้อมูลหักภาษี ณ ที่จ่าย
P1118 ระบบสารสนเทศเพื่อการวางแผนกำลังคนภาครัฐ (GMIS)
  ปรับปรุงเรื่องการส่งออกรายงานของปุ่มพนักงานราชการ
C15 ผู้มีหน้าที่จ่ายเงิน
  ปรับปรุงการแสดงผลของช่องวันที่ ให้จัดรูปแบบวันที่ ในรูปแบบ รูปแบบ dd/mm/yyyy
P0101 ข้อมูลบุคคลากร->ข้อมูลการรักษาราชการแทน/รักษาการในตำแหน่ง
  ปรับปรุงเรื่องการเรียงข้อมูล
R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด	 
  ปรับปรุงรายงาน Excel ช่องเครื่องราชฯ ให้แสดงปี พ.ศ. ตามตัวเลือกการแสดงปี
P0603 ตรวจสอบการลาเกินกำหนด
   ปรับปรุงเงื่อนไขการออกรายงานโดย ต้องการให้นับจำนวนวันของการ ลาป่วยจำเป็นเข้าไปในเงื่อนไขด้วย
P1106 รับโอน ข้อมูลรายบุคคล
   เนื่องจากการนำเข้ามีจำนวนคอลัมน์ไม่เท่ากัน จึงได้ทำการแก้ไขโดยการ เพิ่ม เงื่อนไขสำหรับเช็คค่านำเข้าเฉพาะ คอลั่มที่ฝั่งกรมรับโอนมีเท่านั้น','สำนักงาน ก.พ.','2018-02-01','2018-03-01','2018-09-30',1,0,NULL,NULL,1,1,'2018-04-24 11:22:33'),
	 (19,'Patch Update DPIS Release 5.1.2.0','1 เมนู  R0702 รายงานการมาปฏิบัติราชการของข้าราชการ ประจำเดือน
   ปรับปรุงเรื่อง การแสดงผลรวมวันมาปฏิบัติราชการ ที่หัวรายงานซึ่งเดิมบางเดือนจะคำนวณเกินไป 1 วัน
2 เมนู  P0601 การลา
   ปรับปรุงเรื่อง ยอดสรุปเป็นปีงบประมาณนั้นๆ
3 เมนู  C02 กลุ่มผู้ใช้งาน
   ปรับปรุงเรื่อง จังหวะกดปุ่ม กลุ่มผู้ใช้งานที่เลือก ปรากฎว่าเดิม ระบบแสดงหน้าจอแสดงผลกลุ่มผู้ใช้งานที่เลือกขึ้นมาแล้วปิดหน้าต่างเองอัตโนมัติ
4 เมนู  P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ (รายละเอียด - เงิน พิมพ์รายงาน)
   ปรับปรุงเรื่อง รายละเอียด > เงิน เมื่อสั่งพิมพ์หนังสือแจ้งผลการเลื่อนเงินเดือน กรณีที่เป็นการแก้ไขคำสั่ง ระบบจะไปดึงเงินเดือนเดิมก่อนที่จะแก้ไขคำสั่งมาแสดง 
   จึงทำให้การแสดงผลคลาดเคลือน อยากให้ระบบ order ตามรายการประวัติเงินเดือนล่าสุด (ลงวันที่) หากวันที่มีผลเป็นวันเดียวกัน
5 เมนู  S0203 ตำแหน่งพนักงานราชการ
   ปรับปรุงเรื่อง รูปแบบการออกรายงานให้แสดงโครงสร้างตามมอบหมายงาน และปรับเงื่อนใขในการค้นหาตำแหน่งว่าง
6 เมนู  P0604 ตั้งค่าวันลาสะสม
   ปรับปรุงเรื่อง เงื่อนใขในการกำหนดค่าวันลาสะสม
7 เมนู  P0203 บัญชีแนบท้ายคำสั่งบรรจุ/แต่งตั้ง/รับโอน 
   ปรับปรุงเรื่อง การตรวจสอบเลขที่ตำแหน่งซ้ำ
8 เมนู  P0304 บัญชีแนบท้ายคำสั่งย้าย 
   ปรับปรุงเรื่อง การตรวจสอบเลขที่ตำแหน่งซ้ำ
9 เมนู P0701 ข้อมูลการสอบข้อเท็จจริง 
   ปรับปรุงเรื่อง การขยายช่องรายเอียด จากเดิม เก็บ 200 ตัวอักษา ขยายเป็น 2000 ตัวอักษร
10 ปรับปรุง ทุกบัญชีแนบท้ายคำสั่ง ให้สามารถยืนยันเลขที่คำสั่งซ่ำได้
11 เมนู P0119 สอบถามข้อมูล 
   ปรับปรุงเรื่อง เพิ่มเติมคอลัมน์เลขที่ประจำตัวข้าราชการ ในตารางส่งออกไฟล์ Excel','สำนักงาน ก.พ.','2016-09-01','2016-09-01','2017-09-30',1,0,NULL,NULL,1,1,'2016-09-15 15:44:53'),
	 (20,'Patch Update DPIS Release 5.2.1.4','11 เมนู  P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ
   -ปรับปรุง เรื่องการแสดงผล หน้างานรายละเอียดข้อมูลบุคคล ส่วนของเลขที่คำสั่งกรณีพ้นสภาพให้ระบบไปดึงวันที่จากประวัติการดำรงตำแหน่งมาแสดง
   -ปรับปรุง เรื่องการแสดงข้อความในใบสลิปเงินเดือน ส่วนของ พ.ส.ร./ตกเบิก
2 เมนู  R0406 ประวัติข้าราชการ
   -ปรับปรุง ส่วนของการแสดงตำแหน่ง ที่ประวัติการรับราชการ ให้ตรงกับหน้างาน p0101
   -ปรับปรุง ส่วนของการกดปุ่ม  ก.พ.7 (excel) ในรายงาน  excel รายการวุฒิการศึกษาได้ที่ไม่ได้บันทึกปีที่เริ่มการศึกษา จะเอา พ.ศ. ของรายการก่อนหน้าลงมาแสดงในรายงาน  ปรับให้แสดงถูกต้องเรียบร้อย
3 เมนู  P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
   -ปรับปรุง เรื่องการบันทึก การแก้ไข และแสดงผลของตำแหน่งเดิม ให้ถูกต้องตามช่องข้อมูล
4 เมนู  R0400 ก.พ. 7 อิเล็คทรอนิกส์
   -ปรับปรุง ส่วนวันครบเกษียณอายุราชการ
5 เมนู  P0125 ปรับปรุงโครงสร้างตามมอบหมายงาน
   -ปรับปรุง ส่วนของการแสดงผลจังหวะที่มีการคลิกเลือกปุ่ม โครงสร้างตามมอบหมาย และเมื่อมีการคลิกหน้าถัดไปของข้อมูลเดิมจะไม่แสดงผล จึงปรับแก้ให้แสดงผลเรียบร้อย
6 เมนู  P0304 บัญชีแนบท้ายคำสั่งย้าย
   -ปรับปรุง ส่วนของการยืนยันข้อมูล ตัวอย่าง เมื่อทดลองเพิ่มรายการบุคคล 1 คน โดยให้ย้ายไปยังเลขที่ตำแหน่งที่มีคนครอง เมื่อคลิกยืนยันคำสั่ง ระบบแจ้งว่า พบข้อมูลที่ไม่สามารถยืนยันบัญชีแนบท้ายได้ แต่ระบบขึ้นมาให้ยืนยันคำสั่งได้ ซึ่งที่ถูกต้อง ถ้าพบเลขที่ตำแหน่งที่มีคนครองอยู่แล้ว ระบบจะต้องไม่ให้ยืนยันคำสั่ง
7 เมนู P0103 ประวัติการรับเงินเดือน    
   -ปรับปรุง ส่วนของการกรอกข้อมูลวันที่ เดิมเมื่อทำการกรอกข้อมูลไปแล้วจะไม่แสดงรูปแบบวันที่ที่ถูกต้อง จึงปรับแก้ให้แสดงผลเรียบร้อย
8 เมนู  P0203 บัญชีแนบท้ายคำสั่งบรรจุ/แต่งตั้ง/รับโอน
   -ปรับปรุง กรณีที่บางกรม ต้องการให้ยืนยันคำสั่งได้ เดิมเมื่อทำการสร้างคำสั่ง และได้เพิ่มบุคคลเข้าไปแล้ว ไม่สามารถทำการยืนยันคำสั่งบรรจุได้ กรณีที่เลขที่ตำแหน่งซ้ำ จึงปรับให้ยืนยันได้เฉพาะบางกรมเท่านั้น','สำนักงาน ก.พ.','2016-12-01','2016-12-01','2017-09-30',1,0,NULL,NULL,1,1,'2017-01-31 15:05:18'),
	 (26,'Patch Update DPIS Release 5.2.1.21','1 เมนู P06 การลา/สาย > P0601 การลา
  ปรับเปลี่ยน/เพิ่มเติม ให้แสดงไฟล์แนบของรายการนั้นๆ ได้
2 เมนู K08 การประเมิน KPI รายบุคคล
  ปรับปรุงแก้ไขการแสดงผลของวันที่ในส่วนที่ 4 และ 5 กรณีที่มีการกำหนดค่าที่ C06 ว่าไม่แสดง วันที่ในส่วนของรูปแบบการประเมิน
3 เมนู C0709 บันทึกการทำงานของผู้ใช้งาน
  ปรับปรุงตัวเลือกวันที่และเงื่อนไขในการค้นหาตามช่วงวันที่ให้ทำงานได้ถูกต้อง
4 เมนู R0302 จำนวนข้าราชการที่ออกจากราชการในปีงบประมาณ
  ปรับปรุงการแสดงจำนวนผลการนับ กรณีที่มีการเลือก จำแนกข้อมูลตาม ตำแหน่งในสายงานให้แสดงออกมาทางรายงาน
5 เมนู A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน
  ปรับปรุงการดึงรายชื่อมาเพื่อการคำนวณ ไม่ให้ดึงรายการที่ซ้ำกันออกมา
6 เมนู P0119 สอบถามข้อมูล
  ปรับปรุงการแสดงผลของหัวตารางรายงานให้แสดงตรงตามข้อมูล
  ปรับเปลี่ยน/เพิ่มเติม ปุ่ม exprt file csv เพื่อรองรับข้อมูลที่มีปริมาณมาก และทำการลบไฟล์ขยะทิ้งเมื่อมีการ export เสร็จแล้ว
7 เมนู R0406 ประวัติข้าราชการ
  ปรับปรุงการแสดงผลส่วนสังกัด โครงสร้างตามมอบหมายให้แสดงผลถูกต้อง
อื่นๆ ปรับเปลี่ยน/เพิ่มเติม ตรวจสอบปรับปรุงเงื่อนไขการเลื่อนขั้นเงินเดือนของระดับอาวุโส และระดับทรงคุณวุฒิให้เป็นไปตามเงื่อนไข','สำนักงาน ก.พ.','2018-02-01','2018-06-01','2018-09-30',1,0,NULL,NULL,1,1,'2018-07-16 14:45:21');
INSERT INTO DPISEMP1.PER_MESSAGE (MSG_ID,MSG_HEADER,MSG_DETAIL,MSG_SOURCE,MSG_POST_DATE,MSG_START_DATE,MSG_FINISH_DATE,USER_ID,MSG_TYPE,MSG_DOCUMENT,MSG_ORG_NAME,MSG_SHOW,UPDATE_USER,UPDATE_DATE) VALUES
	 (16,'Patch Update DPIS Release 5.1.0.3','1.เมนู A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน	
    - ปรับปรุงให้ระบบ Default ปีงบประมาณตามที่ได้ Config ไว้ที่ เมนู C06
    - ปรับปรุงส่วนของการส่งออกเป็น ไฟล์ excel ให้ข้อมูลออกมาให้ตรงตามคอลัมน์ค่าตอบแทนพิเศษ
2.เมนู A07 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน (พนักงานราชการ)	
   - ปรับปรุงส่วนของการดึงคนตามเกณฑ์การประเมิน
3.เมนู P01 ข้อมูลบุคคล
   - ปรับปรุงกรณีคลิกปุ่มค้นหา ระบบจะแสดงปุ่มคลิกเพื่อเพิ่มข้อมูล ซึ่งไม่ถูกต้อง
4.เมนู P0130 ประวัติการรักษาราชการแทน/รักษาการในตำแหน่ง/มอบหมายงาน
   - ปรุงปรุงให้สามารถดูไฟล์แนบจาก P1501 บัญชีแนบท้ายคำสั่งรักษาราชการแทน/รักษาการในตำแหน่ง
     P1502 บัญชีแนบท้ายคำสั่งมอบหมายงาน/ปฏิบัติราชการแทน
     P1503 บัญชีแรบท้ายคำสั่งช่วยราชการ เพื่อให้ดูไฟล์แนบได้
5.เมนู R0600 รายงานการเลื่อนเงินเดือนรายบุคคล
   - ปรับให้สามารถคลิกปุ่มออกไฟล์ PDF ได้
6.เมนู  R0901 รายงานการประเมินผล KPI รายบุคคล	
   - ปรุงปรุงส่วนที่คลิกปุ่ม "ส่งออกไฟล์ Excel" คอลัมน์ ระดับการประเมินผล ไม่แสดงค่า ให้แสดงค่า
7.เมนู S0104 โครงสร้างการบังคับบัญชาตามกฏหมาย
   - ปรังปรุงเรื่องการแสดงผลของข้อมูลให้ถูกต้อง เดิมระบบจะแสดงผลผิดพลาดทำให้หน้าจะแสดงเมนูครึ่งจอ
8.เมนู K02 ตัวชี้วัด
   - ปรังปรุงระบบให้สามารถแก้ไขตัวชี้วัดได้ เดิมจะไม่สามารถแก้ไขได้หากรอกข้อความไปที่ช่อง เป้าหมาย 1-5
9.เมนู K08 การประเมิน KPI รายบุคคล
   - ปรับปรุงให้สามารถแกไข  ผู้ให้ข้อมูลประเมิน และ ผู้ประเมินคนใหม่ ได้
10.เมนู P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ	 
   - ปิด ปุ่มลบในหน้างาน P0101
11.เมนู  P0203 บัญชีแนบท้ายคำสั่งบรรจุ/แต่งตั้ง/รับโอน
   - ปรับปรุง บัญชีแนบท้ายคำสั่งบรรจุ/แต่งตั้ง/รับโอน ที่ปุ่มยืนยันไม่สามารถนำคนเข้าระบบได้ ให้สามารถนำเข้าได้
12.เมนู  P1111 นำเข้าข้อมูลเครื่องราชฯ จากสำนักเลขาธิการคณะรัฐมนตรี	
   - ปรับปรุงให้ สามารถนำเข้าข้อมูลเครื่องราษฎร์ ได้
13 เมนู  C0704 โปรแกรมปรับเปลี่ยนฐานข้อมูล
   - ปรับปรุงให้เลือกแต่ปุ่มยันยัน','สำนักงาน ก.พ.','2016-01-01','2016-01-01','2017-09-30',1,0,NULL,NULL,1,1,'2016-02-04 19:05:51'),
	 (17,'Patch Update DPIS Release 5.1.0.5','1 เมนู K08 ปรับปรุงส่วนที่ 2 ผลการปฏิบัติงาน แทบแนบไฟล์  เปิดเข้าตอนแรกจะไม่เจอปุ่ม "เลือกไฟล์" เพื่อแนบเอกสาร  ต้องเลื่อนหน้าจอหาถึงเจอ จะเกิดปัญหาในกรณีชื่อตัวชี้วัดยาวๆ ปรับให้สามารถเห็นในหน้าโดนไม่ต้องเลื่อนหน้าจอ
2 เมนู P0101 ปรับปรุง
   -เรื่องการบันทึกค่ารูปถ่าย/ลายเซ็น ให้สามารถใช้งานได้สะดวกขึ้น
   -กรณีที่เป็น IE8 ให้แจ้งเตือนว่า ไม่รองรับ เนื่องจาก ในระบบมีการเรียกใช้ modal popup
   -เพิ่ม วัน/เดือน ในข้อมูลการศึกษา
   -เพิ่มการแสดงต่ำกว่าสำนักกองไว้ที่หน้าค้นหา ส่วนที่เป็นเงื่อนไข
3 เมนู P0119  ปรับปรุง
   -เพิ่มช่อง "ปีที่รับเครื่องราชฯ", เพศ,ประเทศที่สำเร็จการศึกษา, ปี พ.ศ. ที่สำเร็จการศึกษา, ประเภททุนการศึกษา  ย่อย ทุนส่วนตัว , ทุนรัฐบาล (ระบุ) , ชนิดของทุน อื่นๆ (ระบุ) , ระดับ, สาขาความเชี่ยวชาญปัจจุบัน   ในรายงาน excle
4 เมนู P0125  ปรับปรุง เรื่องการแสดงผลจากการค้นหาเนื่องจากเมื่อมีข้อมูลปริมาณมากจะทำให้ระบบแสดงผลไม่ถูกต้อง ซึ่งแต่เดิมระบบเมื่อ error จะแสดงข้อมูลไม่สมบูรณ์จะทำให้ไม่สามารถคลิกหน้าต่อไปได้
5 เมนู P0131 ปรับปรุงเรื่องการแสดงผลของภาพถ่าย/ลายเซนให้ถูกต้อง
6 เมนู P0203 ปรับปรุงช่องตำแหน่ง/สังกัด  ==>  ให้แสดงตำแหน่ง ไม่ต้องแสดง ระดับ  เพราะมีช่อง ระดับ มีอยู่แล้ว 
7 เมนู P0601 ปรับปรุง
   -การแสดงผลวันลา  เมื่อทำการ Export ไฟล์ Word แล้ว ปรากฎว่า วันที่ลาล่าสุด เดือนแสดงเป็นแบบเต็ม แต่วันลาที่เป็นครั้งสุดท้าย เดือนเป็นแบบย่อ อยากให้ระบบแสดงแบบเต็มทั้งหมด
   -การแสดงผลแสดงค่าขึ้นมาว่าเป็น 0.5  อยากให้เพิ่มเติมลงท้ายในวงเล็บว่า เป็น 0.5 (ครึ่งวันเช้า)/(ครึ่งวันบ่าย)    
8 เมนู P1114 ปรับปรุงจังหวะการนำเข้าและเลือกลบข้อมุลเดิม ให้ระบบทำการลบข้อมูลที่ซ้ำออกไปก่อน เดิมระบบจะไม่ได้ทำการลบจึงทำให้เกิดรายการซ้ำ
9 เมนู P1502 เพิ่มช่อง ถึงวันที่ ในบัญชีรายละเอียดการมอบหมายให้ปฏิบัติราชการ แนบท้ายคำสั่งกรม
10 เมนู R0402 ปรับปรุงการแสดงผลข้อมูล ให้แสดงหน่วยงาน และ แก้ไข ช่องตำแหน่ง/ระดับตำแหน่ง  มีการแสดงส่วนที่ต่อท้ายตำแหน่งผิด โดยการตัดส่วนต่อท้ายออก
11 ทางเจ้าหน้าที่ได้ทำการตั้งค่า ที่เมนู C06 ตั้งค่าที่ช่อง ต่ำกว่าสำนัก/กอง เป็น ต่ำกว่า 3 ระดับ เมื่อตั้งค่าเสร็จแล้ว ไปเปิดที่หน้าเมนู P0101 ปรากฎว่าระบบโชว์แค่ ต่ำกว่าระดับสำนัก/กอง 2 ระดับ  และได้ปรับปรุงตามเมนูดังนี้ S0201 , S0202 , S0203 , S0204','สำนักงาน ก.พ.','2016-03-01','2016-03-01','2017-09-30',1,0,NULL,NULL,1,1,'2016-03-14 17:22:30'),
	 (18,'Patch Update DPIS Release 5.1.0.7','1. K07 มาตรฐานสมรรถนะของผู้ดำรงตำแหน่ง
    -ปรับปรุง เรื่องการแสดงผลสมรรถนะไม่ตรงกับที่เราบันทึก เช่นในรายละเอียดกำหนดสมรรถนะบริหารจำนวนสามรายการ แต่สมรรถแสดงไม่ตรงกัน
2. K08 การประเมิน KPI รายบุคคล
    -ปรับปรุง เรื่องการเห็นคะแนนของผู้บังคับบัญชาเหนือขึ้นไป และผู้บังคับบัญชาเหนือขึ้นไปอีกชั้นหนึ่ง ในส่วนที่ 2 และส่วนที่ 3
3. M0310 ชื่อตำแหน่งพนักงานราชการ
    -ปรับปรุง เรื่องการคีย์ชื่อตำแหน่งซ้ำได้หากอยู่กันคนละกลุ่มงาน
4. M1103 ระดับผลการประเมินหลัก
    -ปรับปรุง เรื่องการแสดงค่าแค่ตามรอบประเมินที่ได้ตั้งค่าไว้เมนูที่ C06 กำหนดค่าโปรแกรม
5. P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ
    -ปรับปรุง เรื่องการแสดงผลของวันเข้าระดับปัจจุบัน
    -ปรับปรุง เรื่องการแสดงรูปที่ข้อมูลบุคคล
    -ปรับปรุง เรื่องการบันทึกข้อมูลทั่วไป
6.  P0310 บัญชีแนบท้ายคำสั่งเลื่อน
    -ปรับปรุง เรื่องการแก้ไขรายการเงินเดือนลูกจ้างประจำ
7. P0404 บัญชีแนบท้ายคำสั่งเลื่อนขั้นเงินเดือน
    -ปรับปรุง เรื่องการแสดงคอลัมน์ที่สลับกัน
    -ปรับปรุง เรื่องการทำงานของปุ่มเพิ่มกรณีเหลือแบบทั้งหมด เพื่อให้ดึงรายการมาให้ถูกต้อง เดิมจะดึงรายการมาไม่ทั้งหมด
8. P0502 บัญชีแนบท้ายคำสั่งออกจากส่วนราชการ
    -ปรับปรุง ให้ระบบลบรายชื่อผู้ใช้งานระบบออก กรณีบุคลากรนั้นๆ ออกจากราชการ เพื่อไม่ให้เข้าระบบได้ในภายหลัง
9. P0601 การลา
    -ปรับปรุง เรื่องการแก้ไขใบลา เชคเรื่องการลาซ้ำในวันที่มีการลาไปแล้ว เดิมระบบเชคให้แต่จังหวะสร้างใบลาเท่านั้น
10. P0603 ตรวจสอบการลาเกินกำหนด
    -ปรับปรุง เรื่องการค้นหาข้อมูลให้ถูกต้องตามเงื่อนไข และเพิ่ม ช่องเงื่อนไขการมาสายให้ที่หน้าค้นหา
11. P1503 บัญชีแนบท้ายคำสั่งช่วยราชการ
    -ปรับปรุง เรื่องการยืนยันคำส่ังให้ระบบบันทึกตำแหน่งของแต่ละประเภทบุคคลให้ถูกต้อง
12. R0105 จำนวนตำแหน่งจำแนกตามระดับตำแหน่ง
    -ปรับปรุง เรื่องการแสดงผลประเภทบุคลากรเป็น พนักงานราชการ','สำนักงาน ก.พ.','2016-05-01','2016-05-01','2017-09-30',1,0,NULL,NULL,1,1,'2016-06-01 19:00:11'),
	 (21,'Patch Update DPIS Release 5.2.1.6','1 เมนู  P0308 สอบถามข้าราชการที่มีคุณสมบัติได้เลื่อนตำแหน่ง
   -ปรับปรุง ส่วนทำการใส่เลขไปแล้ว ระบบก็ไม่แสดงหน้าถัดไป ให้สามารถทำงานได้
2 เมนู P0601 การลา 
   -ปรับปรุง เพิ่มเติ่มการแสดงผลในใบลา จังหวะพิมพ์ให้แสดงผลตาม เงื่อนไข -ไม่มี ,-รักษาราชการแทน,-รักษาการในตำแหน่ง,-ปฏิบัติราชการแทน
   -ปรับปรุง ส่วนของผู้ตรวจสอบการลาทำใบลาตัวเองให้สามารถเลือกตัวเองเป็นผู้ตรวจสอบได้
   -ปรับปรุง ส่วนการแสดงผลจำนวน จุดทศนิยม จาก .5 ให้แสดงเป็น 0.5
3 เมนู P1112 ระบบสารสนเทศพนักงานราชการ (GEIS)
   -ปรับปรุง ทำการส่งออกรายงานที่ ปุ่ม ส่งออกไฟล์ Excel แบ่งส่วน , ส่งออกไฟล์ Excel , Srock ในกรณีที่มีตำแหน่งว่าง ระบบจะไม่แสดงกลุ่มงาน มาแสดงในรายงาน ปรับให้ระบบทำการดึงกลุ่มงาน จากหน้าเมนู S0203 ในกรณีที่เป็นตำแหน่งว่าง 
4 เมนู  P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ
   -ปรับปรุง ส่วนรายละเอียด - คะแนนผลการประเมิน ในกรณีที่ผู้ประเมินยังไม่ได้ทำการติกอนุญาติให้เห็นคะแนน ระบบดึงคะแนนของรอบเก่ามาแสดงแทน ปรับให้ในกรณีที่ผู้ประเมินยังไม่ได้ติกให้อนุญาตเห็นคะแนน ระบบจะยังไม่แสดงตารางการประเมินรอบดังกล่าว จะแสดงก็ต่อเมื่อผู้ประเมินทำการติกอนุญาตให้เห็นคะแนนแล้วเท่านั้น
   -ปรับปรุง P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ (รายละเอียด - ตำแหน่ง) ในกรณีที่แอดมินทำการกดปุ่ม คลิกเพิ่มข้อมูล เพื่อเพิ่มประวัติการดำรงตำแหน่งของข้าราชการย้อนหลัง ซึ่งเป็นหน่วยงานเดิมก่อนย้าย ในส่วนของโครงสร้างตามมอบหมาย ช่อง กรม ถูกฟิกไว้เป็นกรมปัจจุบัน จึงทำให้เพิ่มประวัติการดำรงตำแหน่งไม่ได้ อยากให้เพิ่ม ปุ่มเลือก และ แปรง เพื่อให้สามารถเลือกกรมได้
5 เมนู  P0118  สรุปวันลาสะสม 
   -ปรับปรุง ส่วนการแสดงผลจำนวน จุดทศนิยม จาก .5 ให้แสดงเป็น 0.5
6 เมนู   S02 ตำแหน่ง
   -ปรับปรุง ปุ่มแสดงทั้งหมด ให้ทำการแสดงข้อมูลทั้งหมดโดยไม่ระบุเงื่อนไขใด
7 เมนู    P0203 บัญชีแนบท้ายคำสั่งบรรจุ/แต่งตั้ง/รับโอน  
   -ปรับปรุง ส่วนของการแสดงรายการ PDF จากเดิมมีเส้นบรรทัดเกินมา
8 เมนู R0310 รายชื่อข้าราชการที่บรรจุในปีงบประมาณ
   -ปรับปรุง เงื่อนไขการแสดงรายชื่อเนื่องจากเดิม จะแสดงไม่เท่ากัน R0301 จำนวนข้าราชการที่บรรจุในปีงบประมาณ
9 เมนู  P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
   -ปรับปรุง การแสดงผลตำแหน่งทางการบริหาร จังหวะส่งออกไฟล์ excel ให้เหมือนกับหน้าจอแสดงผล
10 เมนู  T0303 ตรวจสอบข้อมูลจากเครื่องบันทึกเวลา
   -ปรับปรุง โปรแกรมประมวลผลเฉพาะบุคลากรที่มีสถานะ [ปกติ] เท่านั้น จึงได้ปรับแก้ให้โปรแกรมประมวลผลข้อมูลทั้งบุคลากรสถานะ [ปกติ]และ [รอบรรจุ] ทั้งส่วนของงาน เมนู T0303 ตรวจสอบข้อมูลจากเครื่องบันทึกเวลา หน้าจอ Preview และเมนู T0205 ประมวลผลข้อมูลการลงเวลา
11 เมนู  P1106 รับโอน ข้อมูลรายบุคคล
   -ปรับปรุง การรับโอน ปรับให้สามารถนำเข้าข้อมูลเบื้องต้นก่อน ซึ่งข้อมูลประวัติบางส่วนที่ติด foreign key อาจจะไม่สมบูรณ์
12.เมนู  R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด
   -ปรับปรุง เพิ่มข้อความในช่องเงื่อนไขการออกรายงาน จากเดิมคือ ข้อมูลบุคลากรเพื่อใช้ในการสำรวจ ITA เป็น ข้อมูลบุคลากรเพื่อใช้ในการสำรวจ ITA ที่มีอายุราชการไม่น้อยกว่า 1 ปี นับถึงวันที่...และมีกล่องเลือกวันที่','สำนักงาน ก.พ.','2017-01-01','2017-01-01','2017-09-30',1,0,NULL,NULL,1,1,'2017-05-25 08:38:32'),
	 (22,'Patch Update DPIS Release 5.2.1.9','1 เมนู C15 ผู้มีหน้าที่จ่ายเงิน
   -ปรับปรุงเงื่อนไขในการลงลายเซ็นในหน้างานสลิปเงินเดือน
2 เมนู  เปลี่ยนรหัสผ่าน
   -ปรับปรุงโครงสร้างผู้ใช้งานเพื่อให้จัดเก็บข้อมูลการติดต่อได้มากขึ้น
3 เมนู P0304 บัญชีแนบท้ายคำสั่งย้าย
   -ปรับปรุงเรื่องการบันทึกข้อมูลโครงสร้างตามมอบหมายและระดับตำแหน่ง
4 เมนู P0310 บัญชีแนบท้ายคำสั่งเลื่อน
   -ปรับปรุงเรื่องการบันทึกข้อมูลโครงสร้างตามมอบหมายและระดับตำแหน่ง
5 เมนู P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ
   -ปรับปรุงส่วนของการแจ้งเตือนเลขบัตรประจำตัวประชาชนซ้ำ
   -ปรับปรุงส่วนของการแจ้งเตือนกรอกวันที่ไม่ถูกรูปแบบเดิมจะไม่สามารถดำเนินการต่อได้หากกรอกรูปแบบผิด
6 เมนู P0601 การลา
  -ปรับปรุงรูปแบบฟอร์มการลาส่วน *เงื่อนไขของผู้อนุญาตการลา
7 เมนู P1114 นำเข้าข้อมูลสลิปเงินเดือน 
  -ปรับปรุงเงื่อนไขการนำเข้าข้อมูลให้สามารถนำเข้าได้ทุกกรณีเช่น รายการประวัติที่ยกเลิกไปแล้วและรายการข้อมูลหลักที่เลขบัตรซ้ำกัน
8 เมนู P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
  -ปรับปรุงกรณีออกรูปแบบรายงานปุ่ม ส่งออกไฟล์ Excel และ ส่งออกไฟล์ Excel (รายละเอียด) อยากให้ตัดตัวย่อของวุฒิการศึกษาออก ในคอลัมน์ วุฒ/สาขา 
  -ปรับปรุงต้องการปรับข้อมูลในปุ่ม ส่งออกไฟล์ Excel (รายละเอียด) ให้แสดงข้อมูลเหมือนของในปุ่ม ส่งออกไฟล์ Excel 
9 เมนู P1108 ระบบเครื่องราชฯ ของสำนักเลขาธิการคณะรัฐมนตรี
  -ปรับปรุงเพิ่มปุ่มออกรายงาน ชื่อ ตรวจสอบการรับ/คืน เครื่องราชอิสริยาภรณ์ 
10 เมนู R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด
   -ปรับปรุงส่วนของการพิมพ์ภาพถ่าย กรณีที่ข้อมูลรายการนั้นๆ ไม่มีภาพถ่าย(จะทำให้การแสดงผลไม่ตรงช่องคอลัมน์)
   -ปรับปรุงการแสดงผลชื่อผู้สมรส จะไม่แสดงหากรายการข้อมูลนั้นเป็นอย่า
11 เมนู R0301 จำนวนข้าราชการที่บรรจุในปีงบประมาณ
   -ปรับปรุงเงือนไขการแสดงรายงานตามตำแหน่งในสายงานให้แสดงผล
12 เมนู R0406 ประวัติข้าราชการ
   -ปรับปรุงการแสดงผลรายงาน PDF คอลัมน์ตำแหน่งโดยการตัด ระดับออก
   -ปรับปรุงการแสดงผลประวัติการเลื่อนขั้นเงินเดือน? และประวัติการรับเงินเพิ่มพิเศษ
   -ปรับปรุงการแสดงผลข้อมูลของพนักงานราชการ
   -ปรับปรุงการแสดงผลชื่อผู้สมรส จะไม่แสดงหากรายการข้อมูลนั้นเป็นอย่า
13 เมนู R0902 รายงานแผนพัฒนาผลการปฏิบัติงานรายบุคคล
  -ปรับปรุงรูปแบบการแสดงผลจุดทศนิยม
14 เมนู A03 ผลการประเมินการปฏิบัติราชการ
   -เพิ่มข้อความแจ้งเตื่อนว่า การแก้ไขรวมทั้งการลบข้อมูลที่เมนูนี้จะส่งผลกระทบกับบัญชีใน K08 การประเมินผล KPI รายบุคคล ด้วย (ใส่เป็นตัวอักษรสีแดง) 
15 เมนู A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
  -ปรับปรุงรูปแบรายงาน
16 เมนู A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน
  -ปรับปรุงรูปแบรายงาน','สำนักงาน ก.พ.','2017-06-01','2017-06-01','2017-09-30',1,0,NULL,NULL,1,1,'2017-06-21 09:34:57'),
	 (23,'Patch Update DPIS Release 5.2.1.10','1 เมนู P1111 นำเข้าข้อมูลเครื่องราชฯ จากสำนักเลขาธิการคณะรัฐมนตรี
   -ปรับปรุงเรื่องการนำเข้า เดิมชื่อตำแหน่ง ชื่อหน่วยงานจะไม่เข้าระบบไปด้วย ปรับให้เก็บข้อมูลส่วนนี้ด้วย
2 เมนู P0108 ความเชี่ยวชาญพิเศษ
   -ปรับปรุงส่วนของการแสดงผลหน้าถัดไปซึ่งเดิมทำงานผิดพลาดส่งผลให้ไม่แสดงข้อมูล
3 เมนู P0310 บัญชีแนบท้ายคำสั่งเลื่อนตำแหน่ง
   -ปรับปรุงส่วนของการเลือกระดับตำแหน่งให้ระบบทำการดึงค่าเงินที่อยู่ในช่วงระดับนั้นๆมาเป็นค่าตั้งต้นในการตรวจสอบยอดเงินต่อไป
4 เมนู R0406 ประวัติข้าราชการ
   -ปรับปรุงจังหวะเลือกหน่วยงานเดิมไม่สามารถคลิกเพื่อเลือกหน่วยงานได้
5 เมนู K08 การประเมิน KPI รายบุคคล
   -ปรับปรุงเพิ่มช่องการยอมรับ/ไม่ยอมรับผลคะแนน
   -ปรับปรุงค่าconfig เกี่ยวกับการแสดงช่องยอมรับ/ไม่ยอมรับ
   -ปรับปรุงสิทธิในการแก้ไขข้อมูลที่ส่วน 2.1 หากมีการคลิก ยอมรับ/ไม่ยอมรับ แล้วระบบจะไม่ให้แก้ไขข้อมูลส่วนนี้
6 เมนู P0101 ข้อมูลข้าราชการ/ลูกจ้างประจำ/พนักงานราชการ (รายละเอียด - สลิปเงินเดือน)
   -ปรับปรุงเรื่องการแสดงลายเซ็นตามช่วงที่กำหนดไว้
7 เมนู P0601 การลา
   -ปรับปรุงเรื่องการแสดงยอดวันลาที่ผ่านมาแล้วในช่วงปีงบนั้น
8 เมนู R0402 รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณ
   -ปรับปรุงฟังก์ชันการคำนวณอายุ
9 เมนู M0301 ชื่อตำแหน่งในสายงาน
   -เพิ่มเงื่อนไขในการค้นหาให้สามารถค้น สายงานที่กำหนดไว้ในมาตรฐานกำหนดตำแหน่งให้ได้รับเงินเดือนขั้นสูง (อาวุโส / ทรงคุณวุฒิ) ได้
10 เมนู A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
   -ปรับปรุงรูปแบบรายงานให้แสดงผลการประเมิน
11 เมนู A06 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน
   -ปรับปรุงในปุ่มส่งออกรายงาน Excel ต้องการให้ทำตัวหนาในส่วนของสำนัก/กอง ช่อง ตำแหน่ง/สังกัด 
12 เมนู R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส
   -ปรับปรุงส่วนของการส่งออกข้อมูลโดยเรียงลำดับภายในสำนัก/กอง เดียวกัน','สำนักงาน ก.พ.','2017-06-01','2017-06-01','2017-09-30',1,0,NULL,NULL,1,1,'2017-07-21 09:22:50'),
	 (29,'Patch Update DPIS Release 5.2.1.29','แก้ปัญหาเรื่อง
1.เมนู P0304 บัญชีแนบท้ายคำสั่งย้าย
  -ปรับปรุงการยืนยันข้อมูลของลูกจ้างชั่วคราว ให้ระบบไปอัพเดทหน่วยงานและเลขที่ตำแหน่งที่รายการข้อมูลบุคคล
2.เมนู P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน
  -ปรับปรุงเรื่องการหาหน่วยงานให้อัตโนมัตให้นำไปใส่ในประวัติเงินเดือน
3.เมนู A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
  -ปรับปรุงการเลือกตัวเลือกหน่วยงานตามมอบหมาย
4.เมนู C02 กลุ่มผู้ใช้งาน
  -ปรับปรุงการตรวจสอบการสร้างชื่อผู้ใช้และรหัสซ้ำกันให้ระบบมีการแจ้งเตือน เดิมบางกลุ่มจะไม่สามารถเพิ่มหรือลบข้อมูลได้ จึงได้ทำการตรวจสอบเพิ่มเดิมเพื่อให้ระบบสามารถเพิ่มและแก้ไขได้
5.เมนู P0101 ข้อมูลบุคคล
  -ปรับปรุงเงือนไขในการค้นหาให้ตรงกับเงือนไขบนหน้าจอที่เลือก
6.เมนู R0400 ก.พ.7 อิเล็คทรอนิกส์
  -ปรับปรุงการแสดงผลส่วนของประวัติการตำแหน่งและประวัติเงิน โดยทำการดึงข้อมูลจากช่องตำแหน่งตาม กพ7 และหน่วยงานตาม กพ7 มาแสดง
7.เมนู K08 การประเมิน KPI รายบุคคล
  -ปรับปรุงรายงานเรื่องการแสดงลายเซ็นในส่วนที่ 5 ให้แสดงเมื่อมีการแสดงความเห็นแล้ว
8.เมนู P0119 สอบถามข้อมูล
  -ปรับปรุงเงือนไขการแสดง วันเกษียน กรณีคนที่เกษียนหรือพ้นจากส่วนราชการแล้ว
=====================================
ปรับเปลี่ยนเพิ่มเติ่ม
1.เมนู C02 กลุ่มผู้ใช้งาน ส่วนรายชื่อผู้ใช้งาน
  -เพิ่มสัญลักษณ์เพื่อแสดงว่ารายการนั้นๆ ชื่อและรหัสผ่านเหมือนกัน
2.เมนู C0709 บันทึกการทำงานของผู้ใช้งาน
  -เพิ่มเงื่อนไขในการสอบถาม เช่นตามชื่อกลุ่ม และ ช่วงเวลา
3.เมนู P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน
  -เพิ่มช่องเงินค่าครองชีพชั่วคราว สำหรับพนักงานราชการ กรณีที่รายการนั้นๆมีค่าเงินนี้ ระบบจะนำไปจัดเก็บที่ข้อมูลเงินพิเศษ
4.เมนู C0706 SQL Command
  -เพิ่มปุ่มส่งออกข้อมูลในรูปแบบ CSV
5.เมนู P0101 ข้อมูลบุคคล
  -เพิ่มการแสดงข้อมูลที่คอลัมน์หน่วยงาน ให้แสดงหน่วยงานในระดับลึกลงไป ตามค่า config ที่หน้า C06','สำนักงาน ก.พ.','2019-02-01','2019-02-01','2019-02-28',1,0,NULL,NULL,1,1,'2019-03-15 09:48:12'),
	 (27,'Patch Update DPIS Release 5.2.1.26','เมนู K08 การประเมิน KPI รายบุคคล
  -ปรับปรุงจังหวะตัวเลือกตำแหน่งทางการบริหารและระดับตำแหน่งทางการบริหารให้หยิบข้อมูลที่ถกต้องจาก ตำแหน่งปัจจุบันของท่านที่ถูกเลือกว่ามีหรือไม่มีตำแหน่งทางการบริหาร
  -ปรับปรุงส่วนที่ 3 ให้สามารถคำนวณคะแนนให้อัตโนมัติเมื่อมีการแก้ไขสัดส่วนที่ K13
  -ปรับปรุงจังหวะผู้ประเมินคลิกอนุญาตให้เห็นคะแนน ให้ทำงานได้ถูกต้อง
เมนู R0901 รายงานการประเมินผล KPI รายบุคคล
  -ปรับปรุงส่วนของการแสดงผลรายงาน excel ให้แสดงโครงสร้างตามมอบหมาย
เมนู P0119 สอบถามข้อมูล
  -ปรับปรุงส่วนของตัวเลือกด้านความเชี่ยวชาญพิเศษที่พบว่าข้อมูลเป็น // ให้แสดงผลถูกต้อง
เมนู P0604 ตั้งค่าวันลาพักผ่อนสะสม
  -ปรับปรุงเงื่อนไขการคำนวณกรณีที่คลิกปุ่ม เฉพาะคนที่ยังไม่มีข้อมูล ให้ทำการคำนวณวันลาพักผ่อนสะสมให้
เมนู P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
  -ปรับปรุงส่วยของการแสดงผลรายงาน excel ให้แสดงชื่อตำแหน่ง กรณีที่เป็นพนังานราชการ
เมนู P0601 การลา
  -ปรับปรุงการแสดงปีผลปีงบประมาณตามจริง
เมนู P0102 ประวัติการดำรงตำแหน่ง
  -ปรับปรุงการแสดงผลโดยการเพิ่มคอลัมน์ที่เป็นชื่อตําแหน่งใน การบริหารงาน และ หน่วยงานย่อยที่ต่ํากว่าสานัก/กอง 1 ระดับ
=====================================
ปรับเพิ่มเติ่ม
เมนู P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน
  -ปรับเพิ่มในส่วนของสำนัก/กอง ตามกฏหมาย โดยเมื่อทำการนำเข้าไฟล์ Excel การเลื่อนเงินเดือน ให้นำค่า สำนัก/กอง ตามกฏหมายไปบันทึก
เมนู R0417 บัญชีรายชื่อข้าราชการระดับ สายงาน สังกัด เรียงตามอาวุโส
  -ปรับเพิ่มให้รายงานนำวันทีเเรกเข้าสู่ระดับ มาเเสดง
เมนู R0406 ประวัติข้าราชการ
  -ปรับเพิ่มให้ข้อมูล เกียรตินิยม และ ในส่วนของประเภททุนการศึกษา เเสดงในส่วนของการออกรายงาน Excel ประวัติข้าราชการ
เมนู P1108 ระบบเครื่องราชฯ ของสำนักเลขาธิการคณะรัฐมนตรี
  -ปรับเพิ่ม ปรับเปลี่ยนเงื่อนไขในการแสดงข้อมูลในรายงาน ข้อมูลปัจจุบัน ที่คอลัมน์ BEG_C , CC , BEG_C_DATE , BEG_BEF_C_DATEเดิม อ้างอิงข้อมูลจากคอลัมน์ ระดับของตำแหน่ง ปรับเปลียนใหม่ อ้างอิงข้อมูลจากคอลัมน์ ระดับของผู้ดำรงตำแหน่ง
เมนู A07 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน (พนักงานราชการ)
  -ปรับเงื่อนไข พนักงานราชการต้องปฏิบัติงานให้ครบ 8 เดือน จึงจะมีสิทธิเลื่อนค่าตอบแทนประจำปี
  -ปรับเงื่อนไข ออกรายงาน excel  ให้ทำการตัด ในส่วนของคอลัมน์ สีแดงออก และ ในส่วนคอลัมน์สีเหลืองให้ตัดเครื่องหมายดอกจันทร์ออก (*) ตามภาพประกอบ 
เมนู K08 การประเมิน KPI รายบุคคล
  -ปรับเพิ่ม แสดง ตำแหน่งในสายงาน ตำแหน่งทางการบริหาร และระดับตำแหน่งจากแฟ้มการประเมิน
  -ปรังเงื่อนขจังหวะการคัดลอกแฟ้มให้ค่า  คอลัมน์ ผลการพิจารณาการเลื่อนเงินเดือนเป็น Y
เมนู P0601 การลา
  -ปรับเพิ่มในส่วนของการกดเข้าเมนูการลา ให้ทำการคำนวณวันลาพักผ่อนสะสมให้อัตโนมัติ
  -ปรับรูปแบบรายงานให้กระชับโดยการจัดบรรทัดให้มีช่องไฟพอดี
เมนู R0905 รายงานตัวชิ้วัดรายบุคคล
  -ปรับเพิ่มเปลี่ยนรูปแบบรายงานให้แสดงค่าเฉลี่ย','สำนักงาน ก.พ.','2018-11-01','2018-11-01','2018-11-31',1,0,NULL,NULL,1,1,'2018-11-21 10:04:56'),
	 (30,'Patch Update DPIS Release 5.2.1.30','แก้ปัญหาเรื่อง
1.เมนู P0101 ข้อมูลบุคล
 ปรับปรุงส่วนของการแสดงผลชื่อหน่วยงานในตารางจังหวะค้นหา เดิมชื่อหน่วยงานจะออกมาซ้ำและติดกัน
2.เมนู K08 การประเมิน KPI รายบุคคล
 ปรับปรุงส่วนของการออกรายงาน pdf เดิมข้อความที่มีปริมาณมากจะไม่ตัดขึ้นหน้าใหม่ 
3.เมนู R0206 จำนวนข้าราชการจำแนกตามวุฒิการศึกษา
 ปรับปรุงส่วนของการออกรายงาน pdf เดิมแสดงผลจำแนกข้อมูลตาม กระทรวง กรม และเพศ ไม่ถูกต้อง
4.เมนู P0601 การลา
 ปรับปรุงส่วนของการคำนวณวันลาให้ถูกต้อง
5.เมนู A03 ผลการประเมินการปฏิบัติราชการ
 ปรับปรุงส่วนของเงื่อนไขในการสืบค้น
6.เมนู C02 กลุ่มผู้ใช้งาน
 ปรับปรุงการประกาศตัวแปรของ php ให้รองรับ php version ต่ำกว่า 5 เนื่องนี้หน้านี้มีการเพิ่มเติมส่วนของการตรวจสอบชื่อและรหัสผ่านที่เหมือนกันให้แจ้งเตือน
=====================================
ปรับเปลี่ยนเพิ่มเติ่ม
1.เมนู R0604 บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี
 เพิ่มช่องเลือกหน่วยงานเพื่อเป็นเงื่อนไขในการออกรายงาน
2.เมนู P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน
 -เพิ่มส่วนของการนำเข้าไฟล์ excel ให้สามารถเพิ่มช่องหน่วยงานสังกัด ลงไปในไฟล์ excel เพื่อนำเข้าไปในประวัติการเลื่อนเงินเดือน
 -แก้ไข Wording จากเดิมใช้คำว่า "ร้อยละของการประเมิน" เป็น "คะแนนการประเมิน" 
3.เมนู K08 การประเมินผลการปฏิบัติราชการ
 เพิ่มการให้เเสดงลายเซ็นในรายงานสรุปผลการประเมิน ที่หัวข้อแบบสรุปการประเมินสมรรถนะ และ แบบสรุปการประเมินผลสัมฤทธิ์ของงาน 
4.เมนู P0119 สอบถามข้อมูล
 เพิ่มสถานภาพของร่างกาย เช่น พิการ แขน ขา ฯลฯ เป็นเงื่อนไขในการสืบค้น
5.เมนู P0103 ประวัติการรับเงินเดือน
 แก้ไข Wording จากเดิมใช้คำว่า "ผลการประเมิน" เป็น "คะแนนการประเมิน" 
6.เมนู S0201 ตำแหน่งข้าราชการ
 ปรับปรุงเงื่อนไขการค้นหาตำแหน่ง ให้สามารถระบุสังกัด (ส่วนกลาง ส่วนกลางในภูมิภาค ส่วนภูมิภาค) ได้มากกว่า 1 ตัวเลือก','สำนักงาน ก.พ.','2019-03-01','2019-03-01','2019-03-31',1,0,NULL,NULL,1,1,'2019-04-03 09:57:38'),
	 (28,'Patch Update DPIS Release 5.2.1.28','แก้ปัญหาเรื่อง
1.เมนู R0505 ประวัติสำหรับเสนอขอพระราชทานเหรียญจักรพรรดิมาลา
  -ปรับปรุงเงื่อนไขในการดึงข้อมูลที่เกิดจากข้อจำกัดของฐานข้อมูลที่ไม่สามารถดึงเกิน 1,000 รหัสได้
2.เมนู K08 การประเมิน KPI รายบุคคล
  -ปรับปรุงการหาตำแหน่งในสายงานส่วนที่เป็นพนักงานราชการ
3.เมนู P0601 การลา
  -ปรับปรุงตรวจสอบการลาซ้ำในวันเดิมที่ลาไปแล้วจะไม่ให้ทำการลา
=====================================
ปรับเปลี่ยนเพิ่มเติ่ม
1.เมนู R1201 บัญชีลงเวลาการปฏิบัติราชการของบุคลากร
  -ปรับปรุงการแสดงเงื่อนไขสถานะบุคคลากรให้ ทำเครื่องหมายถูกที่ช่อง ปกติ และ รอบรรจุ
2.ตรวจสอบการ login
  -ปรับปรุงส่วนของการแจ้งเตือนหลังจากที่ login หากตรวจสอบพบว่า username และ password เหมือนกันจะแจ้งให้เปลี้ยนรหัสผ่านใหม่
3.เมนู A08 สร้างบัญชีแนบท้ายคำสั่งเลื่อนเงินเดือน (พนักงานราชการ)
  -ปรับปรุงส่วนของการแสดงผลใน excel โดยการเพิ่มคอลัมน์เงินเดือน
4.เมนู R0604 บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี
  -ปรับปรุงส่วนของการแสดงผลในรายงานโดยการเพิ่มประเภทความเคลื่อนไหวไปที่ช่องผลการประเมิน
5.เมนู A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
  -ปรับปรุงส่วนของการแสดงผลจำนวนเงินที่ผ่านการประเมิน ดี ดีเด่น ดีมาก เป็นต้น ให้แสดงจุดทศนิยม
6.เมนู P0143 พ้นจากส่วนราชการ
  -ปรับปรุงเรื่องการ update ข้อมูล โดยให้ updateวันที่พ้นจากส่วนราชการ ให้มีค่าเท่ากับวันที่มีผลและค่าของระดับตำแหน่งไปที่ประวัติการดำรงตำแหน่ง
7.เมนู P0601 การลา
  -ปรับปรุงเรื่องการแสดงผลวันที่ จังหวะที่พิมพ์รายงานยกเลิกใบลา ในส่วนของวันที่ จากเดิมรายงานนำวันที่ส่งใบลามาแสดง ให้ปรับเปลี่ยนเป็น วันที่ยกเลิกใบลามาแสดง
8.เมนู K08 การประเมิน KPI รายบุคคล
  -ปรับปรุงเรื่องการแสดงผลจังหวะออกรายงาน PDF / RTF ต้องการให้เพิ่ม ชื่อตัวชี้วัด (KPI) ในหน้า "ผลสำเร็จของงานจริง"
ตามรายละเอียดที่แนบมา ','สำนักงาน ก.พ.','2019-01-01','2019-01-01','2019-01-31',1,0,NULL,NULL,1,1,'2019-01-22 09:58:29');
INSERT INTO DPISEMP1.PER_MESSAGE (MSG_ID,MSG_HEADER,MSG_DETAIL,MSG_SOURCE,MSG_POST_DATE,MSG_START_DATE,MSG_FINISH_DATE,USER_ID,MSG_TYPE,MSG_DOCUMENT,MSG_ORG_NAME,MSG_SHOW,UPDATE_USER,UPDATE_DATE) VALUES
	 (31,'Patch Update DPIS Release 5.2.1.31','แก้ปัญหาเรื่อง
1.เมนู A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน
 -ปรับการแสดงผลการแสดงค่าตอบแทนไม่ต้องมีจุดทศนิยม
 -ปรับปรุงเรื่องการแสดงรายงานเดิมไม่สามารถส่งออกได้
2.เมนู P1114 นำเข้าข้อมูลสลิปเงินเดือน (กรมบัญชีกลาง)
 -ปรับแก้ฟังชันก์การนำเข้าข้อมูลสลิปเงินเดือนใหม่เนื่องจากเดิมจะไม่ได้ส่งคำสั่ง post ไป
3.เมนู C02 กลุ่มผู้ใช้งาน
-ปรับแก้ฟังชันก์การนำเข้ารายชื่อผู้ใช้งาน เนื่องจากเดิมทำให้เกิดรายชื่อซ้ำ
4.เมนู M0401 บัญชีอัตราเงินเดือน
-ปรับแก้ค่าระดับให้ถูกต้อง ตามค่าตอบแทนของพนักงานราชการ (ฉบับที่ ๘) ลว. ๒๔ มีนาคม ๒๕๕๘ 
5.เมนู P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่
-ปรับเรื่องการเรียงลำดับโดยให้เรียงตามค่าลำดับหน่วยงานที่มีการระบุไว้ที่โครงสร้างหน่วยงาน
6.เมนู P1112 ระบบสารสนเทศพนักงานราชการ (GEIS)
-ปรับปรุงเรื่องการแสดงหมายเหตุกรณีที่ลาออกให้แสดง ประเภทความเคลื่อนไหว
=====================================
ปรับเปลี่ยนเพิ่มเติ่ม
1.เมนู R0400 ก.พ.7 อิเล็คทรอนิกส์
-ปรับการแสดงผลประเภทการเคลื่อนไหวของตำแหน่งเพิ่มข้างหน้า ตำแหน่ง (ก.พ.7) และสังกัด(ก.พ.7) จากประวัติการดำรงค์ตำแหน่ง โดยสาสมารถคลิกเพื่อแสดงหรือไม่ก็ได้
2.ปรับจังหวะคลิกแสดงรายชื่อผู้ออนไลน์ กำหนดสิทธิ์ให้แต่ admin เท่านั้นที่สามารถลบรายชื่อออกจากระบบได้
3.เมนู C0704 โปรแกรมปรับเปลี่ยนฐานข้อมูล
-เพิ่มปุ่มปรับปรุงโครงสร้างหน่วยงาน กรณีที่โครงสร้างตามมอบหมายไม่เท่ากันตามกฏหมาย จะแสดงปุ่มนี้ขึ้นมาเพื่อให้ปรับปรุงโครงสร้างให้เท่ากัน
4.เมนูP0101 ข้อมูลบุคคล
-ปรับปรุงการแสดงผลลงวันที่ กรณีเกษียณอายุ ให้ดึง ลงวันที่ มาจากประวัติการดำรงตำแหน่งที่ประเภทความเคลื่อนไหวเป็นเกษียณอายุมาแสดง
5.เมนูP0304 บัญชีแนบท้ายคำสั่งย้าย
-เพิ่มปุ่มลบค่ามอบหมายให้ปฏิบัติงาน กรณีที่หน่วยงานไม่ต้องการระบุ
6.เมนูM0602 ปฏิทินวันหยุด
-ปรับปรุงเมื่อเพิ่มวันหยุดให้เเสดงรายชื่อของบุคคลที่ลาในช่วงวันหยุดที่ถูกเพิ่ม และให้มีปุ่มหักลบจำนวณวันหยุดของบุคคลที่ลาอยู่ในช่วงวันหยุด
7.เมนู R0407 รายชื่อข้าราชการ ตำแหน่ง สังกัด
-ปรับปรุงการแสดงผลออกรายงาน PDF และ Excel กรณีพนักงานราชการ ให้ตัดช่อง "ตำแหน่งประเภท"  "ระดับตำแหน่ง"  "ช่วงระดับตำแหน่ง" ออก และเพิ่มช่องแสดง "กลุ่มงาน" ลงในรายงาน โดยช่องกลุ่มงานให้ดึงข้อมูลจาก กลุ่มงานที่ตำแหน่ง
8.เมนู S0203 ตำแหน่งพนักงานราชการ
-ปรับปรุงการแสดงผลอัตราค่าจ้างขั้นต่ำ-อัตราค่าจ้างขั้นสูง ให้ทำการปิดไม่ให้แก้ไขตัวเลข ให้แสดงอย่างเดียวในส่วนของจังหวะการเพิ่มข้อมูลให้ default ขั้นเงิน ตามกลุ่มงาน
9.เมนูP0601 การลา
-ปรับปรุงให้มีช่องที่ระบุว่าเจ้าหน้าที่ท่านใดเป็นคนกดรับ กดบันทึก หรือ แก้ไขข้อมูลของการลา เนื่องจากที่ผ่านเกิดปัญหาขึ้น ผู้ใช้งานแจ้งว่าไม่ได้เป็นคนกดบันทึกหรือแก้ไขการลาใดๆ
10.หน้าหนังสือเวียนอิเล็กทรอนิกส์
-ปรับปรุงหน้างานหนังสือเวียนอิเล็กทรอนิกส์เนื่องจากข้าราชการสามารถ click ที่ปุ่ม "คลิกเพื่อเพิ่มข้อมูล" ได้จึงอยากทราบวิธีการปิดปุ่มนี้ สามารถทำได้หรือไม่
11.เมนูR0402 รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณ
-ปรับปรุงให้ออกรายงานปีงบประมาณย้อนหลังได้','สำนักงาน ก.พ.','2019-04-01','2019-04-01','2019-04-30',1,0,NULL,NULL,1,1,'2019-05-07 15:44:45'),
	 (33,'Patch Update DPIS Release 5.2.1.35+','#โครงสร้างและตำแหน่ง
 S0203 ตำแหน่งพนักงานราชการ ปรับปรุงส่วนของการบันทึกการแก้ไขข้อมูล เดิมระบบไม่ทำการบันทึกได้ จึงปรับให้สามารถบันทึกค่าได้ พบแค่กรณีที่รายการนั้นๆไม่มีอัตราค่าจ้างขั้นต่ำเท่านั้น
#ข้อมูลบุคคล
 P0604 ตั้งค่าวันลาพักผ่อนสะสม ปรับปรุงส่วนของการแจ้งเตือนจำนวนวันที่เกิน และปรับ logic ในการคำนวณและบันทึกค่า
 P0404 บัญชีแนบท้ายคำสั่งเลื่อนขั้นเงินเดือน ปรับ logic ในการประมวลผลเพื่อให้สามารถดึงรายชื่อมาแสดงได้
#ตั้งค่าระบบ
C02 กลุ่มผู้ใช้งาน เรื่องของการ def ค่าในการแสดงผลของสถานะผู้ใช้งาน ให้เป็นทั้งหมด
#หน้าแรก
 ข่าวสารและประชาสัมพันธ์ ปรับแก้ไขบันทึกข้อมูลข่าวสาร
========ปรับเพิ่มเติม=========
#รายงาน
 R0494 ประวัติใบอนุญาตประกอบวิชาชีพ เพิ่มใหม่เพื่อรองรับรายงานรูปแบบนี้
 R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส เพิ่มเติม ข้อมูล ในคอลัมน์การแสดงใบอนุญาตประกอบวิชาชีพวิศวกรรมควบคุม / สามัญ/ภาคีวิศวกร /ภย.44775
#ข้อมูลบุคคล
 P0102 ประวัติการดำรงตำแหน่ง เพิ่มการแสดงผล "วันที่ลงนาม"  ในตารางข้อมูล ประวัติการดำรงตำแหน่ง (คอลัมน์ถัดจากเลขที่คำสั่ง) และเพิ่มเงือนไขการแสดงผลที่เมนู C06 กำหนดค่าโปรแกรม เพื่อให้แสดง/ซ่อน "วันทีลงนาม" ที่ประวัติการดำรงตำแหน่ง
 P0604 ตั้งค่าวันลาพักผ่อนสะสม การลาของ 3 จังหวัดชายแดนภาคใต้ มีสิทธิ์ลาได้ 40 วัน แต่ทางกรมฯ ไม่สามารถทำบันทึกการลาได้ เนื่องจาก ระบบ กำหนดการลาได้เพียง 30 วัน จึงต้องการให้ระบบสามารถกำหนดสิทธิ์การลาได้ 40 วัน ตามสิทธิ์ที่ได้รับ
# การประเมินผล 
 K08 การประเมิน KPI รายบุคคล ขอเพิ่มโลโก้หน่วยงาน ในรายประเมินผลรายบุคคล ฉบับย่อ','สำนักงาน ก.พ.','2019-09-01','2019-09-01','2019-09-30',1,0,NULL,NULL,1,1,'2019-09-23 10:37:25'),
	 (35,'Patch Update DPIS Release 5.2.1.40','#ข้อมูลบุคคล
  -P1118 ระบบสารสนเทศเพื่อการวางแผนกำลังคนภาครัฐ (GMIS) ปรับปรุงเรื่องการส่งออกให้จำนวนออกมาครบตามเงื่อนไข
  -P1503 บัญชีแนบท้ายคำสั่งช่วยราชการ ปรับปรุงเงื่อนไขจังหวะยืนยันคำสั่งเพื่อให้จำนวนรายการที่ยืนยันไปครบถ้วน
#รายงาน
  -R0301 จำนวนข้าราชการที่บรรจุในปีงบประมาณ ปรับปรุงเงือนไขในการนับจำนวน รับโอนให้ถูกต้อง
  -R0406 ประวัติข้าราชการ ปรับปรุงเงื่อนไขการแสดงรายการประวัติการดำรงตำแหน่ง
#ตั้งค่าระบบ 
  -C0704 โปรแกรมปรับเปลี่ยนฐานข้อมูล ปรับปรุงเงื่อนไขการแสดงปุ่มสำหรับการอัพเดทโปรมแกรม เพื่อให้สร้างปุ่มประมวลผลข้าราชการรายงาน GMIS ได้

ปรับเพิ่มเติม
#ข้อมูลบุคคล
  -P0101 ข้อมูลบุคคล แถบ ข้อมูลประวัติการดำรงตำแหน่ง เมื่อกดแสดงรายละเอียด เลขที่คำสั่งไปเเสดงในช่องสัญญาจ้าง จึงอยากให้ช่องสัญญาจ้าง กับช่องเลขที่คำสั่ง แยกกัน ปรับให้เป็นคำว่า เลขที่คำสั่ง
#รายงาน
  -เพิ่มรายงาน เมนู R0620 รายงานเงินเพิ่มพิเศษ
  -R0600 รายงานการเลื่อนเงินเดือนรายบุคคล ในส่วนของรายงาน ไม่ต้องการให้แสดงวันที่ในรายงาน
  -R0103 รายชื่อตำแหน่งว่างเมื่อออกรายงาน เเล้วเลือกประเภทบุคลากรเป็น พนักงานราชการ ให้เปลี่ยนหัวตาราง ช่วงระดับตำแหน่ง เป็น กลุ่มงาน','สำนักงาน ก.พ.','2020-01-01','2020-01-01','2020-01-31',1,0,NULL,NULL,1,1,'2020-03-11 14:38:17'),
	 (36,'Patch Update DPIS Release 5.2.1.44','#รายงาน
                    - R0400 ก.พ.7 อิเล็คทรอนิกส์ ปรับปรุงการเเสดงข้อมูลให้ตรงตามเงื่อนไขที่ระบุบนหน้าจอ
                    #ประเมิน
                    - K08 การประเมิน KPI รายบุคคล ปรับปรุงการเรียกไฟล์แนบมาเเสดง ให้ใช้ Path Filesตามค่าconfig
                    #การลา
                    - T0202 กำหนดบุคคลที่ไม่ต้องลงเวลา ปรับปรุงเงื่อนไขรายงาน PDF และ Excel ให้เหมือนกันกับหน้าค้นหาข้อมูล
                    - P0605 บันทึกคำร้องไม่ได้ลงเวลา ปรับปรุงการพิมพ์รูปแบบคำร้อง รูปแบบที่1 รูปแบบที่2 ให้เเสดงลายเซ็นผู้อนุมัติ/อนุญาตกรณีที่ไม่ได้ใช้ระบบลงเวลา
                    - T0204 บันทึกคำร้องไม่ได้ลงเวลา ปรับปรุงให้เเสดงรอบการมาปฏิบัติราชการกรณีที่ระบุช่องขออนุญาตลงเวลาในวันที่เอง
                    ปรับเพิ่มเติม
                    - T0201 กำหนดรอบการมาปฏิบัติราชการ ได้ทำการเพิ่มปุ่มค้นหาข้อมูลบุคลลที่ไม่มีรอบการปฏิบัติราชการ
                    - N3108 - P0103 ประวัติการรับเงินเดือน ได้ทำการเพิ่มวันที่ลงนามต่อหลังลายเซ็น
                    - K08 การประเมิน KPI รายบุคคล ได้ทำการเพิ่มข้อมูลวิธีการวัดผลในการพัฒนาให้เเสดงในรายงาน','สำนักงาน ก.พ.','2020-05-01','2020-05-01','2020-05-31',1,0,NULL,NULL,1,1,'2020-05-26 14:47:19'),
	 (39,'Patch Update DPIS Release 5.2.1.52','#รายงาน
                    -R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส ปรับแก้การเเสดงข้อมูลผลการประเมินย้อนหลัง 3 ปีให้เเสดงเเสดงข้อมูลครบทุกรายชื่อ และปรับแก้การเเสดงข้อมู,ให้ตรงกับหัวคอลัมน์ของรายงาน
                    -R0505 ประวัติสำหรับเสนอขอพระราชทานเหรียญจักรพรรดิมาลา ปรับแก้เงื่อนไขเเสดงข้อมูลโดยตัดข้อมูลของเวลาออกจากคอลัมน์วันที่เข้ารับราชการที่เป็นสาเหตุทำให้ข้อมูลไม่แสดง
                    -R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโสปรับแก้โดยเช็คว่าถ้าไม่มีข้อมูลเครื่องราชให่ค่าดังกล่าวเป็นค่าว่าง และ ปรับปรุงหัวคอลัมน์ให้เท่ากับช่องเเสดงข้อมูล
                    #ข้อมูลบุคคล
                    -P0130 ประวัติการรักษาราชการแทน/รักษาการในตำแหน่ง/มอบหมายงาน ปรับแก้การนับจำนวนไฟล์กรณีไม่ได้ทำแนบท้ายคำสั่ง
                    -P0601 การลา ปรับแก้ให้เเสดงระดับตำแหน่งของลูกจ้างชั่วคราวกรณีเลือกลูกจ้างชั่วคราวเป็นผู้ตรวจสอบการลา','สำนักงาน ก.พ.','2021-04-01','2021-04-01','2021-04-30',1,0,NULL,NULL,1,1,'2021-05-12 16:10:18'),
	 (32,'Patch Update DPIS Release 5.2.1.34','#กลุ่มเมนูข้อมูลบุคคล
  P0141 สลิปเงินเดือน 1. ขอปรับให้แสดงผลสลิปเงินเดือนบน Browser โดยเพิ่มพารามิเตอร์ ซึ่งยากต่อการคาดเดาที่ที่จะเปิดดูของคนอื่นได้  ,2. ซ่อนเลขที่บัญชี เช่น 123xxxxx123
  P0119 สอบถามข้อมูล ปรับปรุงเพิ่มเติมในส่วนของคอลัมน์ สำนัก/กอง ในทุกๆ ระดับ จังหวะที่ออกรายงาน
  P1115 นำเข้าข้อมูลการเลื่อนเงินเดือน ปรับปรุงกรณีมีประวัติเงินเดือนล่าสุดแล้ว พอนำเข้ารายการใหม่ระบบไม่ไปเคลียร์ค่าเงินเดือนล่าสุดของรายการก่อนหน้า
  P0312 บัญชีแนบท้ายคำสั่งเปลี่ยนชื่อกรม ปรับปรุง Logic ในการเปลี่ยนชื่อหน่วยงาน
#รายงาน>R04รายงานการเจ้าหน้าที่
  R0400 ก.พ.7 อิเล็คทรอนิกส์ ปรับรูปแบบการออกรายงาน(RTF)ใหม่
  R0406 ประวัติข้าราชการ ส่วนของ รายงาน ก.พ.7 (EXCEL) ขอเพิ่มเติมในส่วนของ สำนัก/กอง  ต่ำกว่า 1 ระดับ
  R0495 รายชื่อข้าราชการ (โครงสร้างตามมอบหมายงาน) ปรับปรุงในส่วนของ Excel แยกคอลัมน์ กลุ่ม/ฝ่าย/สำนัก เป็นอย่างล่ะคอลัมน์ 
#ระบบบันทึกเวลา
  T0204 บันทึกคำร้องไม่ได้ลงเวลา ปรับปรุง Logic ในการค้นหารายชื่อ ผู้บังคับบัญชาชั้นต้น และ ผู้อนุมัติ/อนุญาต ใน สังกัด สำนัก/กองตามมอบหมายที่เจ้าตัวสังกัดอยู่','สำนักงาน ก.พ.','2019-07-01','2019-07-01','2019-07-31',1,0,NULL,NULL,1,1,'2019-07-22 09:55:06'),
	 (34,'Patch Update DPIS Release 5.2.1.37','#รายงาน
 -R0903 รายงานการประเมินสมรรถนะรายบุคคล ปรับการแสดงผลคะแนนให้อยู่ในรูปแบบเดียวกัน
 -R0412 รายงานข้อมูลข้าราชการแยกตามวุฒิการศึกษา/วิชาเอก/สถานศึกษา ปรับการเรียกใช้งานฟังชันก์เลือกโครงสร้างตามมอบหมายให้ถูกต้อง
#ข้อมูลบุคลกร
 -P0601 การลา ปรับแก้ logic การลาพักผ่อนข้ามปีงบประมาณใหม่ ให้สามารถลาได้
 -P0102 ประวัติการดำรงตำแหน่ง ปิดการแสดงผล Debug 
#การประเมินผล
 -K08 การประเมิน KPI รายบุคคล ปรับแก้ส่วนของการแสดงผลรายงานในรูปแบบ Rtf ให้แสดงผลแบบเดียวกับ PDF
#ตั้งค่าระบบ
 -C02 กลุ่มผู้ใช้งาน ปรับแก้ให้สามารถส่งออกรายงานรูปแบบ Excel ได้

ปรับเพิ่มเติม
#รายงาน
 -R0400 ก.พ.7 อิเล็กทรอนิกส์ เพิ่มการแสดงผลข้อมูลประเภทโทษทางวินัย เพิ่มการแสดงผลในรายงาน R0400 ก.พ.7 อิเล็กทรอนิกส์ โดยให้นำข้อมูลในช่อง ประเภทโทษทางวินัย มาแสดงในรายงาน รายละเอียดการแสดงผล คือ แสดงผลประเภทโทษทางวินัย ต่อด้วย กรณีความผิด ยกตัวอย่างเช่น โทษทางวินัย กรณีความผิด
 -R0701 รายงานการลาของข้าราชการ ประจำวัน ปรับปรุงการแสดงผลของช่องหมายเหตุ รูปแบบของวันที่ ไม่ต้องมี 0 นำหน้า
#การบริหารค่าตอบแทน
 -A05 การบริหารวงเงินงบประมาณเลื่อนเงินเดือน ปรับเรื่องการแสดงผลรายงาน
#ตั้งค่าระบบ
 -C02 กลุ่มผู้ใช้งาน เพิ่มปุ่ม ปรับปรุงชื่อ-สกุลให้ตรงกับข้อมูลบุคลากร 
#ข้อมูลบุคลกร
 -P0603 ตรวจสอบการลาเกินกำหนด ปรับปรุง กรณีเข้าหน้าเมนู P0603 ครั้งแรก ไม่ต้องให้โปรแกรม แสดงข้อมูลขึ้นมารอ และแก้ไขข้อความเงื่อนไข เช่น จำนวนวัน  จำนวนครั้ง  จำนวนวันสาย ให้เป็น จำนวนวันเกิน จำนวนครั้งเกิน จำนวนวันสายเกิน
 -P1501 บัญชีแนบท้ายคำสั่งรักษาราชการแทน/รักษาการในตำแหน่ง
#การประเมินผล
 -K08 การประเมิน KPI รายบุคคล ปรับเรื่องการแสดงผลระดับการประเมิน เมื่อโปรแกรมตรวจสอบเจอว่า มีระดับผลการประเมินระดับกรม หรือไม่ ถ้ามีให้นำระดับกรมมาแสดง','สำนักงาน ก.พ.','2019-10-01','2019-10-01','2019-10-31',1,0,NULL,NULL,1,1,'2019-10-11 09:33:04'),
	 (37,'Patch Update DPIS Release 5.2.1.45','#รายงาน
                    - P1113 บัญชีรายละเอียดให้ข้าราชการพลเรือนสามัญได้รับการเลื่อนเงินเดือน (กรมบัญชีกลาง) ปรับปรุงให้ออกรายงานได้ในสิทธิ์ระดับกระทรวง
                    - P0119 สอบถามข้อมูล ปรับปรุงให้ออกรายงานได้กับประเภทบุคลากรที่เป็น ลูกจ้างประจำ และพนักงานราชการ
                    - R0400 ก.พ.7 อิเล็คทรอนิกส์ ปรับปรุงการแสดงตำแหน่งในสายงานให้ตรงกับข้อมูลประวัติการดำรงตำแหน่ง
                    - P0311 บัญชีแนบท้ายคำสั่งจัดคนลงตามโครงสร้างส่วนราชการใหม่รายงานรูปแบบ PDFปรับปรุงให้เเสดงตำแหน่งทางการบริหารที่เเต่งตั้ง
                    
                    ปรับเพิ่มเติม
                    - R0604 บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี ปรับการเเสดงข้อมูลของผู้ที่ไม่ได้เลื่อนเงินเดือนเดิมเเสดงเป็น "-" เปลี่ยนเป็นข้อมความ ไม่ได้เลื่อนเงินเดือน
                    - P0304 บัญชีแนบท้ายคำสั่งย้าย
                          1)เปลี่ยนชื่อ ช่อง"ปรับปรุงเงินเดือนปัจจุบันตามแฟ้มคำสั่งนี้" เป็นชื่อ "เพิ่มเฉพาะประวัติการดำรงตำแหน่ง"
                          2)เพิ่มเติมงหวะกดยืนยันคำสั่งแฟ้ม หากกรมติกช่อง เพิ่มเฉพาะประวัติการดำรงตำแหน่ง ให้โปรแกรมเพิ่มเฉพาะข้อมูลประวัติเท่านั้น
                    - P0101 ข้อมูลบุคคล เพิ่มเติมให้ออกรายงานรูปแบบ .csv
                    - P0111 ประวัติทางวินัย เพิ่มเติมยกเลิกบังคับกรอกข้อมูลวันที่สิ้นสุดการลงโทษ','สำนักงาน ก.พ.','2020-06-01','2020-06-01','2020-06-30',1,0,NULL,NULL,1,1,'2020-07-01 14:26:21'),
	 (38,'Patch Update DPIS Release 5.2.1.51','#รายงาน
                    -P1118 ระบบสารสนเทศเพื่อการวางแผนกำลังคนภาครัฐ (GMIS)ปรับปรุง Query จากเดิมที่ใช้ With เป็น sub select
                    -R0406 ประวัติข้าราชการปรับให้รายงานแสดงจุดทศนิยมเท่ากับหน้าบันทึกข้อมูล
                    -R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโสปรับแก้โดยเช็คว่าถ้าไม่มีข้อมูลเครื่องราชให่ค่าดังกล่าวเป็นค่าว่าง และ ปรับปรุงหัวคอลัมน์ให้เท่ากับช่องเเสดงข้อมูล
                    #ปรับเปลี่ยนเพิ่มเติม
                    -T0201 กำหนดรอบการมาปฏิบัติราชการ  เพิ่มการเเสดงเลขบัตรประจำตัวประชาชนในรายงาน
                    -R0400 ก.พ.7 อิเล็คทรอนิกส์ เพิ่มการเเสดงหมายเหตุที่หลังข้อมูลเงินเดือน
                    -S0201 ตำแหน่งข้าราชการ เพิ่มการเเสดงชื่อผู้ครองตำแหน่งก่อนตำแหน่งว่าง ในรายงาน
                    -R0403 รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ ~ เรียงตามลำดับอาวุโส Merg คอลัมน์ วุฒิและสาขาวิชาเอก เป็นคอลัมน์เดียว
                    -T0205 ประมวลผลข้อมูลการลงเวลาเปลี่ยนการเเสดงเเจ้งเตือนเป็น ?บันทึกคำร้องไม่ได้ลงเวลา : มีรายการที่รออนุมัติ ต้องทำการอนุมัติก่อน?
                    -R0413 รายงานข้อมูลข้าราชการที่ผ่านการฝึกอบรมหลักสูตรปรับปรุงรายงานให้เเสดงหลักสูตรอื่นๆ
                    -P0101 ข้อมูลบุคคลปรับปรุงเพิ่มตัวเลือกตรวจสอบบุคคลที่ไม่มีอีเมล
                    -C02 กลุ่มผู้ใช้งานปรับปรุ่งเมื่อมีการบันทึกอีเมลให้ข้อมูลไปบันทึกที่ข้อมูลบุคคล
                    -P0103 ประวัติการรับเงินเดือนปรับปรุงการให้เเสดงหมายเหตุในรายงานผลการเลือนเงินเดือน','สำนักงาน ก.พ.','2021-02-01','2021-02-01','2021-02-28',1,0,NULL,NULL,1,1,'2021-03-09 16:39:17');
