INSERT INTO DPISEMP1.PER_GOODNESS (GN_CODE,GN_NAME,GN_ACTIVE,UPDATE_USER,UPDATE_DATE,GN_SEQ_NO,GN_OTHERNAME) VALUES
	 ('01','ปฏิบัติตนตามระเบียบวินัย จรรยาบรรณ (จรรยาบรรณและวินัยต่อตนเองและหน่วยงาน, จรรยาบรรณและวินัยต่อประชาชน) ',1,1,'2007-12-27 14:38:33',NULL,NULL),
	 ('02','การประพฤติ การปฏิบัติตามงานในหน้าที่รับผิดชอบ',1,1,'2007-12-27 14:38:33',NULL,NULL),
	 ('03','พฤติกรรมการทำคุณงามความดีอื่น ๆ ที่ส่วนราชการกำหนดตามลักษณะงานของตน หรือที่มีมติคณะรัฐมนตรีกำหนดไว้ ',1,1,'2007-12-27 14:38:33',NULL,NULL);
