INSERT INTO DPISEMP1.PER_TIME_ATT (TA_CODE,TA_NAME,WL_CODE,TA_ACTIVE,UPDATE_USER,UPDATE_DATE) VALUES
	 ('1','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 1 (10.0.0.200)','01',1,1,'2008-11-14 11:21:01'),
	 ('2','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 2 (10.0.0.201)','01',1,1,'2008-11-14 11:21:01'),
	 ('3','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 3 (10.0.0.202)','01',1,1,'2008-11-14 11:21:01'),
	 ('4','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 4 (10.0.0.203)','01',1,1,'2008-11-14 11:21:01'),
	 ('5','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 5 (192.168.94.245)','02',1,1,'2008-11-14 11:21:01'),
	 ('6','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 6 (192.168.94.246)','02',1,1,'2008-11-14 11:21:01'),
	 ('7','เครื่องบันทึกเวลาการปฏิบัติงานอิเล็กทรอนิกส์ 7 (192.168.20.100)','02',1,1,'2008-11-14 11:21:01');
