INSERT INTO DPISEMP1.PER_COMPETENCE_LEVEL (CP_CODE,CL_NO,CL_NAME,CL_MEANING,UPDATE_USER,UPDATE_DATE,DEPARTMENT_ID) VALUES
	 ('101',0,'ไม่แสดงสมรรถนะด้านนี้อย่างชัดเจน',NULL,1,'2007-05-11 13:22:07',3062),
	 ('101',1,'แสดงความพยายามในการทำงานให้ดี',NULL,1,'2007-05-11 13:22:07',3062),
	 ('101',2,'แสดงสมรรถนะระดับที่ 1 และสามารถทำงานได้ผลตามเป้าหมายที่วางไว้',NULL,1,'2007-05-11 13:22:07',3062),
	 ('101',3,'แสดงสมรรถนะระดับที่ 2 และสามารถทำงานได้ผลงานที่มีประสิทธิภาพยิ่งขึ้น',NULL,1,'2007-05-11 13:22:07',3062),
	 ('101',4,'แสดงสมรรถนะระดับที่ 3 และสามารถพัฒนาวิธีการทำงาน เพื่อให้ได้ผลงานที่โดดเด่น และแตกต่างอย่างไม่เคยมีใครทำได้มาก่อน',NULL,1,'2007-05-11 13:22:07',3062),
	 ('101',5,'แสดงสมรรถนะระดับที่ 4 และสามารถตัดสินใจได้ แม้จะมีความเสี่ยง เพื่อให้องค์กรบรรลุเป้าหมาย',NULL,1,'2007-05-11 13:22:07',3062);
