INSERT INTO DPISEMP1.PER_LICENSEHIS (LH_ID,PER_ID,PER_CARDNO,LT_CODE,LH_SUB_TYPE,LH_LICENSE_NO,LH_LICENSE_DATE,LH_EXPIRE_DATE,LH_SEQ_NO,LH_REMARK,UPDATE_USER,UPDATE_DATE,AUDIT_FLAG,LH_MAJOR) VALUES
	 (1,770,'1509900468001','14','มีสิทธิประกอบวิชาชีพสังคมสงเคราะห์รับอนุญาต','1665','2017-01-24','2020-01-23',NULL,NULL,1,'2018-06-14 09:34:14',NULL,'สังคมสงเคราะห์'),
	 (2,761,'1509900522170','14','มีสิทธิประกอบวิชาชีพสังคมสงเคราะห์รับอนุญาต','0996','2016-07-08','2019-07-07',NULL,NULL,1,'2018-06-14 09:36:50',NULL,'สังคมสงเคราะห์'),
	 (3,5085,'1330200045496','09','ตลอดชีพ','778/2560','2017-01-27','2023-01-26',NULL,NULL,1,'2019-05-11 13:56:35',NULL,'นิติศาสตร์'),
	 (8,5294,'1409600060821','06','ชั้นหนึ่ง','5511237128','2017-07-30','2022-07-29',1,NULL,1,'2021-10-15 15:49:11',NULL,'การพยาบาลและการผดุงครรภ์'),
	 (4,5286,'1969900072839','06','การพยาบาลและการผดุงครรภ์ ชั้นหนึ่ง','5611202737','2018-05-13','2023-05-12',1,NULL,6830,'2021-01-26 14:39:21',NULL,NULL),
	 (5,4784,'1551100044292','14','มีสิทธิประกอบวิชาชีพสังคมสงเคราะห์รับอนุญาต','2819','2020-11-13','2025-11-12',NULL,NULL,7827,'2021-02-24 11:07:27',NULL,'สังคมสงเคราะห์'),
	 (6,761,'1509900522170','14','มีสิทธิประกอบวิชาชีพสังคมสงเคราะห์รับอนุญาต','0996','2019-07-08','2024-07-07',NULL,NULL,7827,'2021-02-24 11:08:05',NULL,'สังคมสงเคราะห์'),
	 (7,4709,'1940900167661','14','มีสิทธิประกอบวิชาชีพสังคมสงเคราะห์รับอนุญาต','2412','2019-07-12','2024-07-11',NULL,NULL,7827,'2021-02-24 14:26:19',NULL,'สังคมสงเคราะห์'),
	 (9,5465,'1103700865331','08',NULL,'ก.12440','2018-12-07','2023-12-06',NULL,NULL,1,'2022-05-10 10:56:22',NULL,'กายภาพบำบัด');
