INSERT INTO DPISEMP1.PER_SKILL_GROUP (SG_CODE,SG_NAME,PL_CODE,SG_ACTIVE,UPDATE_USER,UPDATE_DATE,SG_SEQ_NO,SG_OTHERNAME) VALUES
	 ('010       ','แพทยศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('020       ','ทันตแพทยศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('030       ','เภสัชศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('040       ','พยาบาลศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('050       ','สาธารณสุขและวิทยาศาสตร์การแพทย์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('060       ','เศรษฐศาสตร์และการคลัง','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('070       ','การเงินและการบัญชี','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('080       ','กฎหมาย','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('090       ','การเกษตร','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('100       ','วิศวกรรมศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL);
INSERT INTO DPISEMP1.PER_SKILL_GROUP (SG_CODE,SG_NAME,PL_CODE,SG_ACTIVE,UPDATE_USER,UPDATE_DATE,SG_SEQ_NO,SG_OTHERNAME) VALUES
	 ('110       ','การศึกษา ศิลปศาสตร์ และสังคมศาสตร์ อื่น ๆ','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('120       ','การบริหาร','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('130       ','พัฒนาอุตสาหกรรม','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('140       ','วิทยาศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('150       ','สถาปัตยกรรมศาสตร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('160       ','วิทยาการคอมพิวเตอร์','010108    ',0,1,'2004-01-06 16:57:02',NULL,NULL),
	 ('990       ','ยังไม่จัดกลุ่ม','010108    ',1,1,'2004-01-06 16:57:02',NULL,NULL);
