INSERT INTO DPISEMP1.PER_PERFORMANCE_REVIEW (PFR_ID,PFR_NAME,PFR_YEAR,PFR_ID_REF,UPDATE_USER,UPDATE_DATE,DEPARTMENT_ID,PFR_TYPE) VALUES
	 (1,'มิติที่ 1 มิติด้านประสิทธิผลตามแผนปฏิบัติราชการ','2549',NULL,1,'2007-05-11 13:22:07',3062,NULL),
	 (2,'มิติที่ 2 มิติด้านคุณภาพการให้บริการ','2549',NULL,1,'2007-05-11 13:22:07',3062,NULL),
	 (3,'มิติที่ 3 มิติด้านประสิทธิภาพของการปฏิบัติราชการ','2549',NULL,1,'2007-05-11 13:22:07',3062,NULL),
	 (4,'มิติที่ 4 มิติด้านการพัฒนาองค์กร','2549',NULL,1,'2007-05-11 13:22:07',3062,NULL),
	 (5,'ผลสำเร็จตามแผนปฏิบัติราชการ','2549',1,1,'2007-05-11 13:22:07',3062,NULL),
	 (6,'คุณภาพการให้บริการ','2549',2,1,'2007-05-11 13:22:07',3062,NULL),
	 (7,'การมีส่วนร่วมของประชาชน','2549',2,1,'2007-05-11 13:22:07',3062,NULL),
	 (8,'การป้องกันและปราบปรามการทุจริตและประพฤติมิชอบ','2549',2,1,'2007-05-11 13:22:07',3062,NULL),
	 (9,'การบริหารงบประมาณ','2549',3,1,'2007-05-11 13:22:07',3062,NULL),
	 (10,'การประหยัดพลังงาน','2549',3,1,'2007-05-11 13:22:07',3062,NULL);
INSERT INTO DPISEMP1.PER_PERFORMANCE_REVIEW (PFR_ID,PFR_NAME,PFR_YEAR,PFR_ID_REF,UPDATE_USER,UPDATE_DATE,DEPARTMENT_ID,PFR_TYPE) VALUES
	 (11,'การลดระยะเวลาการให้บริการ','2549',3,1,'2007-05-11 13:22:07',3062,NULL),
	 (12,'การประหยัดงบประมาณ','2549',3,1,'2007-05-11 13:22:07',3062,NULL),
	 (13,'การจัดการความรู้','2549',4,1,'2007-05-11 13:22:07',3062,NULL),
	 (14,'การจัดการสารสนเทศ','2549',4,1,'2007-05-11 13:22:07',3062,NULL),
	 (15,'การบริหารการเปลี่ยนแปลงและการพัฒนาบุคลากร','2549',4,1,'2007-05-11 13:22:07',3062,NULL),
	 (16,'การพัฒนากฏหมาย','2549',4,1,'2007-05-11 13:22:07',3062,NULL),
	 (17,'การถ่ายทอดตัวชี้วัดและเป้าหมายของระดับองค์กรสู่ระดับบุคคล','2549',4,1,'2007-05-11 13:22:07',3062,NULL),
	 (27,'4.เชื่อมโยงสังคมแรงงาน ด้วยเครือข่ายดิจิทัล และเครือข่ายการสื่อสาร เพื่อสร้างการเข้าถึงและให้บริการเชิงรุกแก่ทุกคน','2563',NULL,1,'2021-09-07 11:08:34',3062,NULL),
	 (28,'5.ปฏิรูปองค์กรให้ก้าวทันต่อการเปลี่ยนแปลง เพื่อให้บริการได้เต็มศักยภาพ','2563',NULL,1,'2021-09-07 11:08:45',3062,NULL),
	 (29,'1.สร้างความครอบคลุมการดูแลบริการและสิทธิประโยชน์ของวัยแรงงานทุกกลุ่มและทุกคน','2565',NULL,1,'2021-10-29 18:04:55',3062,NULL);
INSERT INTO DPISEMP1.PER_PERFORMANCE_REVIEW (PFR_ID,PFR_NAME,PFR_YEAR,PFR_ID_REF,UPDATE_USER,UPDATE_DATE,DEPARTMENT_ID,PFR_TYPE) VALUES
	 (30,'2.พัฒนานวัตกรรมการให้บริการและการเข้าถึงกลุ่มแรงงานที่มีความต้องการเฉพาะ','2565',NULL,1,'2021-10-29 18:06:04',3062,NULL),
	 (31,'3.ออกแบบและพัฒนาบริการ พร้อมกับสิทธิประโยชน์ เพื่อเตรียมความพร้อมและยกระดับคุณภาพชีวิตของกลุ่มผู้สูงอายุ','2565',NULL,1,'2021-10-29 18:06:24',3062,NULL),
	 (32,'4.เชื่อมโยงสังคมแรงงาน ด้วยเครือข่ายดิจิทัล และเครือข่ายการสื่อสาร เพื่อสร้างการเข้าถึงและให้บริการเชิงรุกแก่ทุกคน','2565',NULL,1,'2021-10-29 18:08:05',3062,NULL),
	 (33,'5.ปฏิรูปองค์กรให้ก้าวทันต่อการเปลี่ยนแปลง เพื่อให้บริการได้เต็มศักยภาพ','2565',NULL,1,'2021-10-29 18:07:13',3062,NULL),
	 (22,'4.เชื่อมโยงสังคมแรงงาน ด้วยเครือข่ายดิจิทัล และเครือข่ายการสื่อสาร เพื่อสร้างการเข้าถึงและให้บริการเชิงรุกแก่ทุกคน','2564',NULL,1,'2021-02-25 17:37:12',3062,NULL),
	 (19,'1.สร้างความครอบคลุมการดูแลบริการและสิทธิประโยชน์ของวัยแรงงานทุกกลุ่มและทุกคน

','2564',NULL,1,'2021-02-25 17:34:48',3062,NULL),
	 (20,'2.พัฒนานวัตกรรมการให้บริการและการเข้าถึงกลุ่มแรงงานที่มีความต้องการเฉพาะ','2564',NULL,1,'2021-02-25 17:35:54',3062,NULL),
	 (21,'3.ออกแบบและพัฒนาบริการ พร้อมกับสิทธิประโยชน์ เพื่อเตรียมความพร้อมและยกระดับคุณภาพชีวิตของกลุ่มผู้สูงอายุ','2564',NULL,1,'2021-02-25 17:36:33',3062,NULL),
	 (23,'5.ปฏิรูปองค์กรให้ก้าวทันต่อการเปลี่ยนแปลง เพื่อให้บริการได้เต็มศักยภาพ','2564',NULL,1,'2021-02-25 17:37:35',3062,NULL),
	 (18,'1.สร้างความครอบคลุมการดูแลบริการและสิทธิประโยชน์ของวัยแรงงานทุกกลุ่มและทุกคน','2549',NULL,1,'2021-02-25 17:24:46',3062,NULL);
INSERT INTO DPISEMP1.PER_PERFORMANCE_REVIEW (PFR_ID,PFR_NAME,PFR_YEAR,PFR_ID_REF,UPDATE_USER,UPDATE_DATE,DEPARTMENT_ID,PFR_TYPE) VALUES
	 (26,'3.ออกแบบและพัฒนาบริการ พร้อมกับสิทธิประโยชน์ เพื่อเตรียมความพร้อมและยกระดับคุณภาพชีวิตของกลุ่มผู้สูงอายุ','2563',NULL,1,'2021-09-07 11:08:22',3062,NULL),
	 (24,'1.สร้างความครอบคลุมการดูแลบริการและสิทธิประโยชน์ของวัยแรงงานทุกกลุ่มและทุกคน','2563',NULL,1,'2021-09-07 11:07:55',3062,NULL),
	 (25,'2.พัฒนานวัตกรรมการให้บริการและการเข้าถึงกลุ่มแรงงานที่มีความต้องการเฉพาะ','2563',NULL,1,'2021-09-07 11:08:08',3062,NULL);
