INSERT INTO DPISEMP1.PER_LEVELSKILL (LEVELSKILL_CODE,LEVELSKILL_NAME,LS_ACTIVE,UPDATE_USER,UPDATE_DATE,SEQ_NO) VALUES
	 ('01','มีความเข้าใจ เรียนรู้องค์ความรู้นั้น',1,1,'2017-10-23 11:05:57',NULL),
	 ('02','มีการศึกษาองค์ความรู้นั้นอย่างละเอียดลึกซึ้ง',1,1,'2017-10-23 11:05:57',NULL),
	 ('03','สามารถจัดเรียงแยกแยะองค์ความรู้นั้นเป็นระบบ',1,1,'2017-10-23 11:05:57',NULL),
	 ('04','มีทักษะและสามารถลงมือปฏิบัติในองค์ความรู้นั้นจนเกิดผลเป็นรูปธรรม',1,1,'2017-10-23 11:05:57',NULL),
	 ('05','สามารถสอนผู้อื่นให้ลงมือปฏิบัติในองค์ความรู้นั้นแล้วเกิดผลเป็นรูปธรรม',1,1,'2017-10-23 11:05:57',NULL),
	 ('06','สามารถประยุกต์ เชื่อมโยง บูรณาการข้อมูล หลายองค์ความรู้เข้าด้วยกันเป็นระบบ',1,1,'2017-10-23 11:05:57',NULL),
	 ('07','สามารถออกแบบ ประดิษฐ์ คิดค้น สร้างองค์ความรู้ใหม่ที่ปฏิบัติแล้วเกิดผลเป็นรูปธรรม',1,1,'2017-10-23 11:05:57',NULL),
	 ('08','สามารถถ่ายทอดองค์ความรู้ใหม่ที่คิดค้นได้ จนผู้อื่นปฏิบัติแล้วเกิดผลเป็นรูปธรรม',1,1,'2017-10-23 11:05:57',NULL);
