INSERT INTO DPISEMP1.PER_HOLIDAY_GROUP (HG_ID,HG_CODE,HG_NAME,HG_SEQ_NO,HG_ACTIVE,UPDATE_USER,UPDATE_DATE) VALUES
	 (1,'01','อาทิตย์-จันทร์',1,1,1,'2011-04-11 16:20:03'),
	 (2,'12','จันทร์-อังคาร',2,1,1,'2011-04-11 16:20:03'),
	 (3,'23','อังคาร-พุธ',3,1,1,'2011-04-11 16:20:03'),
	 (4,'34','พุธ-พฤหัสบดี',4,1,1,'2011-04-11 16:20:03'),
	 (5,'45','พฤหัสบดี-ศุกร์',5,1,1,'2011-04-11 16:20:03'),
	 (6,'56','ศุกร์-เสาร์',6,1,1,'2011-04-11 16:20:03'),
	 (7,'60','เสาร์-อาทิตย์',7,1,1,'2011-04-11 16:20:03');
