INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('E7',1,3092,'2010-10-18 13:30:37','กลุ่มงานเทคนิคพิเศษ',3,'เทคนิคพิเศษ',67,NULL,'กลุ่มงานเทคนิคพิเศษ',NULL,NULL),
	 ('10',0,1,'2004-01-06 16:38:35','ระดับ 10',1,'10',10,NULL,' 10',NULL,NULL),
	 ('11',0,1,'2004-01-06 16:38:35','ระดับ 11',1,'11',11,NULL,' 11',NULL,NULL),
	 ('01',0,1,'2007-05-11 13:22:07','ระดับ 1',1,'1',1,NULL,' 1',NULL,NULL),
	 ('02',0,1,'2007-05-11 13:22:07','ระดับ 2',1,'2',2,NULL,' 2',NULL,NULL),
	 ('03',0,1,'2007-05-11 13:22:07','ระดับ 3',1,'3',3,NULL,' 3',NULL,NULL),
	 ('04',0,1,'2007-05-11 13:22:07','ระดับ 4',1,'4',4,NULL,' 4',NULL,NULL),
	 ('05',0,1,'2007-05-11 13:22:07','ระดับ 5',1,'5',5,NULL,' 5',NULL,NULL),
	 ('06',0,1,'2007-05-11 13:22:07','ระดับ 6',1,'6',6,NULL,' 6',NULL,NULL),
	 ('07',0,1,'2007-05-11 13:22:07','ระดับ 7',1,'7',7,NULL,' 7',NULL,NULL);
INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('08',0,1,'2007-05-11 13:22:07','ระดับ 8',1,'8',8,NULL,' 8',NULL,NULL),
	 ('09',0,1,'2007-05-11 13:22:07','ระดับ 9',1,'9',9,NULL,' 9',NULL,NULL),
	 ('O1',1,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับปฏิบัติงาน',1,'ปง.',21,'ทั่วไป','ปฏิบัติงาน',NULL,'Operational Level'),
	 ('O2',1,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับชำนาญงาน',1,'ชง.',22,'ทั่วไป','ชำนาญงาน',NULL,'Experienced Level'),
	 ('O3',1,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับอาวุโส',1,'อว.',23,'ทั่วไป','อาวุโส',NULL,'Senior Level'),
	 ('O4',1,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับทักษะพิเศษ',1,'ทพ.',24,'ทั่วไป','ทักษะพิเศษ',NULL,'Highly Skilled Level'),
	 ('K1',1,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับปฏิบัติการ',1,'ปก.',31,'วิชาการ','ปฏิบัติการ',NULL,'Practitioner Level'),
	 ('K2',1,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับชำนาญการ',1,'ชก.',32,'วิชาการ','ชำนาญการ',NULL,'Professional Level'),
	 ('K3',1,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับชำนาญการพิเศษ',1,'ชพ.',33,'วิชาการ','ชำนาญการพิเศษ',NULL,'Senior Professional Level'),
	 ('K4',1,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับเชี่ยวชาญ',1,'ชช.',34,'วิชาการ','เชี่ยวชาญ',NULL,'Expert Level');
INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('K5',1,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับทรงคุณวุฒิ',1,'ทว.',35,'วิชาการ','ทรงคุณวุฒิ',NULL,'Advisory Level'),
	 ('D1',1,1,'2007-05-11 13:22:07','ประเภทอำนวยการ ระดับต้น',1,'อต.',41,'อำนวยการ','ต้น',NULL,'Primary Level'),
	 ('D2',1,1,'2007-05-11 13:22:07','ประเภทอำนวยการ ระดับสูง',1,'อส.',42,'อำนวยการ','สูง',NULL,'Higher Level'),
	 ('M1',1,1,'2007-05-11 13:22:07','ประเภทบริหาร ระดับต้น',1,'บต.',51,'บริหาร','ต้น',NULL,'Primary Level'),
	 ('M2',1,1,'2007-05-11 13:22:07','ประเภทบริหาร ระดับสูง',1,'บส.',52,'บริหาร','สูง',NULL,'Higher Level'),
	 ('E1',1,1,'2007-05-11 13:22:07','กลุ่มงานบริการ',3,'บริการ',61,NULL,'กลุ่มงานบริการ',NULL,NULL),
	 ('E2',1,1,'2007-05-11 13:22:07','กลุ่มงานเทคนิคทั่วไป',3,'เทคนิคทั่วไป',62,NULL,'กลุ่มงานเทคนิค',NULL,NULL),
	 ('E3',1,1,'2007-05-11 13:22:07','กลุ่มงานบริหารทั่วไป',3,'บริหารทั่วไป',63,NULL,'กลุ่มงานบริหารทั่วไป',NULL,NULL),
	 ('E4',1,1,'2007-05-11 13:22:07','กลุ่มงานวิชาชีพเฉพาะ',3,'วิชาชีพเฉพาะ',64,NULL,'กลุ่มงานวิชาชีพเฉพาะ',NULL,NULL),
	 ('E5',1,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญเฉพาะ',3,'เชี่ยวชาญเฉพาะ',65,NULL,'กลุ่มงานเชี่ยวชาญเฉพาะ',NULL,NULL);
INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('S1',1,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับทั่วไป)',3,'ระดับทั่วไป',71,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับทั่วไป)',NULL,NULL),
	 ('S2',1,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับประเทศ)',3,'ระดับประเทศ',72,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับประเทศ)',NULL,NULL),
	 ('S3',1,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับสากล)',3,'ระดับสากล',73,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับสากล)',NULL,NULL),
	 ('บ1',1,1,'2010-05-31 10:47:01','ระดับ บ1',2,'บ1',11,'กลุ่มงานบริการพื้นฐาน','ระดับ บ1',NULL,NULL),
	 ('บ2',1,1,'2010-05-31 10:47:01','ระดับ บ2',2,'บ2',12,'กลุ่มงานบริการพื้นฐาน','ระดับ บ2',NULL,NULL),
	 ('บ3',1,1,'2010-05-31 10:47:01','ระดับ บ2/หัวหน้า',2,'บ2/หน.',13,'กลุ่มงานบริการพื้นฐาน','ระดับ บ2/หัวหน้า',NULL,NULL),
	 ('ส1',1,1,'2010-05-31 10:47:01','ระดับ ส1',2,'ส1',21,'กลุ่มงานสนับสนุน','ระดับ ส1',NULL,NULL),
	 ('ส2',1,1,'2010-05-31 10:47:01','ระดับ ส2',2,'ส2',22,'กลุ่มงานสนับสนุน','ระดับ ส2',NULL,NULL),
	 ('ส3',1,1,'2010-05-31 10:47:01','ระดับ ส2/หัวหน้า',2,'ส2/หน.',23,'กลุ่มงานสนับสนุน','ระดับ ส2/หัวหน้า',NULL,NULL),
	 ('ส4',1,1,'2010-05-31 10:47:01','ระดับ ส3',2,'ส3',24,'กลุ่มงานสนับสนุน','ระดับ ส3',NULL,NULL);
INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('ส5',1,1,'2010-05-31 10:47:01','ระดับ ส3/หัวหน้า',2,'ส3/หน.',25,'กลุ่มงานสนับสนุน','ระดับ ส3/หัวหน้า',NULL,NULL),
	 ('ส6',1,1,'2010-05-31 10:47:01','ระดับ ส4',2,'ส4',26,'กลุ่มงานสนับสนุน','ระดับ ส4',NULL,NULL),
	 ('ส7',1,1,'2010-05-31 10:47:01','ระดับ ส4/หัวหน้า',2,'ส4/หน.',27,'กลุ่มงานสนับสนุน','ระดับ ส4/หัวหน้า',NULL,NULL),
	 ('ช1',1,1,'2010-05-31 10:47:01','ระดับ ช1',2,'ช1',31,'กลุ่มงานช่าง','ระดับ ช1',NULL,NULL),
	 ('ช2',1,1,'2010-05-31 10:47:01','ระดับ ช2',2,'ช2',32,'กลุ่มงานช่าง','ระดับ ช2',NULL,NULL),
	 ('ช3',1,1,'2010-05-31 10:47:01','ระดับ ช2/หัวหน้า',2,'ช2/หน.',33,'กลุ่มงานช่าง','ระดับ ช2/หัวหน้า',NULL,NULL),
	 ('ช4',1,1,'2010-05-31 10:47:01','ระดับ ช3',2,'ช3',34,'กลุ่มงานช่าง','ระดับ ช3',NULL,NULL),
	 ('ช5',1,1,'2010-05-31 10:47:01','ระดับ ช3/หัวหน้า',2,'ช3/หน.',35,'กลุ่มงานช่าง','ระดับ ช3/หัวหน้า',NULL,NULL),
	 ('ช6',1,1,'2010-05-31 10:47:01','ระดับ ช4',2,'ช4',36,'กลุ่มงานช่าง','ระดับ ช4',NULL,NULL),
	 ('ช7',1,1,'2010-05-31 10:47:01','ระดับ ช4/หัวหน้า',2,'ช4/หน.',37,'กลุ่มงานช่าง','ระดับ ช4/หัวหน้า',NULL,NULL);
INSERT INTO DPIS.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('ท1',1,1,'2010-05-31 10:47:01','ระดับ ท1',2,'ท1',41,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท1',NULL,NULL),
	 ('ท2',1,1,'2010-05-31 10:47:01','ระดับ ท2',2,'ท2',42,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท2',NULL,NULL),
	 ('ท3',1,1,'2010-05-31 10:47:01','ระดับ ท2/หัวหน้า',2,'ท2/หน.',43,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท2/หัวหน้า',NULL,NULL),
	 ('ท4',1,1,'2010-05-31 10:47:01','ระดับ ท3',2,'ท3',44,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท3',NULL,NULL),
	 ('ท5',1,1,'2010-05-31 10:47:01','ระดับ ท3/หัวหน้า',2,'ท3/หน.',45,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท3/หัวหน้า',NULL,NULL);
