INSERT INTO DPISEMP1.PER_LICENSE_TYPE (LT_CODE,LT_NAME,LT_REMARK,LT_ACTIVE,UPDATE_USER,UPDATE_DATE,LT_SEQ_NO,LT_OTHERNAME) VALUES
	 ('14','ใบอนุญาตประกอบวิชาชีพสังคมสงเคราะห์','ออกโดย สภาวิชาชีพสังคมสงเคราะห์',1,1,'2018-06-14 09:31:09',NULL,NULL),
	 ('01','ใบอนุญาตประกอบโรคศิลปะ','เป็นใบอนุญาตในการประกอบวิชาชีพที่กระทำหรือมุ่งหมายจะกระทำต่อมนุษย์เกี่ยวกับการตรวจโรค การวินิจฉัยโรค การบำบัดโรค การป้องกันโรค การส่งเสริมและการฟื้นฟูสุขภาพ และการผดุงครรภ์ แต่ไม่รวมถึงการประกอบวิชาชีพทางการแพทย์และสาธารณสุขอื่น ที่มีการตั้งสภาวิชาชีพเพื่อควบคุมดูแลในแต่ละวิชาชีพแล้ว ซึ่งใบอนุญาตประกอบโรคศิลปะออกโดยคณะกรรมการการประกอบโรคศิลปะ กองการประกอบโรคศิลปะ กระทรวงสาธารณสุข ในปัจจุบัน มีวิชาชีพที่ต้องขึ้นทะเบียนและได้รับใบอนุญาตประกอบโรคศิลปะ จากกองประกอบโรคศิลปะ กระทรวงสาธารณสุข[1] ดังนี้
 สาขากิจกรรมบำบัด
 สาขารังสีเทคนิค
 สาขาการแก้ไขความผิดปกติของการสื่อความหมาย
 สาขาเทคโนโลยีหัวใจและทรวงอก
 สาขาจิตวิทยาคลินิก
 สาขาการแพทย์แผนไทย
 สาขาการแพทย์แผนไทยประยุกต์
 สาขาการแพทย์แผนจีน
 สาขาทัศนมาตรศาสตร์
 สาขากายอุปกรณ์
',1,1,'2013-12-19 15:40:26',1,NULL),
	 ('02','ใบอนุญาตประกอบวิชาชีพเวชกรรม','ออกโดย แพทยสภา',1,1,'2013-12-19 15:40:26',2,NULL),
	 ('03','ใบอนุญาตประกอบวิชาชีพทันตกรรม','ออกโดย ทันตแพทยสภา',1,1,'2013-12-19 15:40:26',3,NULL),
	 ('04','ใบอนุญาตประกอบวิชาชีพการสัตวแพทย์','ออกโดย สัตวแพทยสภา',1,1,'2013-12-19 15:40:26',4,NULL),
	 ('05','ใบอนุญาตประกอบวิชาชีพเภสัชกรรม','ออกโดย สภาเภสัชกรรม',1,1,'2013-12-19 15:40:26',5,NULL),
	 ('06','ใบอนุญาตประกอบวิชาชีพการพยาบาลและการผดุงครรภ์','ออกโดย สภาการพยาบาล',1,1,'2013-12-19 15:40:26',6,NULL),
	 ('07','ใบอนุญาตประกอบวิชาชีพเทคนิคการแพทย์','ออกโดย สภาเทคนิคการแพทย์',1,1,'2013-12-19 15:40:26',7,NULL),
	 ('08','ใบอนุญาตประกอบวิชาชีพกายภาพบำบัด','ออกโดย สภากายภาพบำบัด',1,1,'2013-12-19 15:40:26',8,NULL),
	 ('09','ใบอนุญาตให้เป็นทนายความ','ออกโดย สภาทนายความ',1,1,'2013-12-19 15:40:26',9,NULL);
INSERT INTO DPISEMP1.PER_LICENSE_TYPE (LT_CODE,LT_NAME,LT_REMARK,LT_ACTIVE,UPDATE_USER,UPDATE_DATE,LT_SEQ_NO,LT_OTHERNAME) VALUES
	 ('10','ใบอนุญาตประกอบวิชาชีพวิศวกรรมควบคุม','ใบอนุญาตประกอบวิชาชีพวิศวกรรมควบคุมในประเทศไทย เป็นใบอนุญาตให้บุคคลประกอบวิชาชีพวิศวกรรมควบคุม ออกโดยสภาวิศวกร เริ่มต้นในประเทศไทยครั้งแรกตามพระราชบัญญัติวิชาชีพวิศวกรรม พ.ศ. 2505[1] ปัจจุบันบังคับใช้ตามพระราชบัญญัติวิศวกร พ.ศ. 2542[2] ประกอบด้วยสาขาวิศวกรรมควบคุม ได้แก่ วิศวกรรมโยธา วิศวกรรมไฟฟ้ากำลัง วิศวกรรมไฟฟ้าสื่อสาร วิศวกรรมเครื่องกล วิศวกรรมอุตสาหการ วิศวกรรมเหมืองแร่ วิศวกรรมเคมี และวิศวกรรมสิ่งแวดล้อม ผู้ประกอบวิชาชีพวิศวกรรมควบคุม แต่ละสาขาแบ่งเป็น 4 ระดับ คือ
 1.วุฒิวิศวกร
 2.สามัญวิศวกร
 3.ภาคีวิศวกร
 4.ภาคีวิศวกรพิเศษ
',1,1,'2013-12-19 15:40:26',10,NULL),
	 ('11','ใบอนุญาตประกอบวิชาชีพสถาปัตยกรรม','ใบประกอบวิชาชีพสถาปัตยกรรม หรือเดิม (ก่อน พ.ร.บ. สภาสถาปนิก 2543) เรียกย่อว่า ก.ส. เป็นเอกสารรับรองของสถาปนิกในการออกแบบและเซ็นรับรองแบบ ที่รับรองโดยสภาสถาปนิก ในปัจจุบันมีอยู่ 4 สาขาด้วยกันได้แก่ สถาปัตยกรรมหลัก สถาปัตยกรรมภายในและมัณฑนศิลป์ สถาปัตยกรรมผังเมือง และ ภูมิสถาปัตยกรรม ใบประกอบวิชาชีพฯมี 4 ระดับเรียงจากสูงไปต่ำ คือ วุฒิสถาปนิก สามัญสถาปนิก ภาคีสถาปนิก และ สถาปนิกภาคีพิเศษขอบเขตงานที่ควบคุมในสาขาต่างๆ ถูกกำหนดไว้โดยในกฎกระทรวง (พ.ศ. 2549) ว่าด้วยการกำหนดวิชาชีพสถาปัตยกรรมควบคุม
 
กฎกระทรวงการกำหนดวิชาชีพสถาปัตยกรรมควบคุมนี้ ได้มีการกำหนดให้งานสถาปัตยกรรมควบคุมสาขาต่างๆ ทั้ง 4 สาขานั้น ผู้ดำเนินการงานออกแบบ ให้คำปรึกษา ตรวจสอบ ศึกษาโครงการ บริหารและอำนวยการก่อสร้าง ต้องเป็นสถาปนิก (แต่ละสาขา) ที่มีใบอนุญาตประกอบวิชาชีพในระดับขั้นต่างๆกันไป ตามขอบเขตของงาน
',1,1,'2013-12-19 15:40:26',11,NULL),
	 ('12','ใบอนุญาตประกอบวิชาชีพทางการศึกษา','ใบอนุญาตประกอบวิชาชีพทางการศึกษา เป็นหลักฐานการอนุญาตให้ผู้ประกอบวิชาชีพควบคุมตามมาตรา 43 แห่งพระราชบัญญัติสภาครูและบุคลากรทางการศึกษา พ.ศ. 2546[1] เป็นผู้มีสิทธิ์ในการประกอบวิชาชีพ ซึ่งได้แก่ ครู ผู้บริหารสถานศึกษา ผู้บริหารการศึกษา และบุคลากรทางการศึกษาอื่น ซึ่งหน่วยงานที่มีหน้าที่ในการออกใบอนุญาตฯ คือ คุรุสภา ประเภทของใบอนุญาต
 ใบอนุญาตประกอบวิชาชีพครู
 ใบอนุญาตประกอบวิชาชีพผู้บริหารสถานศึกษา
 ใบอนุญาตประกอบวิชาชีพผู้บริหารการศึกษา
 ใบอนุญาตประกอบวิชาชีพบุคลากรทางการศึกษาอื่น
',1,1,'2013-12-19 15:40:26',12,NULL),
	 ('13','ใบอนุญาตประกอบวิชาชีพวิทยาศาสตร์และเทคโนโลยีควบคุม','ออกโดย สภาวิชาชีพวิทยาศาสตร์และเทคโนโลยี',1,1,'2013-12-19 15:40:26',13,NULL);
