INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('0200      ','ปฏิบัติหน้าที่ไม่ซื่อสัตย์สุจริต',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0300      ','ปฏิบัติหน้าที่โดยไม่เที่ยงธรรม',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0400      ','อาศัยอำนาจหน้าที่หาประโยชน์',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0500      ','ทุจริตต่อหน้าที่ราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0600      ','ไม่ตั้งใจปฏิบัติหน้าที่ราชการให้เกิดผลดีหรือความก้าวหน้า',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0700      ','ปฏิบัติหน้าที่โดยไม่อุตสาหะ ไม่เอาใจใส่ระมัดระวัง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0800      ','ประมาทเลินเล่อในหน้าที่ราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('0900      ','ประมาทเลินเล่อเป็นเหตุให้เสียหายแก่ราชการอย่างร้ายแรง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1000      ','ปฏิบัติหน้าที่ไม่เป็นไปตามกฎหมาย ระเบียบของทางราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1100      ','ปฏิบัติหน้าที่ไม่เป็นตามมติครม.และนโยบายของรัฐบาล',1,1,'2004-01-06 16:37:55',NULL,NULL);
INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('1200      ','จงใจไม่ปฏิบัตินามกฎหมาย ระเบียบ เสียหายอย่างร้ายแรง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1300      ','ไม่สนใจและรับทราบเหตุการณ์เคลื่อนไหว ไม่ป้องกันภยันอันตราย',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1400      ','เปิดเผยความลับของทางราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1500      ','เปิดเผยความลับ เป็นเหตุให้เสียหายแก่ราชการอย่างร้ายแรง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1600      ','ขัดคำสั่งหรือหลีกเลี่ยงไม่ปฏิบัติตามคำสั่ง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('1900      ','รายงานเท็จต่อผู้บังคับบัญชา',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2000      ','รายงานเท็จต่อผู้บังคับบัญชาเป็นเหตุให้เสียหายร้ายแรง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2100      ','ไม่ปฎิบัติตามระเบียบและแบบธรรมเนียมของทางราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2200      ','ไม่ปฎิบัติตามจรรยาบรรณข้าราชการพลเรือน',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2300      ','ละทิ้งหรือทอดทิ้งหน้าที่ราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL);
INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('2400      ','ละทิ้งหรือทอดทิ้งหน้าที่ราชการเป็นเหตุให้เสียหายอย่างร้ายแรง',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2500      ','ละทิ้งหน้าที่ราชการติดต่อกันเกิน 15 วัน โดยไม่มีเหตุ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2600      ','ละทิ้งหน้าที่ราชการติดต่อกันเกินกว่า 15 วัน โดยจงใจไม่ปฎิบัติฯ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2700      ','ไม่สุภาพเรียบร้อยระหว่างข้าราชการและผู้ร่วมปฎิบัติงาน',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2800      ','ไม่รักษาความสามัคคึ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('2900      ','กลั่นแกล้งกัน',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('3000      ','ไม่ช่วยเหลือกันในหน้าที่ราชการ',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('3100      ','ไม่ต้อนรับประชาชนผู้ติดต่อราชการเกี่ยวกับหน้าที่ของตน',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('3200      ','ไม่ให้ความสะดวกแก่ประชาชนผู้ติดต่อราชการเกี่ยวกับหน้าที่ตน',1,1,'2004-01-06 16:37:55',NULL,NULL),
	 ('3300      ','ไม่ให้ความเป็นธรรมแก่ประชาชนผู้ติดต่อเกี่ยวกับหน้าที่ตน',1,1,'2004-01-06 16:37:56',NULL,NULL);
INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('3400      ','ไม่ให้ความสงเคราะห์แก่ประชาชนผู้ติดต่อเกี่ยวกับหน้าที่ตน',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('3500      ','ไม่สุภาพเรียบร้อยต่อประชาชนผู้ติดต่อเกี่ยวกับหน้าที่ตน',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('3600      ','ดูหมิ่น เหยียดหยามประชาชนผู้ติดต่อราชการ',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('3700      ','กดขี่ ข่มเหง ประชาชนผู้ติดต่อราชการ',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('3800      ','ดูหมิ่น เหยียดหยามประชาชนผู้ติดต่อราชการอย่างร้ายแรง',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('3900      ','กดขี่ ข่มเหง ประชาชนผู้ติดต่อราชการอย่างร้ายแรง',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4000      ','กระทำหรือยอมให้ผู้อื่นกระทำการหาประโยชน์ทำให้เสียความเที่ยงธรรม',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4100      ','กระทำหรือยอมให้ผู้อื่นกระทำการหาประโยชน์ทำให้เสื่อมเสียเกียรติ',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4200      ','เป็นกรรมการผู้จัดการหรือผู้จัดการในห้างหุ้นส่วนหรือบริษัท',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4300      ','ดำรงตำแหน่งอื่นใดที่คล้ายคลึงกับกรรมการผู้จัดการ',1,1,'2004-01-06 16:37:56',NULL,NULL);
INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('4400      ','วางตัวไม่เป็นกลางทางการเมืองในการปฎิบัติหน้าที่ราชการ',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4500      ','วางตัวไม่เป็นกลางในการปฎิบัติงานอื่นที่เกี่ยวข้องกับประชาชน',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4600      ','ไม่ปฎิบัติตามระเบียบว่าด้วยมารยาททางการเมือง',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4700      ','ประพฤติชั่ว',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4800      ','กระทำผิดอาญาจนได้รับโทษจำคุก',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('4900      ','ประพฤติชั่วอย่างร้ายแรง',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('5000      ','ผู้บังคับบัญชาละเลยไม่ดำเนินการทางวินัยผู้ใต้บังคับบัญชา',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('1700      ','ขัดคำสั่ง เสียหายร้ายแรง',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('1800      ','กระทำการข้ามผู้บังคับบัญชา',1,1,'2004-01-06 16:37:56',NULL,NULL),
	 ('0100      ','ไม่สนับสนุนการปกครองระบอบประชาธิปไตย',1,1,'2004-01-06 16:37:55',NULL,NULL);
INSERT INTO DPISEMP1.PER_CRIME (CR_CODE,CR_NAME,CR_ACTIVE,UPDATE_USER,UPDATE_DATE,CR_SEQ_NO,CR_OTHERNAME) VALUES
	 ('5001      ','กระทำความผิดวินัยอย่างไม่ร้ายแรง',1,6830,'2020-04-23 11:54:43',NULL,NULL);
