INSERT INTO DPISEMP1.PER_REWARD (REW_CODE,REW_NAME,REW_ACTIVE,UPDATE_USER,UPDATE_DATE,REW_SEQ_NO,REW_OTHERNAME) VALUES
	 ('08        ','เจ้าหน้าที่ของรัฐที่ปฏิบัติราชการด้วยความซื่อสัตย์สุจริต  ประจำปีงบประมาณ 2553 (จังหวัดอ่างทอง)',1,3095,'2011-02-04 14:35:53',NULL,NULL),
	 ('01        ','เพชรจรัสแสง',1,1,'2003-07-30 13:45:15',NULL,NULL),
	 ('02        ','ข้าราชการดีเด่นของสำนัก/กอง',1,1,'2003-07-30 13:45:38',NULL,NULL),
	 ('03        ','ข้าราชการดีเด่นของสำนักงาน ก.พ.',1,1,'2003-07-30 13:45:59',NULL,NULL),
	 ('04        ','ลูกจ้างประจำดีเด่นของสำนัก/กอง',1,1,'2003-07-30 13:46:20',NULL,NULL),
	 ('05        ','ลูกจ้างประจำดีเด่นของสำนักงาน ก.พ.',1,1,'2003-07-30 13:46:47',NULL,NULL),
	 ('06        ','ข้าราชการพลเรือนดีเด่นระดับจังหวัด',1,1223,'2010-05-20 13:57:27',NULL,NULL),
	 ('07        ','ข้าราชการต้นแบบที่ปฏิบัติตนและปฏิบัติงานเป็นแบบอย่างที่ดีของจังหวัด',1,1223,'2010-05-20 13:58:14',NULL,NULL),
	 ('09        ','พนักงานประกันสังคมดีเด่นของสำนัก/กอง',1,1,'2020-08-25 14:29:23',NULL,NULL),
	 ('10        ','บุคลากรดีเด่นด้านคุณธรรมจริยธรรมของสำนักงานประกันสังคม',1,6830,'2021-09-03 16:09:16',NULL,NULL);
