INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('G001   ','รายงานโครงสร้างตำแหน่ง',0),
	 ('G002   ','รายงานโครงสร้างกำลังคน',0),
	 ('G003   ','รายงานความเคลื่อนไหว',0),
	 ('G004   ','รายงานการเจ้าหน้าที่',0),
	 ('G005   ','รายงานเครื่องราชฯ',0),
	 ('G006   ','รายงานเลื่อนขั้นเงินเดือน',0),
	 ('G007   ','รายงานวันลา',0),
	 ('G008   ','รายงานวินัย',0),
	 ('R001001','จำนวนตำแหน่งจำแนกตามสถานภาพและลักษณะของตำแหน่ง',1),
	 ('R001002','จำนวนตำแหน่งจำแนกตามลักษณะของตำแหน่ง',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R001003','รายชื่อตำแหน่งว่าง',1),
	 ('R002001','จำนวนข้าราชการแยกตามระดับตำแหน่ง',1),
	 ('R002002','จำนวนข้าราชการจำแนกตามระดับการศึกษาและประเทศที่สำเร็จการศึกษา',1),
	 ('R002003','จำนวนข้าราชการจำแนกตามประเทศที่สำเร็จการศึกษา',1),
	 ('R002004',' โครงสร้างอายุข้าราชการ',1),
	 ('R002005','โครงสร้างอายุราชการ',1),
	 ('R002006','จำนวนข้าราชการจำแนกตามวุฒิการศึกษา',1),
	 ('R002007','รายชื่อข้าราชการจำแนกตามวุฒิ/ประเทศ',1),
	 ('R002008',' รายงานข้อมูลข้าราชการที่สำเร็จการศึกษาในต่างประเทศระดับ..(ตรี/โท/เอก). แยกตามสำนัก/กอง',1),
	 ('R002009','รายงานข้อมูลข้าราชการแยกตามวุฒิการศึกษา/สาขาวิชาเอก',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R003001','จำนวนข้าราชการที่บรรจุในปีงบประมาณ',1),
	 ('R003002','จำนวนข้าราชการที่ออกจากราชการในปีงบประมาณ',1),
	 ('R003003','จำนวนข้าราชการที่ย้ายระหว่างสำนัก/กอง ในปีงบประมาณ',1),
	 ('R003004','จำนวนข้าราชการที่ย้ายระหว่างสายงาน ในปีงบประมาณ',1),
	 ('R003005','รายชื่อข้าราชการที่ดำรงตำแหน่งเกิน … ปี',1),
	 ('R003006','อัตราการเข้าออกของข้าราชการในปีงบประมาณ',1),
	 ('R003007','จำนวนข้าราชการที่ได้รับการเลื่อนระดับตำแหน่งในปีงบประมาณ',1),
	 ('R003008','ระยะเวลาเฉลี่ยในการเข้าสู่ระดับ',1),
	 ('R003009','ระยะเวลาเฉลี่ยในการเลื่อนระดับ',1),
	 ('R003010','รายชื่อข้าราชการที่บรรจุในปีงบประมาณ',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R003011','รายชื่อข้าราชการที่ออกจากราชการในปีงบประมาณ',1),
	 ('R003012','รายชื่อข้าราชการที่เลื่อนระดับตำแหน่งในปีงบประมาณ',1),
	 ('R003013','รายชื่อข้าราชการที่ย้ายระหว่างกอง/สายงาน ในปีงบประมาณ',1),
	 ('R004001','จำนวนข้าราชการที่ครบเกษียณอายุราชการในช่วง 5 ปี',1),
	 ('R004002','รายชื่อข้าราชการที่เกษียณอายุในสิ้นปีงบประมาณ',1),
	 ('R004003','รายชื่อข้าราชการที่ดำรงตำแหน่งในระดับ … เรียงตามลำดับอาวุโส',1),
	 ('R004004','รายชื่อข้าราชการผู้มีสิทธิ์เลื่อนตำแหน่งในระดับควบต้น',1),
	 ('R004005','รายชื่อข้าราชการผู้มีสิทธิ์เลื่อนตำแหน่งในระดับควบปลาย',1),
	 ('R004006','ประวัติข้าราชการ',1),
	 ('R004007','รายชื่อข้าราชการ ตำแหน่ง สังกัด',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R004008','จำนวนข้าราชการลาไปศึกษา  ฝึกอบรม  สัมมนา  ดูงาน  ณ ประเทศ…..',1),
	 ('R004009','จำนวนข้าราชการที่เข้ารับการฝึกอบรม  ประจำปีงบประมาณ …...',1),
	 ('R004010','รายชื่อข้าราชการที่เกษียณอายุราชการ  ล่วงหน้า  5  ปี',1),
	 ('R004011','รายงานผลงานดีเด่นของข้าราชการ',1),
	 ('R004012','รายงานข้อมูลข้าราชการแยกตามวุฒิการศึกษา/วิชาเอก/สถานศึกษา',1),
	 ('R004013','รายงานข้อมูลข้าราชการที่ผ่านการฝึกอบรมหลักสูตร',1),
	 ('R004014','รายงานข้อมูลข้าราชการที่ผ่านการฝึกอบรมหลักสูตร แยกตามสำนัก/กอง',1),
	 ('R004015','รายงานข้อมูลข้าราชการที่ลาไปศึกษา/ฝึกอบรม ณ ต่างประเทศ แยกตามสำนัก/กอง',1),
	 ('R004016','รายงานข้อมูลข้าราชการที่ลาศึกษาในประเทศ  แยกตามสำนัก/กอง',1),
	 ('R004017','บัญชีรายชื่อข้าราชการระดับ  สายงาน สังกัด เรียงตามอาวุโส',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R005001',' บัญชีข้าราชการสำนักงาน ก.พ. เสนอขอพระราชทานเครื่องราชอิสริยาภรณ์',1),
	 ('R005002','บัญชีแสดงจำนวนชั้นตราเครื่องราชอิสริยาภรณ์ซึ่งขอพระราชทานให้แก่ข้าราชการ',1),
	 ('R005003','บัญชีแสดงจำนวนชั้นตราเครื่องราชอิสริยาภรณ์ซึ่งขอพระราชทานให้แก่ผู้ขอพระราชทานเครื่องราชอิสริยาภรณ์',1),
	 ('R005004','บัญชีแสดงคุณสมบัติของข้าราชการ ซึ่งขอพระราชทานเครื่องราชอิสริยาภรณ์',1),
	 ('R005005','ประวัติสำหรับเสนอขอพระราชทานเหรียญจักรพรรดิมาลา',1),
	 ('R005006','บัญชีรายชื่อข้าราชการผู้ขอพระราชทานเครื่องราชอิสริยาภรณ์',1),
	 ('R005007','รายชื่อข้าราชการที่มีสิทธิได้รับเครื่องราชฯชั้นสายสะพาย/ต่ำกว่าสายสะพาย',1),
	 ('R006001','รายชื่อผู้ที่จะถึงขั้นสูงของเงินเดือน',1),
	 ('R006002','รายชื่อผู้ที่ได้รับการเลื่อนขั้น ในช่วง 5 ปี',1),
	 ('R006003','รายชื่อผู้ที่ไม่มีสิทธิ์ได้เลื่อนขั้น',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R006004','บัญชีรายละเอียดการเลื่อนขั้นเงินเดือนย้อนหลัง 5 ปี',1),
	 ('R006005','บัญชีสรุปจำนวนข้าราชการและอัตราเงินเดือนรวมของข้าราชการ',1),
	 ('R006006','บัญชีสรุปจำนวนข้าราชการ',1),
	 ('R006007','บัญชีสรุปการเลื่อนขั้นเงินเดือนของข้าราชการ',1),
	 ('R006008','บัญชีรายชื่อข้าราชการที่ไม่ได้เลื่อนขั้นเงินเดือน',1),
	 ('R006009','รายงานการคำนวณเงินบำเหน็จ/บำนาญ',1),
	 ('R006010',' รายชื่อข้าราชการ/ลูกจ้างประจำ  ที่ได้เลื่อนขั้น',1),
	 ('R006011','รายงานข้อมูลข้าราชการที่เคยเลื่อนขั้นเงินเดือน แยกตามสำนัก/กอง',1),
	 ('R006012','การจัดสรรโควตาการเลื่อนขั้นเงินเดือนประจำปี  ระดับ 9 ขึ้นไป',1),
	 ('R006013','การจัดสรรโควตาการเลื่อนขั้นเงินเดือนประจำปี  ระดับ 8 ลงมา',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R006014','บัญชีรายละเอียดการเลื่อนขั้นเงินเดือน.... ขั้น ย้อนหลัง 5 ปี',1),
	 ('R006015','บัญชีถือจ่ายเงินเดือนข้าราชการ',1),
	 ('R006016','บัญชีถือจ่ายเงินประจำตำแหน่ง',1),
	 ('R007001','รายงานการมาปฏิบัติราชการของข้าราชการ ประจำวัน',1),
	 ('R007002','รายงานการมาปฏิบัติราชการของข้าราชการ ประจำเดือน',1),
	 ('R007003','รายงานการลารายบุคคล',1),
	 ('R008001','รายชื่อข้าราชการที่อยู่ระหว่างการสอบสวนทางวินัย',1),
	 ('R008002','รายชื่อข้าราชการที่ถูกลงโทษทางวินัย',1),
	 ('R008003','สถิติการลงโทษทางวินัย จำแนกตามส่วนราชการ เทียบเท่ากอง',1),
	 ('R008004','สถิติความผิดทางวินัยจำแนกตามสำนัก/กอง',1);
INSERT INTO DPISEMP1.PER_REPORT (REP_CODE,REP_NAME,REP_LEVEL) VALUES
	 ('R008005','สถิติผลการลงโทษทางวินัย',1),
	 ('R008006','สถิติฐานความผิดทางวินัย จำแนกตามระดับตำแหน่ง',1),
	 ('R008007','สถิติฐานความผิดทางวินัย จำแนกตามเพศ',1);
