INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('1 ',0,1,'2018-12-21 09:17:41','ชั้นต้น',1,'ชั้นต้น',12,NULL,NULL,NULL,NULL),
	 ('2 ',0,1,'2018-12-19 14:25:17','ชั้นกลาง',1,'ชั้นกลาง',13,NULL,NULL,NULL,NULL),
	 ('3 ',0,1,'2018-12-19 14:26:51','ชั้นสูง',1,'ชั้นสูง',14,NULL,NULL,NULL,NULL),
	 ('4 ',0,1,'2017-06-21 13:13:23','4',1,'ผู้จัดการ',15,'4','4',NULL,NULL),
	 ('5 ',0,1,'2018-08-30 15:23:08','5',1,'ผู้จัดการอาวุโส',16,'5','5',NULL,NULL),
	 ('6 ',0,1,'2017-06-21 13:14:04','6',1,'ผู้บริหารสายงาน',17,'6','6',NULL,NULL),
	 ('E7',0,3092,'2010-10-18 13:30:37','กลุ่มงานเทคนิคพิเศษ',3,'เทคนิคพิเศษ',67,NULL,'กลุ่มงานเทคนิคพิเศษ',NULL,NULL),
	 ('10',0,1,'2004-01-06 16:38:35','ระดับ 10',1,'10',10,NULL,' 10',NULL,NULL),
	 ('11',0,1,'2004-01-06 16:38:35','ระดับ 11',1,'11',11,NULL,' 11',NULL,NULL),
	 ('01',1,1,'2019-11-26 13:56:47','ชั้นต้น',1,'ชั้นต้น',0,'ชั้นต้น','ชั้นต้น',NULL,NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('02',1,1,'2019-11-26 13:57:02','ชั้นกลาง',1,'ชั้นกลาง',0,'ชั้นกลาง','ชั้นกลาง',NULL,NULL),
	 ('03',1,1,'2019-11-26 13:57:13','ชั้นสูง',1,'ชั้นสูง',0,'ชั้นสูง','ชั้นสูง',NULL,NULL),
	 ('04',0,1,'2007-05-11 13:22:07','ระดับ 4',1,'4',4,NULL,' 4',NULL,NULL),
	 ('05',0,1,'2007-05-11 13:22:07','ระดับ 5',1,'5',5,NULL,' 5',NULL,NULL),
	 ('06',0,1,'2007-05-11 13:22:07','ระดับ 6',1,'6',6,NULL,' 6',NULL,NULL),
	 ('07',0,1,'2007-05-11 13:22:07','ระดับ 7',1,'7',7,NULL,' 7',NULL,NULL),
	 ('08',0,1,'2007-05-11 13:22:07','ระดับ 8',1,'8',8,NULL,' 8',NULL,NULL),
	 ('09',0,1,'2007-05-11 13:22:07','ระดับ 9',1,'9',9,NULL,' 9',NULL,NULL),
	 ('O1',0,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับปฏิบัติงาน',1,'ปง.',21,'ทั่วไป','ปฏิบัติงาน',NULL,'Operational Level'),
	 ('O2',0,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับชำนาญงาน',1,'ชง.',22,'ทั่วไป','ชำนาญงาน',NULL,'Experienced Level');
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('O3',0,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับอาวุโส',1,'อว.',23,'ทั่วไป','อาวุโส',NULL,'Senior Level'),
	 ('O4',0,1,'2007-05-11 13:22:07','ประเภททั่วไป ระดับทักษะพิเศษ',1,'ทพ.',24,'ทั่วไป','ทักษะพิเศษ',NULL,'Highly Skilled Level'),
	 ('K1',0,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับปฏิบัติการ',1,'ปก.',31,'วิชาการ','ปฏิบัติการ',NULL,'Practitioner Level'),
	 ('K2',0,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับชำนาญการ',1,'ชก.',32,'วิชาการ','ชำนาญการ',NULL,'Professional Level'),
	 ('K3',0,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับชำนาญการพิเศษ',1,'ชพ.',33,'วิชาการ','ชำนาญการพิเศษ',NULL,'Senior Professional Level'),
	 ('K4',0,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับเชี่ยวชาญ',1,'ชช.',34,'วิชาการ','เชี่ยวชาญ',NULL,'Expert Level'),
	 ('K5',0,1,'2007-05-11 13:22:07','ประเภทวิชาการ ระดับทรงคุณวุฒิ',1,'ทว.',35,'วิชาการ','ทรงคุณวุฒิ',NULL,'Advisory Level'),
	 ('D1',0,1,'2007-05-11 13:22:07','ประเภทอำนวยการ ระดับต้น',1,'อต.',41,'อำนวยการ','ต้น',NULL,'Primary Level'),
	 ('D2',0,1,'2007-05-11 13:22:07','ประเภทอำนวยการ ระดับสูง',1,'อส.',42,'อำนวยการ','สูง',NULL,'Higher Level'),
	 ('M1',0,1,'2007-05-11 13:22:07','ประเภทบริหาร ระดับต้น',1,'บต.',51,'บริหาร','ต้น',NULL,'Primary Level');
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('M2',0,1,'2007-05-11 13:22:07','ประเภทบริหาร ระดับสูง',1,'บส.',52,'บริหาร','สูง',NULL,'Higher Level'),
	 ('E1',0,1,'2007-05-11 13:22:07','กลุ่มงานบริการ',3,'บริการ',61,NULL,'กลุ่มงานบริการ',NULL,NULL),
	 ('E2',0,1,'2007-05-11 13:22:07','กลุ่มงานเทคนิคทั่วไป',3,'เทคนิคทั่วไป',62,NULL,'กลุ่มงานเทคนิค',NULL,NULL),
	 ('E3',0,1,'2007-05-11 13:22:07','กลุ่มงานบริหารทั่วไป',3,'บริหารทั่วไป',63,NULL,'กลุ่มงานบริหารทั่วไป',NULL,NULL),
	 ('E4',0,1,'2007-05-11 13:22:07','กลุ่มงานวิชาชีพเฉพาะ',3,'วิชาชีพเฉพาะ',64,NULL,'กลุ่มงานวิชาชีพเฉพาะ',NULL,NULL),
	 ('E5',0,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญเฉพาะ',3,'เชี่ยวชาญเฉพาะ',65,NULL,'กลุ่มงานเชี่ยวชาญเฉพาะ',NULL,NULL),
	 ('S1',0,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับทั่วไป)',3,'ระดับทั่วไป',71,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับทั่วไป)',NULL,NULL),
	 ('S2',0,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับประเทศ)',3,'ระดับประเทศ',72,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับประเทศ)',NULL,NULL),
	 ('S3',0,1,'2007-05-11 13:22:07','กลุ่มงานเชี่ยวชาญพิเศษ (ระดับสากล)',3,'ระดับสากล',73,NULL,'กลุ่มงานเชี่ยวชาญพิเศษ (ระดับสากล)',NULL,NULL),
	 ('บ1',0,1,'2010-05-31 10:47:01','ระดับ บ1',2,'บ1',11,'กลุ่มงานบริการพื้นฐาน','ระดับ บ1',NULL,NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('บ2',0,1,'2010-05-31 10:47:01','ระดับ บ2',2,'บ2',12,'กลุ่มงานบริการพื้นฐาน','ระดับ บ2',NULL,NULL),
	 ('บ3',0,1,'2010-05-31 10:47:01','ระดับ บ2/หัวหน้า',2,'บ2/หน.',13,'กลุ่มงานบริการพื้นฐาน','ระดับ บ2/หัวหน้า',NULL,NULL),
	 ('ส1',0,1,'2010-05-31 10:47:01','ระดับ ส1',2,'ส1',21,'กลุ่มงานสนับสนุน','ระดับ ส1',NULL,NULL),
	 ('ส2',0,1,'2010-05-31 10:47:01','ระดับ ส2',2,'ส2',22,'กลุ่มงานสนับสนุน','ระดับ ส2',NULL,NULL),
	 ('ส3',0,1,'2010-05-31 10:47:01','ระดับ ส2/หัวหน้า',2,'ส2/หน.',23,'กลุ่มงานสนับสนุน','ระดับ ส2/หัวหน้า',NULL,NULL),
	 ('ส4',0,1,'2010-05-31 10:47:01','ระดับ ส3',2,'ส3',24,'กลุ่มงานสนับสนุน','ระดับ ส3',NULL,NULL),
	 ('ส5',0,1,'2010-05-31 10:47:01','ระดับ ส3/หัวหน้า',2,'ส3/หน.',25,'กลุ่มงานสนับสนุน','ระดับ ส3/หัวหน้า',NULL,NULL),
	 ('ส6',0,1,'2010-05-31 10:47:01','ระดับ ส4',2,'ส4',26,'กลุ่มงานสนับสนุน','ระดับ ส4',NULL,NULL),
	 ('ส7',0,1,'2010-05-31 10:47:01','ระดับ ส4/หัวหน้า',2,'ส4/หน.',27,'กลุ่มงานสนับสนุน','ระดับ ส4/หัวหน้า',NULL,NULL),
	 ('ช1',0,1,'2010-05-31 10:47:01','ระดับ ช1',2,'ช1',31,'กลุ่มงานช่าง','ระดับ ช1',NULL,NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('ช2',0,1,'2010-05-31 10:47:01','ระดับ ช2',2,'ช2',32,'กลุ่มงานช่าง','ระดับ ช2',NULL,NULL),
	 ('ช3',0,1,'2010-05-31 10:47:01','ระดับ ช2/หัวหน้า',2,'ช2/หน.',33,'กลุ่มงานช่าง','ระดับ ช2/หัวหน้า',NULL,NULL),
	 ('ช4',0,1,'2010-05-31 10:47:01','ระดับ ช3',2,'ช3',34,'กลุ่มงานช่าง','ระดับ ช3',NULL,NULL),
	 ('ช5',0,1,'2010-05-31 10:47:01','ระดับ ช3/หัวหน้า',2,'ช3/หน.',35,'กลุ่มงานช่าง','ระดับ ช3/หัวหน้า',NULL,NULL),
	 ('ช6',0,1,'2010-05-31 10:47:01','ระดับ ช4',2,'ช4',36,'กลุ่มงานช่าง','ระดับ ช4',NULL,NULL),
	 ('ช7',0,1,'2010-05-31 10:47:01','ระดับ ช4/หัวหน้า',2,'ช4/หน.',37,'กลุ่มงานช่าง','ระดับ ช4/หัวหน้า',NULL,NULL),
	 ('ท1',0,1,'2010-05-31 10:47:01','ระดับ ท1',2,'ท1',41,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท1',NULL,NULL),
	 ('ท2',0,1,'2010-05-31 10:47:01','ระดับ ท2',2,'ท2',42,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท2',NULL,NULL),
	 ('ท3',0,1,'2010-05-31 10:47:01','ระดับ ท2/หัวหน้า',2,'ท2/หน.',43,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท2/หัวหน้า',NULL,NULL),
	 ('ท4',0,1,'2010-05-31 10:47:01','ระดับ ท3',2,'ท3',44,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท3',NULL,NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('ท5',0,1,'2010-05-31 10:47:01','ระดับ ท3/หัวหน้า',2,'ท3/หน.',45,'กลุ่มงานเทคนิคพิเศษ','ระดับ ท3/หัวหน้า',NULL,NULL),
	 ('สว',1,1,'2019-02-07 15:11:42','วช',1,'วิชาชีพ',0,'วิชาชีพ','วิชาชีพ',NULL,NULL),
	 ('ว1',1,1,'2018-08-31 09:16:43','ว1',1,'เจ้าหน้าที่',0,'วิชาชีพ 1','วิชาชีพ 1',NULL,NULL),
	 ('ว2',1,1,'2018-08-31 09:16:51','ว2',1,'เจ้าหน้าที่อาวุโส',0,'วิชาชีพ 2','วิชาชีพ 2',NULL,NULL),
	 ('ว3',1,1,'2018-08-31 09:17:01','ว3',1,'ผู้ช่วยผู้จัดการ',0,'วิชาชีพ 3','วิชาชีพ 3',NULL,NULL),
	 ('ว4',1,1,'2018-08-31 09:17:11','ว4',1,'ผู้จัดการ',0,'วิชาชีพ 4','วิชาชีพ 4',NULL,NULL),
	 ('ว5',1,1,'2018-08-31 09:17:21','ว5',1,'ผู้จัดการอาวุโส',0,'วิชาชีพ 5','วิชาชีพ 5',NULL,NULL),
	 ('ว6',1,1,'2018-08-31 09:17:31','ว6',1,'ผู้บริหารสายงาน',0,'วิชาชีพ 6','วิชาชีพ 6',NULL,NULL),
	 ('T1',1,6830,'2020-01-30 09:29:01','กลุ่มทั่วไป 1',1,'กลุ่มทั่วไป 1',4,'1','1','กลุ่มทั่วไป 1',NULL),
	 ('T2',1,6830,'2020-01-30 09:24:57','กลุ่มทั่วไป 2',1,'กลุ่มทั่วไป 2',5,'2','2','กลุ่มทั่วไป 2',NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('T3',1,6830,'2020-01-30 09:27:07','กลุ่มทั่วไป 3',1,'กลุ่มทั่วไป 3',6,'3','3','กลุ่มทั่วไป 3',NULL),
	 ('V3',1,1,'2020-02-22 14:32:50','กลุ่มวิชาชีพเฉพาะ 3',1,'กลุ่มวิชาชีพเฉพาะ 3',9,'3','3','กลุ่มวิชาชีพเฉพาะ 3',NULL),
	 ('V4',1,12372,'2020-01-23 18:02:48','กลุ่มวิชาชีพเฉพาะ 4',1,'กลุ่มวิชาชีพเฉพาะ 4',10,'4 ','4','กลุ่มวิชาชีพเฉพาะ 4',NULL),
	 ('S6',1,12372,'2020-01-23 18:03:07','กลุ่มวิชาชีพการลงทุน 2',1,'วิชาชีพการลงทุน 2',12,'2','2','กลุ่มวิชาชีพการลงทุน 2',NULL),
	 ('S7',1,12372,'2020-01-23 18:03:14','กลุ่มวิชาชีพการลงทุน 3',1,'วิชาชีพการลงทุน 3',13,'3','3','กลุ่มวิชาชีพการลงทุน 3',NULL),
	 ('s3',1,1,'2020-01-21 14:22:56','กลุ่มวิชาการ 3',1,'กลุ่มวิชาการ 3',7,'3','3','กลุ่มวิชาการ 3',NULL),
	 ('s4',1,12372,'2020-01-23 18:02:34','กลุ่มวิชาการ 4',1,'กลุ่มวิชาการ 4',8,'4','4','กลุ่มวิชาการ 4',NULL),
	 ('S5',1,12372,'2020-01-23 18:02:59','กลุ่มวิชาชีพการลงทุน 1',1,'วิชาชีพการลงทุน 1',11,'1','1','กลุ่มวิชาชีพการลงทุน 1',NULL),
	 ('ต1',1,12372,'2020-01-23 18:01:31','กลุ่มสนับสนุน 1',1,'กลุ่มสนับสนุน 1',1,'1','1','กลุ่มสนับสนุน 1',NULL),
	 ('ต2',1,1,'2020-05-23 10:40:29','กลุ่มสนับสนุน 2',1,'กลุ่มสนับสนุน 2',2,'2','2','กลุ่มสนับสนุน 2',NULL);
INSERT INTO DPISEMP1.PER_LEVEL (LEVEL_NO,LEVEL_ACTIVE,UPDATE_USER,UPDATE_DATE,LEVEL_NAME,PER_TYPE,LEVEL_SHORTNAME,LEVEL_SEQ_NO,POSITION_TYPE,POSITION_LEVEL,LEVEL_OTHERNAME,LEVEL_ENGNAME) VALUES
	 ('ต3',1,12372,'2020-01-23 18:01:50','กลุ่มสนับสนุน 3',1,'กลุ่มสนับสนุน 3',3,'3','3','กลุ่มสนับสนุน 3',NULL),
	 ('S8',1,12372,'2020-01-23 18:03:22','กลุ่มวิชาชีพการลงทุน 4',1,'วิชาชีพการลงทุน 4',14,'4','4','กลุ่มวิชาชีพการลงทุน 4',NULL),
	 ('S9',1,1,'2020-03-12 14:59:40','กลุ่มวิชาชีพการลงทุน 5',1,'วิชาชีพการลงทุน 5',15,'5','5','กลุ่มวิชาชีพการลงทุน 5',NULL),
	 ('S0',1,12372,'2020-01-23 18:03:37','กลุ่มวิชาชีพการลงทุน 6',1,'วิชาชีพการลงทุน 6',16,'6','6','กลุ่มวิชาชีพการลงทุน 6',NULL),
	 ('V6',1,1,'2020-01-27 17:58:22','กลุ่มเชี่ยวชาญ ',1,'กลุ่มเชี่ยวชาญ ',0,NULL,NULL,'กลุ่มเชี่ยวชาญ ',NULL);
