INSERT INTO DPISEMP1.PER_PERFORMANCE_GOALS (PG_ID,KF_ID,PG_SEQ,KPI_ID,KPI_NAME,KPI_WEIGHT,KPI_MEASURE,KPI_PER_ID,KPI_TARGET_LEVEL1,KPI_TARGET_LEVEL2,KPI_TARGET_LEVEL3,KPI_TARGET_LEVEL4,KPI_TARGET_LEVEL5,KPI_TARGET_LEVEL1_DESC,KPI_TARGET_LEVEL2_DESC,KPI_TARGET_LEVEL3_DESC,KPI_TARGET_LEVEL4_DESC,KPI_TARGET_LEVEL5_DESC,PG_RESULT,PG_EVALUATE,UPDATE_USER,UPDATE_DATE,PG_REMARK,KF_TYPE,KF_SCORE_FLAG,KPI_OTHER) VALUES
	 (16,6,1,10,'ระยะเวลาในการบันทึกคำสั่งต่าง ๆ ของข้าราชการและลูกจ้าง
ประจำ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจาก   วันที่ได้รับคำสั่ง',30,'ร้อยละ',26,1,2,3,4,5,'เสร็จภายใน
19 วันทำการ','เสร็จภายใน
16 วันทำการ','เสร็จภายใน
13 วันทำการ','เสร็จภายใน
10 วันทำการ','เสร็จภายใน
7 วันทำการ','ระยะเวลาในการบันทึกคำสั่งต่าง ๆ ของข้าราชการและลูกจ้างประจำ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) เสร็จภายใน
7 วันทำการ',5,1,'2021-11-18 14:36:28',NULL,NULL,1,NULL),
	 (6,4,1,5,'ระยะเวลาในการบันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม สังกัดส่วนกลาง และส่วนภูมิภาค     
(ณ  1  เมษายน 2564)  ในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่ง',35,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 65 วัน','ดำเนินการบันทึกข้อมูลภายใน 60 วัน','ดำเนินการบันทึกข้อมูลภายใน 55 วัน','ดำเนินการบันทึกข้อมูลภายใน 50 วัน','ดำเนินการบันทึกข้อมูลภายใน 45 วัน','บันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคมสังกัดส่วนกลางและภูมิภาค ณ วันที่ 1 เมษายน 2564 จำนวน 2,293 ราย (27 คำสั่ง) 
ประกอบด้วย คำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม คำสั่งให้พนักงานประกันสังคมได้รับเงินเพิ่มการครองชีพชั่วคราว และคำสั่งให้พนักงานประกันสังคมได้รับค่าตอบแทนพิเศษดำเนินการบันทึกข้อมูลภายใน 45 วัน นับจากวันที่ได้รับคำสั่ง ตามค่าเป้าหมายระดับ 5
',5,1,'2021-09-03 13:11:27',NULL,NULL,1,NULL),
	 (7,4,2,5,'ระยะเวลาของการบันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น ย้ายพนักงาน เปลี่ยนชื่อ-สกุล ฯลฯ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่งหรือเอกสาร',20,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 7 วัน','ดำเนินการบันทึกข้อมูลภายใน 6 วัน','ดำเนินการบันทึกข้อมูลภายใน 5 วัน','ดำเนินการบันทึกข้อมูลภายใน 4 วัน','ดำเนินการบันทึกข้อมูลภายใน 3 วัน','บันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม ย้ายพนักงาน ตัดโอนตำแหน่งจ้างพนักงานประกันสังคม สัญญาจ้าง 4 ปี ให้พนักงานประกันสังคมปฏิบัติราชการเป็นการประจำ เปลี่ยนชื่อ-สกุล ลาคลอด ลาออก เสียชีวิต โทษทางวินัย เพิ่มวุฒิการศึกษา พนักงานได้รับเงิน พตส. ให้พนักงานประกันสังคมได้รับเงินเพิ่ม กลุ่มวิชาชีพเฉพาะ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) จำนวน 101 ราย (47 คำสั่ง) ดำเนินการบันทึกข้อมูลภายใน 3 วัน นับจากวันที่ได้รับคำสั่งหรือเอกสาร ตามค่าเป้าหมายระดับ 5
',5,1,'2021-09-03 13:12:17',NULL,NULL,1,NULL),
	 (8,4,3,5,'ระดับความสำเร็จในการเปิดใช้งานการบันทึกข้อมูลประวัติการลาในระบบสารสนเทศทรัพยากรบุคคล (DPIS) ของพนักงานประกันสังคม',20,'%',31,1,2,3,4,5,'แจ้งเวียนให้หน่วยงานดำเนินการ ส่งรายชื่อเจ้าหน้าที่ที่ได้รับมอบหมาย','รวบรวมรายชื่อเจ้าหน้าที่ที่ได้รับมอบหมายเพื่อกำหนด USER-ID และ PASSWORD','จัดทำคู่มือการบันทึกการลา เพื่อให้เจ้าหน้าที่ทำการบันทึกข้อมูลการลา','กำหนดUSER-ID และ PASSWORD ลงในระบบ DPIS','ดำเนินการจัดส่งคู่มือ USER-ID และ PASSWORD ให้เจ้าหน้าที่ที่ได้รับมอบหมายทำการบันทึกข้อมูลการลา','ระดับความสำเร็จในการเปิดใช้งานการบันทึกข้อมูลประวัติการลาในระบบสารสนเทศทรัพยากรบุคคล (DPIS) ของพนักงานประกันสังคม
จัดส่งคู่มือ USER-ID และ PASSWORD ให้เจ้าหน้าที่ที่ได้รับมอบหมายทำการบันทึกข้อมูลการลา ดำเนินการตามขั้นตอนเสร็จ ตามค่าเป้าหมายระดับ 5
',5,1,'2021-09-03 13:12:53',NULL,NULL,1,NULL),
	 (9,4,4,5,'ระยะเวลาของการจัดทำข้อมูลพนักงานสนับสนุนหน่วยงานต่างๆ ให้แล้วเสร็จนับจากวันที่ได้รับหนังสือ หรือตามที่ได้รับมอบหมาย',15,'%',31,1,2,3,4,5,'ดำเนินการจัดทำข้อมูลภายใน 7 วัน','ดำเนินการจัดทำข้อมูลภายใน 6 วัน','ดำเนินการจัดทำข้อมูลภายใน 5 วัน','ดำเนินการจัดทำข้อมูลภายใน 4 วัน','ดำเนินการจัดทำข้อมูลภายใน 6 วัน','จัดทำข้อมูลตามที่หน่วยงานขอข้อมูลและได้รับมอบหมายให้จัดทำข้อมูล ดังนี้
 -  กองนโยบายและแผนงาน ขอข้อมูลดังนี้
 -  ข้อมูลโครงสร้างอายุพนักงานประกันสังคม และกรอบอัตรากำลัง พนักงานประกันสังคม 
 -  ข้อมูลการจ้างและอัตราค่าจ้างพนักงานประกันสังคม (ผู้พิการ) 
 -  สำนักงานเลขานุการกรม ขอข้อมูลดังนี้
 -  ข้อมูลพนักงานที่ปฏิบัติงานจริง ทั่วประเทศแยกตำแหน่ง
 -  ข้อมูลพนักงานที่ปฏิบัติงานจริง แยกเพศ แยกหน่วยงาน
 -  ศูนย์สารนิเทศ ขอข้อมูลดังนี้
 -  ตรวจชื่อ-สกุล ตำแหน่ง แต่งตั้งคณะทำงานประชาสัมพันธ์และตอบคำถามผ่านทาง Facebook สปส.
 -  ทำข้อมูลปฏิบัติจริง สปส.กทม.พื้นที่.1-12 และจังหวัดส่ง ศูนย์สารนิเทศ เพื่อนำมาประกอบการพิจารณาข้อร้องเรียนฯ
 -  กลุ่มพัฒนาระบบบริหาร ขอข้อมูลพนักงานที่ปฏิบัติงานจริง 
 -  สำนักเสริมสร้างความมั่นคงแรงงานนอกระบบ ข้อมูลพนักงานที่ปฏิบัติงานจริง แยกหน่วยงาน
 -  กลุ่มตรวจสอบภายใน ขอข้อมูลโครงสร้างจำนวนข้าราชการและพนักงานกองกฎหมายและนิติกรทั่วประเทศ
   -  กองฝึกอบรม ขอข้อมูลพนักงานขอทุนการศึกษา
   -  กลุ่มงานวินัย ขอข้อมูลประวัติพนักงาน 
   -  จัดทำข้อมูล กรอบ-ปฏิบัติจริง-ตำแหน่งว่าง แยกตามชื่อตำแหน่ง กลุ่ม พนักงานประกันสังคม
   -  จัดทำข้อมูลรายชื่อพนักงานตำแหน่งนิติกร ข้อมูลกรอบ-ปฏิบัติจริงพนักงานประกันสังคม
   -  จัดทำข้อมูลพนักงานเกษียณ ปี 2564 – 2568
   -  ทำข้อมูลประวัติการดำรงตำแหน่งเพื่อเลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม
   -  ตรวจความถูกต้องรายชื่อ ตำแหน่ง สังกัด พนักงานประกันสังคมเพื่อทำคำสั่งแต่งตั้ง
   -  จัดทำจอ (กรอบ – ปฏิบัติจริง ว่าง) รายชื่อ ตำแหน่ง ระดับ สังกัด วุฒิการศึกษา พนักงานประกันสังคมทั่วประเทศ
   -  ปรับปรุงประวัติพนักงาน (พ.7 อิเล็กทรอนิกส์)
   -  จัดทำข้อมูลประวัติการดำรงตำแหน่งพนักงาน เพื่อใช้ประกอบการพิจารณางานบริหารงานบุคคล
   -  จัดทำข้อมูลอายุราชการพนักงานประกันสังคม 4 กลุ่ม (ไม่ถึง 10 ปี / 10-15 ปี / 15-20 ปี /มากกว่า 20 ปี)
   -  จัดทำข้อมูลพนักงานฉีดวัคซีน
   -  ตรวจรายชื่อ ตำแหน่ง สังกัด ตามคำสั่งแต่งตั้งฯ
       ดำเนินการจัดทำข้อมูลภายใน 3 วัน ตามค่าเป้าหมายระดับ 5
',5,1,'2021-09-03 13:14:36',NULL,NULL,1,NULL),
	 (10,4,5,5,'ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน',10,'%',31,1,2,3,4,5,'ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน 75','ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน 80','ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน 85','ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน 90','ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน 95','ร้อยละของบุคลากรกองบริหารทรัพยากรบุคคลไม่ถูกข้อร้องเรียน ร้อยละ 95 ตามค่าเป้าหมายระดับ 5',5,1,'2021-09-03 13:14:54',NULL,NULL,1,NULL),
	 (1,3,1,5,'ระยะเวลาในการบันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม สังกัดส่วนกลาง และส่วนภูมิภาค     
(ณ  1  ตุลาคม 2563)  ในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่ง',35,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 65 วัน','ดำเนินการบันทึกข้อมูลภายใน 60 วัน','ดำเนินการบันทึกข้อมูลภายใน 55 วัน','ดำเนินการบันทึกข้อมูลภายใน 50 วัน','ดำเนินการบันทึกข้อมูลภายใน 45 วัน','บันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคมสังกัดส่วนกลางและภูมิภาค ณ วันที่ 1 ตุลาคม 2563 จำนวน 2,438 ราย 
(30 คำสั่ง) ประกอบด้วย คำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม เลื่อนค่าจ้างพนักงานประกันสังคม (กลุ่มวิชาชีพการลงทุน) คำสั่งให้พนักงานประกันสังคมได้รับเงินเพิ่มการครองชีพชั่วคราว และคำสั่งให้พนักงานประกันสังคมได้รับค่าตอบแทนพิเศษ ดำเนินการบันทึกข้อมูลภายใน 45 วัน นับจากวันที่ได้รับคำสั่ง',5,1,'2021-04-21 10:04:52',NULL,NULL,1,NULL),
	 (2,3,2,5,'ระยะเวลาของการบันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น ย้ายพนักงาน เปลี่ยนชื่อ-สกุล ฯลฯ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่งหรือเอกสาร',20,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 7 วัน','ดำเนินการบันทึกข้อมูลภายใน 6 วัน','ดำเนินการบันทึกข้อมูลภายใน 5 วัน','ดำเนินการบันทึกข้อมูลภายใน 4 วัน','ดำเนินการบันทึกข้อมูลภายใน 3 วัน','บันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม ย้ายพนักงาน ตัดโอนตำแหน่ง จ้างพนักงานประกันสังคม สัญญาจ้าง 4 ปี ให้พนักงานประกันสังคมปฏิบัติราชการเป็นการประจำ เปลี่ยนชื่อ-สกุล ลาคลอด ลาออก เสียชีวิต โทษทางวินัย เพิ่มวุฒิการศึกษา พนักงานได้รับเงิน พตส. ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) จำนวน 131 ราย (56 คำสั่ง) ดำเนินการบันทึกข้อมูลภายใน 3 วัน นับจากวันที่ได้รับคำสั่งหรือเอกสาร',5,1,'2021-04-21 10:04:58',NULL,NULL,1,NULL),
	 (3,3,3,5,'ระดับความสำเร็จในการจัดทำประวัติพนักงาน 
(พ.7) พนักงานจ้างใหม่ (สัญญาจ้าง 4 ปี) สังกัดส่วนกลาง',20,'%',31,1,2,3,4,5,'เตรียมเอกสารในการรายงานตัวพนักงานจ้างใหม่','รับรายงานตัวพนักงานจ้างใหม่','รอคำสั่งจ้างพนักงานเพื่อลงประวัติการจ้างในเอกสาร (พ.7)','จัดทำหนังสือเสนอต่อผู้บังคับบัญชาเพื่อลงนามในเอกสาร (พ.7)','ส่งประวัติพนักงานจ้างใหม่ (พ.7) ให้หน่วยงานต้นสังกัด','ระดับความสำเร็จในการจัดทำประวัติพนักงาน (พ.7) พนักงานจ้างใหม่ (สัญญาจ้าง 4 ปี) สังกัดส่วนกลาง พนักงานกลุ่มวิชาชีพการลงทุน จำนวน 25 ราย พนักงานกลุ่มวิชาการ จำนวน 1 ราย พนักงานกลุ่มวิชาชีพเฉพาะ จำนวน 1 ราย รวมทั้งสิ้น 27 ราย (2 คำสั่ง 2 หน่วยงาน) ดำเนินการตามขั้นตอนเสร็จตามค่าเป้าหมายระดับ 5',5,1,'2021-04-21 10:05:12',NULL,NULL,1,NULL),
	 (4,3,4,5,'ระยะเวลาของการจัดทำข้อมูลพนักงานสนับสนุนหน่วยงานต่างๆ ให้แล้วเสร็จนับจากวันที่ได้รับหนังสือ หรือตามที่ได้รับมอบหมาย',15,'%',31,1,2,3,4,5,'ดำเนินการจัดทำข้อมูลภายใน 7 วัน','ดำเนินการจัดทำข้อมูลภายใน 6 วัน','ดำเนินการจัดทำข้อมูลภายใน 5 วัน','ดำเนินการจัดทำข้อมูลภายใน 4 วัน','ดำเนินการจัดทำข้อมูลภายใน 6 วัน','จัดทำข้อมูลตามที่หน่วยงานขอข้อมูลและได้รับมอบหมายให้จัดทำข้อมูล ดังนี้
 -  สำนักงานปลัดกระทรวงแรงงาน ขอข้อมูลการจ้างพนักงานผู้พิการ ปี 2564
 -  กองนโยบายและแผนงาน ขอข้อมูลดังนี้
 -  ข้อมูลโครงสร้างอายุพนักงานประกันสังคม และกรอบอัตรากำลัง พนักงานประกันสังคม 
 -  ข้อมูลการจ้างและอัตราค่าจ้างพนักงานประกันสังคม (ผู้พิการ) ทุก 3 เดือน
 -  สำนักงานเลขานุการกรม ขอข้อมูลดังนี้
 -  ข้อมูลพนักงานที่ปฏิบัติงานจริง ทั่วประเทศแยกตำแหน่ง
 -  ขอรายชื่อพนักงาน สปส.นครศรีธรรมราช (ช่วยน้ำท่วม)
 -  ข้อมูลจำนวนพนักงานทั่วประเทศ แยก ชาย-หญิง ตามอายุ เพื่อตรวจสุขภาพประจำปีพนักงาน
   -  กลุ่มพัฒนาระบบบริหาร ขอข้อมูลพนักงานที่ปฏิบัติงานจริง 
   -  สำนักเสริมสร้างความมั่นคงแรงงานนอกระบบ ขอความอนุเคราะห์จัดลำดับอาวุโสของพนักงานประกันสังคม ตำแหน่งนักวิชาการประกันสังคม สสร.
   -  กลุ่มตรวจสอบภายใน ขอข้อมูลโครงสร้างจำนวนข้าราชการและพนักงานกองกฎหมายและนิติกรทั่วประเทศ
   -  กลุ่มงานวินัย ขอข้อมูลประวัติพนักงาน 
   -  จัดทำข้อมูล กรอบ-ปฏิบัติจริง-ตำแหน่งว่าง แยกตามชื่อตำแหน่งพนักงานประกันสังคม
   -  จัดทำข้อมูลรายชื่อพนักงานตำแหน่งนิติกร ข้อมูลกรอบ-ปฏิบัติจริงพนักงานประกันสังคม
   -  จัดทำข้อมูลพนักงานเกษียณ ปี 2564 – 2568
   -  ทำข้อมูลประวัติการดำรงตำแหน่งเพื่อเลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม
   -  ตรวจความถูกต้องรายชื่อ ตำแหน่ง สังกัด พนักงานประกันสังคมเพื่อทำคำสั่งแต่งตั้ง
   -  จัดทำจอ (กรอบ – ปฏิบัติจริง ว่าง) รายชื่อ ตำแหน่ง ระดับ สังกัด วุฒิการศึกษา พนักงานประกันสังคมทั่วประเทศ
   -  บันทึกเลขที่สัญญาจ้างพนักงานประกันสังคม ในโปรกแกรม EXCEL
   -  ปรับปรุงประวัติพนักงาน (พ.7 อิเล็กทรอนิกส์)
   -  จัดทำข้อมูลประวัติการดำรงตำแหน่งพนักงาน เพื่อใช้ประกอบการพิจารณางานบริหารงานบุคคล
                     ดำเนินการจัดทำข้อมูลภายใน 3 วัน ดำเนินการตามขั้นตอนเสร็จตามค่าเป้าหมายระดับ 5',5,1,'2021-04-21 10:04:23',NULL,NULL,1,NULL);
INSERT INTO DPISEMP1.PER_PERFORMANCE_GOALS (PG_ID,KF_ID,PG_SEQ,KPI_ID,KPI_NAME,KPI_WEIGHT,KPI_MEASURE,KPI_PER_ID,KPI_TARGET_LEVEL1,KPI_TARGET_LEVEL2,KPI_TARGET_LEVEL3,KPI_TARGET_LEVEL4,KPI_TARGET_LEVEL5,KPI_TARGET_LEVEL1_DESC,KPI_TARGET_LEVEL2_DESC,KPI_TARGET_LEVEL3_DESC,KPI_TARGET_LEVEL4_DESC,KPI_TARGET_LEVEL5_DESC,PG_RESULT,PG_EVALUATE,UPDATE_USER,UPDATE_DATE,PG_REMARK,KF_TYPE,KF_SCORE_FLAG,KPI_OTHER) VALUES
	 (5,3,5,5,'ระดับความสำเร็จของการมีส่วนร่วมในการสร้างการรับรู้เกี่ยวกับการประเมินคุณธรรมและความโปร่งใส',10,'%',31,1,2,3,4,5,'ดำเนินการแล้วเสร็จในระดับที่ 1','ดำเนินการแล้วเสร็จในระดับที่ 1 และ 2','ดำเนินการแล้วเสร็จในระดับที่ 1,2 และ 3','ดำเนินการแล้วเสร็จในระดับที่ 1,2,3 และ 4','ดำเนินการแล้วเสร็จในระดับที่ 1,2,3,4 และ 5','ดำเนินการแล้วเสร็จในระดับที่ 1,2,3,4 และ 5 ดำเนินการตามขั้นตอนเสร็จตามค่าเป้าหมายระดับ 5',5,1,'2021-04-20 15:01:04',NULL,NULL,1,NULL),
	 (13,5,3,10,'ระยะเวลาในการบันทึกคำสั่ง เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม กลุ่มวิชาชีพการลงทุน กลุ่มวิชาชีพเฉพาะ กลุ่มวิชาการ 
กลุ่มทั่วไป กลุ่มสนับสนุน ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่ง',20,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 25 วัน','ดำเนินการบันทึกข้อมูลภายใน 20 วัน','ดำเนินการบันทึกข้อมูลภายใน 15 วัน','ดำเนินการบันทึกข้อมูลภายใน 10 วัน','ดำเนินการบันทึกข้อมูลภายใน 5 วัน','ระยะเวลาในการบันทึกคำสั่ง เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม กลุ่มวิชาชีพการลงทุน กลุ่มวิชาชีพเฉพาะ กลุ่มวิชาการ กลุ่มทั่วไป กลุ่มสนับสนุน ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่ง 
บันทึกคำสั่ง เลื่อนระดับที่สูงขึ้นของพนักงานประกันสังคม กลุ่มทั่วไป กลุ่มสนับสนุน ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) 
จำนวน 28 ราย 8 คำสั่ง ดำเนินการบันทึกข้อมูลภายใน 5 วัน นับจากวันที่ได้รับคำสั่ง ตามค่าเป้าหมายระดับ 5
',5,1,'2022-04-27 11:39:23',NULL,NULL,1,NULL),
	 (11,5,1,10,'ระยะเวลาในการบันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม สังกัดส่วนกลาง และส่วนภูมิภาค     
รอบการประเมินที่ 1 ประจำปี 2565 ในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่
ได้รับคำสั่ง',35,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 65 วัน','ดำเนินการบันทึกข้อมูลภายใน 60 วัน','ดำเนินการบันทึกข้อมูลภายใน 55 วัน','ดำเนินการบันทึกข้อมูลภายใน 50 วัน','ดำเนินการบันทึกข้อมูลภายใน 45 วัน','ระยะเวลาในการบันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม สังกัดส่วนกลาง และส่วนภูมิภาค     รอบการประเมินที่ 1 ประจำปี 2565 ในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่ง 
บันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคมสังกัดส่วนกลางและภูมิภาค ณ วันที่ 1 ตุลาคม 2564 จำนวน 2,282 ราย (39 คำสั่ง) 
ประกอบด้วย คำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม คำสั่งให้พนักงานประกันสังคมได้รับเงินเพิ่มการครองชีพชั่วคราว และคำสั่งให้พนักงานประกันสังคม ได้รับค่าตอบแทนพิเศษดำเนินการบันทึกข้อมูลภายใน 45 วัน นับจากวันที่ได้รับคำสั่ง ตามค่าเป้าหมายระดับ 5',5,1,'2022-07-08 16:41:09',NULL,NULL,1,NULL),
	 (12,5,2,10,'ระยะเวลาของการบันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น ย้ายพนักงาน ลาบวช ลาคลอด ลาออก เปลี่ยนชื่อ-สกุล เพิ่มวุฒิการศึกษา ฯลฯ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่งหรือเอกสาร',20,'%',31,1,2,3,4,5,'ดำเนินการบันทึกข้อมูลภายใน 7 วัน','ดำเนินการบันทึกข้อมูลภายใน 6 วัน','ดำเนินการบันทึกข้อมูลภายใน 5 วัน','ดำเนินการบันทึกข้อมูลภายใน 4 วัน','ดำเนินการบันทึกข้อมูลภายใน 3 วัน','ระยะเวลาของการบันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น ย้ายพนักงาน ลาบวช ลาคลอด ลาออก เปลี่ยนชื่อ-สกุล เพิ่มวุฒิการศึกษา ฯลฯ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่งหรือเอกสาร 
บันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น ย้ายพนักงาน ตัดโอนตำแหน่ง
จ้างพนักงานประกันสังคม สัญญาจ้าง 4 ปี ให้พนักงานประกันสังคมปฏิบัติราชการเป็นการประจำ เปลี่ยนชื่อ-สกุล ลาคลอด ลาออก เสียชีวิต โทษทางวินัย เพิ่มวุฒิการศึกษา พนักงานได้รับเงิน พตส. ให้พนักงานประกันสังคมได้รับเงินเพิ่ม กลุ่มวิชาชีพเฉพาะ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) จำนวน 301 ราย (63 คำสั่ง) ดำเนินการบันทึกข้อมูลภายใน 3 วัน นับจากวันที่ได้รับคำสั่งหรือเอกสาร ตามค่าเป้าหมายระดับ 5',5,1,'2022-04-27 11:38:18',NULL,NULL,1,NULL),
	 (14,5,4,10,'ระยะเวลาของการจัดทำข้อมูลพนักงานสนับสนุนหน่วยงานต่างๆ ให้แล้วเสร็จนับจากวันที่ได้รับหนังสือ หรือตามที่ได้รับมอบหมาย',15,'%',31,1,2,3,4,5,'ดำเนินการจัดทำข้อมูลภายใน 7 วัน','ดำเนินการจัดทำข้อมูลภายใน 6 วัน','ดำเนินการจัดทำข้อมูลภายใน 5 วัน','ดำเนินการจัดทำข้อมูลภายใน 4 วัน','ดำเนินการจัดทำข้อมูลภายใน 3 วัน','ระยะเวลาของการจัดทำข้อมูลพนักงานสนับสนุนหน่วยงานต่างๆ ให้แล้วเสร็จนับจากวันที่ได้รับหนังสือ หรือตามที่ได้รับมอบหมาย ดำเนินการจัดทำข้อมูลภายใน 3 วัน',5,1,'2021-12-22 17:17:02',NULL,NULL,1,NULL),
	 (15,5,5,10,'ร้อยละความสำเร็จของการดำเนินการได้ตามเป้าหมายของแผนการพัฒนาคุณภาพการบริหารจัดการภาครัฐของหน่วยงาน (PMQA)',10,'%',31,1,2,3,4,5,'ร้อยละ 60','ร้อยละ 70','ร้อยละ 80','ร้อยละ 90','ร้อยละ 100','ร้อยละความสำเร็จของการดำเนินการได้ตามเป้าหมายของแผนการพัฒนาคุณภาพการบริหารจัดการภาครัฐของหน่วยงาน (PMQA) 
ร้อยละความสำเร็จของการดำเนินการได้ตามเป้าหมายของแผนการพัฒนาคุณภาพการบริหารจัดการภาครัฐของหน่วยงาน (PMQA)
ร้อยละ 100 ตามค่าเป้าหมายระดับ 5
',5,1,'2022-04-27 11:45:14',NULL,NULL,1,NULL),
	 (17,7,1,10,'ระยะเวลาในการบันทึกคำสั่งเลื่อนค่าจ้างพนักงานประกันสังคม สังกัดส่วนกลาง และส่วนภูมิภาค     
รอบการประเมินที่ 2 ประจำปี 2565 ในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่
ได้รับคำสั่ง',35,'ระยะเวลา',4152,1,2,3,4,5,'ดำเนินการ
บันทึกข้อมูล
ภายใน 65 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 60 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 55 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 50 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 45 วัน',NULL,NULL,1,'2022-07-08 16:32:30',NULL,NULL,1,NULL),
	 (18,7,2,10,'ระยะเวลาของการบันทึกข้อมูลการเปลี่ยนแปลงรายบุคคลของพนักงานประกันสังคม ได้แก่ ย้ายพนักงานที่ได้รับวุฒิเพิ่มขึ้น เลื่อนระดับที่สูงขึ้น ย้ายพนักงาน ลาบวช ลาคลอด ลาออก เปลี่ยนชื่อ-สกุล เพิ่มวุฒิการศึกษา ฯลฯ ลงในระบบสารสนเทศทรัพยากรบุคคล (DPIS) นับจากวันที่ได้รับคำสั่งหรือเอกสาร',20,'ระยะเวลา',4152,1,2,3,4,5,'ดำเนินการ
บันทึกข้อมูล
ภายใน 7 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 6 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 5 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 4 วัน','ดำเนินการ
บันทึกข้อมูล
ภายใน 3 วัน',NULL,NULL,1,'2022-07-08 16:33:42',NULL,NULL,1,NULL),
	 (19,7,3,10,'ระดับความสำเร็จในการจัดทำประวัติพนักงาน 
(พ.7) พนักงานจ้างใหม่ (สัญญาจ้าง 4 ปี) สังกัดส่วนกลาง และส่วนภูมิภาค',20,'ระยะเวลา',4152,1,2,3,4,5,'เตรียมเอกสารในการรายงานตัวพนักงานจ้างใหม่','รับรายงานตัวพนักงานจ้างใหม่','รอคำสั่งจ้างพนักงานเพื่อลงประวัติการจ้างในเอกสาร (พ.7)','เสนอประวัติ
การจ้าง 
เอกสาร (พ.7)
ต่อผู้บังคับบัญชาลงนาม','ส่งประวัติพนักงานจ้างใหม่ (พ.7) 
ให้หน่วยงาน
ต้นสังกัด',NULL,NULL,1,'2022-07-08 16:35:28',NULL,NULL,1,NULL),
	 (20,7,4,10,'ระยะเวลาของการจัดทำข้อมูลพนักงานสนับสนุนหน่วยงานต่างๆ ให้แล้วเสร็จนับจากวันที่ได้รับหนังสือ หรือตามที่ได้รับมอบหมาย',15,'ระยะเวลา',4152,1,2,3,4,5,'ดำเนินการ
จัดทำข้อมูล
ภายใน 7 วัน','ดำเนินการ
จัดทำข้อมูล
ภายใน 6 วัน','ดำเนินการ
จัดทำข้อมูล
ภายใน 5 วัน','ดำเนินการ
จัดทำข้อมูล
ภายใน 4 วัน','ดำเนินการ
จัดทำข้อมูล
ภายใน 3 วัน',NULL,NULL,1,'2022-07-08 16:36:37',NULL,NULL,1,NULL);
INSERT INTO DPISEMP1.PER_PERFORMANCE_GOALS (PG_ID,KF_ID,PG_SEQ,KPI_ID,KPI_NAME,KPI_WEIGHT,KPI_MEASURE,KPI_PER_ID,KPI_TARGET_LEVEL1,KPI_TARGET_LEVEL2,KPI_TARGET_LEVEL3,KPI_TARGET_LEVEL4,KPI_TARGET_LEVEL5,KPI_TARGET_LEVEL1_DESC,KPI_TARGET_LEVEL2_DESC,KPI_TARGET_LEVEL3_DESC,KPI_TARGET_LEVEL4_DESC,KPI_TARGET_LEVEL5_DESC,PG_RESULT,PG_EVALUATE,UPDATE_USER,UPDATE_DATE,PG_REMARK,KF_TYPE,KF_SCORE_FLAG,KPI_OTHER) VALUES
	 (21,7,5,10,'ร้อยละความสำเร็จของการดำเนินการได้ตามเป้าหมายของแผนการพัฒนาคุณภาพการบริหาร
จัดการภาครัฐของหน่วยงาน (PMQA)',10,'ร้อยละ',4152,1,2,3,4,5,'ร้อยละ 60','ร้อยละ 70','ร้อยละ 80','ร้อยละ 90','ร้อยละ 100',NULL,NULL,1,'2022-07-08 16:37:43',NULL,NULL,1,NULL);
