INSERT INTO DPISEMP1.PER_WORK_LATE (WC_CODE,WORK_DATE,LATE_TIME,LATE_REMARK,UPDATE_USER,UPDATE_DATE) VALUES
	 ('01','2007-10-01','0745','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22'),
	 ('02','2007-10-01','0845','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22'),
	 ('03','2007-10-01','0945','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22'),
	 ('04','2007-10-01','0745','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22'),
	 ('05','2007-10-01','0845','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22'),
	 ('06','2007-10-01','0945','ทดสอบโปรแกรม',1,'2007-12-27 14:51:22');
