INSERT INTO DPISEMP1.PER_CONDITION (PC_CODE,PC_NAME,PC_ACTIVE,UPDATE_USER,UPDATE_DATE,PC_SEQ_NO,PC_OTHERNAME) VALUES
	 ('4500500004','คนพิการ',1,1,'2015-09-07 10:07:51',NULL,NULL),
	 ('4500500005','ตำแหน่งวิชาชีพ (วช.)',1,1,'2016-08-03 10:24:54',NULL,NULL),
	 ('4500500006','คนพิการ (กรอบปกติ)',1,1,'2016-08-03 10:48:34',NULL,NULL),
	 ('01        ','ตำแหน่งเพิ่มใหม่',1,1,'2004-02-17 14:18:41',NULL,NULL),
	 ('02        ','ตำแหน่งที่กำหนดให้สูงขึ้น',0,1,'2004-02-17 14:18:47',NULL,NULL),
	 ('03        ','ตำแหน่งที่สูงกว่าระดับควบปกติชั่วคราว',0,1,'2004-02-17 14:18:52',NULL,NULL),
	 ('04        ','เงื่อนไขตำแหน่งในต่างประเทศ',0,1,'2004-02-17 14:18:59',NULL,NULL),
	 ('05        ','อัตรากำลังทดแทน',1,1,'2004-02-17 14:19:04',NULL,NULL),
	 ('06        ','ตำแหน่งที่ปรับตาม ว23/ว24',1,1,'2004-02-17 14:19:10',NULL,NULL),
	 ('07        ','เงื่อนไขเฉพาะตัวชั่วคราว',0,1,'2004-02-17 14:20:09',NULL,NULL);
INSERT INTO DPISEMP1.PER_CONDITION (PC_CODE,PC_NAME,PC_ACTIVE,UPDATE_USER,UPDATE_DATE,PC_SEQ_NO,PC_OTHERNAME) VALUES
	 ('08        ','ตำแหน่งไม่มีเงื่อนไข',1,1,'2004-02-17 14:22:12',NULL,NULL),
	 ('4500500003','ยุบตำแหน่งเกษียณ 42,43',0,1,'2005-02-28 14:00:00',NULL,NULL),
	 ('4500500002','เงื่อนไขอื่น ๆ',1,1,'2005-02-28 14:00:00',NULL,NULL),
	 ('4500500001','โครงสร้าง1ตค45',0,1,'2005-02-28 14:00:00',NULL,NULL),
	 ('4500500007','ตำแหน่งพิเศษ',0,1,'2021-01-20 13:20:10',NULL,NULL);
