INSERT INTO DPIS.PER_OFF_TYPE (OT_CODE,OT_NAME,OT_ACTIVE,UPDATE_USER,UPDATE_DATE,OT_SEQ_NO,OT_OTHERNAME) VALUES
	 ('01        ','ข้าราชการพลเรือนสามัญ',1,1,'2001-07-09 12:00:00',NULL,NULL),
	 ('02        ','ข้าราชการพลเรือนในพระองค์',1,1,'2003-07-30 13:48:15',NULL,NULL),
	 ('03        ','ข้าราชการประจำต่างประเทศพิเศษ',1,1,'2003-07-30 13:48:40',NULL,NULL),
	 ('04        ','ข้าราชการรัฐสภา',1,1,'2003-07-30 13:48:57',NULL,NULL),
	 ('05        ','ข้าราชการตุลาการ',1,1,'2003-07-30 13:49:08',NULL,NULL),
	 ('06        ','ข้าราชการสังกัดกรุงเทพมหานคร',1,1,'2003-07-30 13:49:37',NULL,NULL),
	 ('07        ','ลูกจ้างประจำ',1,1,'2003-07-30 13:50:23',NULL,NULL),
	 ('08        ','พนักงานราชการทั่วไป',1,1,'2007-05-11 13:22:07',NULL,NULL),
	 ('09        ','พนักงานราชการพิเศษ',1,1,'2007-05-11 13:22:07',NULL,NULL),
	 ('10        ','พนักงานราชการเฉพาะกิจ',1,1,'2021-08-16 12:33:38',NULL,NULL);
