INSERT INTO DPISEMP1.PER_ABSENTTYPE (AB_CODE,AB_NAME,AB_QUOTA,AB_COUNT,AB_ACTIVE,UPDATE_USER,UPDATE_DATE,AB_SEQ_NO,AB_OTHERNAME,AB_TYPE) VALUES
	 ('12        ','ลาป่วยจำเป็น',0,2,1,1,'2021-09-10 09:42:33',NULL,NULL,'12'),
	 ('13        ','ขาดราชการ',0,1,1,6829,'2012-09-12 10:21:40',NULL,NULL,'13'),
	 ('14        ','ลาไปช่วยเหลือภริยาที่คลอดบุตร',0,1,0,6829,'2012-09-12 10:21:40',NULL,NULL,'14'),
	 ('15        ','ลาไปฟื้นฟูสมรรถภาพด้านอาชีพ',0,1,0,6829,'2012-09-12 10:21:40',NULL,NULL,'15'),
	 ('02        ','ลาคลอดบุตร',0,1,1,1,'2004-01-06 16:33:17',NULL,NULL,'02'),
	 ('03        ','ลากิจส่วนตัว',0,2,1,1,'2004-02-18 13:55:14',NULL,NULL,'03'),
	 ('04        ','ลาพักผ่อน',0,2,1,1,'2004-02-18 13:55:19',NULL,NULL,'04'),
	 ('05        ','ลาอุปสมบทหรือลาไปประกอบพิธีฮัจย์',0,1,1,1,'2004-01-06 16:33:17',NULL,NULL,'05'),
	 ('06        ','ลาเข้ารับการตรวจเลือกหรือเข้ารับการเตรียมพล',0,1,1,1,'2004-01-06 16:33:17',NULL,NULL,'06'),
	 ('07        ','ลาไปศึกษา ฝึกอบรม ดูงาน หรือปฏิบัติการวิจัย',0,1,0,1,'2004-01-06 16:33:17',NULL,NULL,'07');
INSERT INTO DPISEMP1.PER_ABSENTTYPE (AB_CODE,AB_NAME,AB_QUOTA,AB_COUNT,AB_ACTIVE,UPDATE_USER,UPDATE_DATE,AB_SEQ_NO,AB_OTHERNAME,AB_TYPE) VALUES
	 ('08        ','ลาไปปฏิบัติงานในองค์การระหว่างประเทศ',0,1,0,1,'2004-01-06 16:33:17',NULL,NULL,'08'),
	 ('09        ','ลาติดตามคู่สมรส',0,1,0,1,'2004-01-06 16:33:17',NULL,NULL,'09'),
	 ('10        ','สาย',0,2,1,1,'2004-02-18 13:55:30',NULL,NULL,'10'),
	 ('01        ','ลาป่วย',0,2,1,1,'2004-02-18 13:55:06',NULL,NULL,'01');
