INSERT INTO DPISEMP1.PER_ATTACHMENT (AT_CODE,AT_NAME,AT_REMARK,AT_ACTIVE,UPDATE_USER,UPDATE_DATE,AT_SEQ_NO,AT_OTHERNAME) VALUES
	 ('21','ใบสมัคร','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',21,NULL),
	 ('22','ใบรับรองแพทย์','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',22,NULL),
	 ('23','ใบรายงานตัว','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',23,NULL),
	 ('24','พิมพ์ลายนิ้วมือ','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',24,NULL),
	 ('25','หนังสือ รปภ. ฯลฯ','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',25,NULL),
	 ('26','ใบทดลองปฏิบัติราชการ, พ้นทดลองปฏิบัติราชการ','ใบสมัครและหลักฐาน',1,1,'2010-09-26 11:23:24',26,NULL),
	 ('31','สำเนาบัตรประจำตัวประชาชน','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',31,NULL),
	 ('32','สำเนาทะเบียนบ้าน','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',32,NULL),
	 ('33','ใบสำคัญการสมรส, หย่า','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',33,NULL),
	 ('34','หลักฐานการเปลี่ยนคำนำหน้านาม, ชื่อ, นามสกุล','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',34,NULL);
INSERT INTO DPISEMP1.PER_ATTACHMENT (AT_CODE,AT_NAME,AT_REMARK,AT_ACTIVE,UPDATE_USER,UPDATE_DATE,AT_SEQ_NO,AT_OTHERNAME) VALUES
	 ('35','ข้อมูลบิดา-มารดา-สามี-ภรรยา-บุตร','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',35,NULL),
	 ('36','อื่น ๆ (เงินช่วยเหลือพิเศษ, บำเหน็จตกทอด ฯลฯ','ข้อมูลส่วนตัว',1,1,'2010-09-26 11:23:24',36,NULL),
	 ('41','วุฒิการศึกษา','การศึกษา-อบรม-ดูงาน-ผลงาน-เครื่องราชย์ฯ',1,1,'2010-09-26 11:23:24',41,NULL),
	 ('42','การอบรม - ดูงาน','การศึกษา-อบรม-ดูงาน-ผลงาน-เครื่องราชย์ฯ',1,1,'2010-09-26 11:23:24',42,NULL),
	 ('43','ผลงานดีเด่น','การศึกษา-อบรม-ดูงาน-ผลงาน-เครื่องราชย์ฯ',1,1,'2010-09-26 11:23:24',43,NULL),
	 ('44','เครื่องราชอิสริยาภรณ์ ฯลฯ','การศึกษา-อบรม-ดูงาน-ผลงาน-เครื่องราชย์ฯ',1,1,'2010-09-26 11:23:24',44,NULL),
	 ('51','บรรจุและแต่งตั้ง, รับโอน','คำสั่งต่าง ๆ',1,1,'2010-09-26 11:23:24',51,NULL),
	 ('52','ย้ายและแต่งตั้ง, ช่วยราชการ, ปฏิบัติหน้าที่, รักษาการ','คำสั่งต่าง ๆ',1,1,'2010-09-26 11:23:24',52,NULL),
	 ('53','เลื่อนระดับ, เลื่อนขั้นเงินเดือน, ให้ได้รับเงินตามวุฒิ, ค่าตอบแทนพิเศษ','คำสั่งต่าง ๆ',1,1,'2010-09-26 11:23:24',53,NULL),
	 ('54','โทษทางวินัย, ตั้งกรรมการสอบวินัย','คำสั่งต่าง ๆ',1,1,'2010-09-26 11:23:24',54,NULL);
INSERT INTO DPISEMP1.PER_ATTACHMENT (AT_CODE,AT_NAME,AT_REMARK,AT_ACTIVE,UPDATE_USER,UPDATE_DATE,AT_SEQ_NO,AT_OTHERNAME) VALUES
	 ('55','ลาออกจากราชการ, ให้โอน, ให้ออก','คำสั่งต่าง ๆ',1,1,'2010-09-26 11:23:24',55,NULL),
	 ('61','วันทวีคูณ, ประกาศกฏอัยการศึก, ยกเลิกประกาศกฏอัยการศึก, กอ.รมน.','วันทวีคูณ - วันลา - ใบรับรองอายุราชการ',1,1,'2010-09-26 11:23:24',61,NULL),
	 ('62','วันลาต่าง ๆ (ลาพักผ่อน-ศึกษาต่อ-บวช-คลอดบุตร ฯลฯ)','วันทวีคูณ - วันลา - ใบรับรองอายุราชการ',1,1,'2010-09-26 11:23:24',62,NULL),
	 ('63','ใบรับรองอายุราชการ (ทหาร-ตำรวจ)','วันทวีคูณ - วันลา - ใบรับรองอายุราชการ',1,1,'2010-09-26 11:23:24',63,NULL),
	 ('70','ก.พ.7 ก่อนโอนมา ปค., อื่น ๆ','อื่น ๆ',1,1,'2010-09-26 11:23:24',70,NULL);
