INSERT INTO DPISEMP1.PER_ORG_STAT (OS_CODE,OS_NAME,OS_ACTIVE,UPDATE_USER,UPDATE_DATE,OS_SEQ_NO) VALUES
	 ('01        ','กอง',1,1,'2001-07-09 12:00:00',NULL),
	 ('02        ','สำนัก',1,1,'2003-07-29 13:58:44',NULL),
	 ('03        ','ภาค',1,1,'2001-07-09 12:00:00',NULL),
	 ('04        ','เขต',1,1,'2001-07-09 12:00:00',NULL),
	 ('05        ','ศูนย์',1,1,'2001-07-09 12:00:00',NULL),
	 ('06        ','จังหวัด',1,1,'2001-07-09 12:00:00',NULL),
	 ('07        ','อำเภอ',1,1,'2001-07-09 12:00:00',NULL),
	 ('08        ','ต่ำกว่ากอง',1,1,'2001-07-09 12:00:00',NULL),
	 ('09        ','กรม',1,1,'2003-07-29 13:58:16',NULL),
	 ('10        ','กระทรวง',1,1,'2003-07-29 13:58:25',NULL);
