INSERT INTO DPISEMP1.PER_ASSESS_MAIN (AM_CODE,AM_NAME,AM_POINT_MIN,AM_POINT_MAX,AM_ACTIVE,UPDATE_USER,UPDATE_DATE,AM_SHOW,PER_TYPE,AM_YEAR,AM_CYCLE) VALUES
	 ('31','ต้องปรับปรุง (พนักงานราชการ)',0,59.99,1,1,'2010-09-26 11:23:24',NULL,3,'2555',2),
	 ('32','พอใช้ (พนักงานราชการ)',60,69.99,1,1,'2010-09-26 11:23:24',NULL,3,'2555',2),
	 ('33','ดี (พนักงานราชการ)',70,79.99,1,1,'2010-09-26 11:23:24',NULL,3,'2555',2),
	 ('34','ดีมาก (พนักงานราชการ)',80,89.99,1,1,'2010-09-26 11:23:24',NULL,3,'2555',2),
	 ('35','ดีเด่น (พนักงานราชการ)',90,100,1,1,'2010-09-26 11:23:24',NULL,3,'2555',2),
	 ('1','ต้องปรับปรุง',0,59.99,1,1,'2009-06-22 10:41:05',NULL,1,'2555',2),
	 ('2','พอใช้',60,69.99,1,1,'2009-06-22 10:41:05',NULL,1,'2555',2),
	 ('3','ดี',70,79.99,1,1,'2009-06-22 10:41:05',NULL,1,'2555',2),
	 ('4','ดีมาก',80,89.99,1,1,'2009-06-22 10:41:05',NULL,1,'2555',2),
	 ('5','ดีเด่น',90,100,1,1,'2009-06-22 10:41:05',NULL,1,'2555',2);
