INSERT INTO DPISEMP1.PER_REWARDHIS (REH_ID,PER_ID,REW_CODE,REH_ORG,REH_DOCNO,REH_DATE,UPDATE_USER,UPDATE_DATE,PER_CARDNO,REH_YEAR,REH_PERFORMANCE,REH_OTHER_PERFORMANCE,REH_REMARK,AUDIT_FLAG) VALUES
	 (6,3854,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',1,'2021-09-06 15:19:30','3320400141665','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรมของสำนักงานประกันสังคม ประจำปี 2564',NULL,NULL),
	 (3,31,'09        ',NULL,NULL,NULL,6830,'2021-09-03 15:50:59','3100200580675',NULL,NULL,NULL,NULL,NULL),
	 (7,1680,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',6830,'2021-09-03 16:20:38','3140700027240','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรมของสำนักงานประกันสังคม ประจำปี 2564',NULL,NULL),
	 (5,3669,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',6830,'2021-09-03 16:33:39','3740200058795','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรม ประจำปี 2564',NULL,NULL),
	 (9,4162,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',1,'2021-09-06 15:12:04','1100700493732','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรมของสำนักงานประกันสังคม ประจำปี 2564',NULL,NULL),
	 (1,4065,'09        ','สำนักงานประกันสังคม',NULL,'2020-09-02         ',1,'2020-08-28 09:44:55','1129900093281','2563',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรม ประจำปี 2563',NULL,NULL),
	 (2,3807,'09        ','สำนักงานประกันสังคม',NULL,'2020-09-02         ',1,'2020-08-28 09:52:19','3720500492482','2563','บุคลากรดีเด่นด้านคุณธรรมจริยธรรม ประจำปี 2563','บุคลากรดีเด่นด้านคุณธรรมจริยธรรม ประจำปี 2563',NULL,NULL),
	 (4,949,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',1,'2021-09-06 15:18:26','3100900875988','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรม ประจำปี 2564',NULL,NULL),
	 (8,3159,'10        ','สำนักงานประกันสังคม',NULL,'2021-09-03         ',1,'2021-09-06 15:11:13','3930100206316','2564',NULL,'บุคลากรดีเด่นด้านคุณธรรมจริยธรรมของสำนักงานประกันสังคม ประจำปี 2564',NULL,'N');
