INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('O1','ประเภทวิชาการ ประเมินตนเอง',100,0,0,0,1,'2010-06-28 15:14:38'),
	 ('O2','ประเภทวิชาการ ประเมินผู้บังคับบัญชา',0,100,0,0,1,'2010-06-28 15:14:38'),
	 ('O3','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน',0,0,100,0,1,'2010-06-28 15:14:38'),
	 ('O4','ประเภทวิชาการ ประเมินผู้ใต้บังคับบัญชา',0,0,0,100,1,'2010-06-28 15:14:38'),
	 ('O12','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา',20,80,0,0,1,'2010-06-28 15:14:38'),
	 ('O13','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน',50,0,50,0,1,'2010-06-28 15:14:38'),
	 ('O14','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้ใต้บังคับบัญชา',50,0,0,50,1,'2010-06-28 15:14:38'),
	 ('O23','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',0,80,20,0,1,'2010-06-28 15:14:38'),
	 ('O24','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',0,80,0,20,1,'2010-06-28 15:14:38'),
	 ('O34','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',0,0,50,50,1,'2010-06-28 15:14:38');
INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('O123','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',10,80,10,0,1,'2010-06-28 15:14:38'),
	 ('O124','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',10,80,0,10,1,'2010-06-28 15:14:38'),
	 ('O134','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',30,0,40,30,1,'2010-06-28 15:14:38'),
	 ('O1234','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',10,70,10,10,1,'2010-06-28 15:14:38'),
	 ('K1','ประเภทวิชาการ ประเมินตนเอง',100,0,0,0,1,'2010-06-28 15:14:38'),
	 ('K2','ประเภทวิชาการ ประเมินผู้บังคับบัญชา',0,100,0,0,1,'2010-06-28 15:14:38'),
	 ('K3','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน',0,0,100,0,1,'2010-06-28 15:14:38'),
	 ('K4','ประเภทวิชาการ ประเมินผู้ใต้บังคับบัญชา',0,0,0,100,1,'2010-06-28 15:14:38'),
	 ('K12','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา',20,80,0,0,1,'2010-06-28 15:14:38'),
	 ('K13','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน',50,0,50,0,1,'2010-06-28 15:14:38');
INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('K14','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้ใต้บังคับบัญชา',50,0,0,50,1,'2010-06-28 15:14:38'),
	 ('K23','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',0,80,20,0,1,'2010-06-28 15:14:38'),
	 ('K24','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',0,80,0,20,1,'2010-06-28 15:14:38'),
	 ('K34','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',0,0,50,50,1,'2010-06-28 15:14:38'),
	 ('K123','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',10,80,10,0,1,'2010-06-28 15:14:38'),
	 ('K124','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',10,80,0,10,1,'2010-06-28 15:14:38'),
	 ('K134','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',30,0,40,30,1,'2010-06-28 15:14:38'),
	 ('K1234','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',10,70,10,10,1,'2010-06-28 15:14:38'),
	 ('D1','ประเภทวิชาการ ประเมินตนเอง',100,0,0,0,1,'2010-06-28 15:14:38'),
	 ('D2','ประเภทวิชาการ ประเมินผู้บังคับบัญชา',0,100,0,0,1,'2010-06-28 15:14:38');
INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('D3','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน',0,0,100,0,1,'2010-06-28 15:14:38'),
	 ('D4','ประเภทวิชาการ ประเมินผู้ใต้บังคับบัญชา',0,0,0,100,1,'2010-06-28 15:14:38'),
	 ('D12','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา',20,80,0,0,1,'2010-06-28 15:14:38'),
	 ('D13','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน',50,0,50,0,1,'2010-06-28 15:14:38'),
	 ('D14','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้ใต้บังคับบัญชา',50,0,0,50,1,'2010-06-28 15:14:38'),
	 ('D23','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',0,80,20,0,1,'2010-06-28 15:14:38'),
	 ('D24','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',0,80,0,20,1,'2010-06-28 15:14:38'),
	 ('D34','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',0,0,50,50,1,'2010-06-28 15:14:38'),
	 ('D123','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',10,80,10,0,1,'2010-06-28 15:14:38'),
	 ('D124','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',10,80,0,10,1,'2010-06-28 15:14:38');
INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('D134','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',30,0,40,30,1,'2010-06-28 15:14:38'),
	 ('D1234','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',10,70,10,10,1,'2010-06-28 15:14:38'),
	 ('M1','ประเภทวิชาการ ประเมินตนเอง',100,0,0,0,1,'2010-06-28 15:14:38'),
	 ('M2','ประเภทวิชาการ ประเมินผู้บังคับบัญชา',0,100,0,0,1,'2010-06-28 15:14:38'),
	 ('M3','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน',0,0,100,0,1,'2010-06-28 15:14:38'),
	 ('M4','ประเภทวิชาการ ประเมินผู้ใต้บังคับบัญชา',0,0,0,100,1,'2010-06-28 15:14:38'),
	 ('M12','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา',20,80,0,0,1,'2010-06-28 15:14:38'),
	 ('M13','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน',50,0,50,0,1,'2010-06-28 15:14:38'),
	 ('M14','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้ใต้บังคับบัญชา',50,0,0,50,1,'2010-06-28 15:14:38'),
	 ('M23','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',0,80,20,0,1,'2010-06-28 15:14:38');
INSERT INTO DPISEMP1.PER_POS_TYPE (POS_TYPE,POS_NAME,SEFT_RATIO,CHIEF_RATIO,FRIEND_RATIO,SUB_RATIO,UPDATE_USER,UPDATE_DATE) VALUES
	 ('M24','ประเภทวิชาการ ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',0,80,0,20,1,'2010-06-28 15:14:38'),
	 ('M34','ประเภทวิชาการ ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',0,0,50,50,1,'2010-06-28 15:14:38'),
	 ('M123','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน',10,80,10,0,1,'2010-06-28 15:14:38'),
	 ('M124','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินผู้ใต้บังคับบัญชา',10,80,0,10,1,'2010-06-28 15:14:38'),
	 ('M134','ประเภทวิชาการ ประเมินตนเอง/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',30,0,40,30,1,'2010-06-28 15:14:38'),
	 ('M1234','ประเภทวิชาการ ประเมินตนเอง/ประเมินผู้บังคับบัญชา/ประเมินเพื่อนร่วมงาน/ประเมินผู้ใต้บังคับบัญชา',10,70,10,10,1,'2010-06-28 15:14:38');
