INSERT INTO DPISEMP1.PER_EDUCLEVEL (EL_CODE,EL_NAME,EL_ACTIVE,UPDATE_USER,UPDATE_DATE,EL_SEQ_NO,EL_CGD_CODE,EL_OTHERNAME,EL_TYPE,EL_SHORTNAME) VALUES
	 ('09        ','ทักษะประสบการณ์ที่ใช้แทนวุฒิการศึกษา',1,3092,'2011-03-01 09:46:21',NULL,NULL,NULL,NULL,NULL),
	 ('01        ','มัธยมศึกษาตอนต้น',1,1,'2004-01-06 16:39:27',NULL,'31',NULL,NULL,NULL),
	 ('02        ','มัธยมศึกษาตอนปลาย',1,1,'2004-01-06 16:39:27',NULL,'33',NULL,NULL,NULL),
	 ('05        ','วุติต่ำกว่าประกาศนียบัตรวิชาชีพ',1,1,'2004-01-06 16:39:27',NULL,'40',NULL,'1',NULL),
	 ('10        ','ปวช. หรือเทียบเท่า',1,1,'2004-01-06 16:39:27',NULL,'41',NULL,'1',NULL),
	 ('20        ','ปวท. หรือเทียบเท่า',1,1,'2004-01-06 16:39:27',NULL,'42',NULL,'1',NULL),
	 ('30        ','ปวส. หรือเทียบเท่า',1,1,'2004-01-06 16:39:27',NULL,'43',NULL,'1',NULL),
	 ('40        ','ปริญญาตรีหรือเทียบเท่า',1,1,'2004-01-06 16:39:27',NULL,'51',NULL,'2',NULL),
	 ('50        ','ประกาศนียบัตรชั้นสูง (สูงกว่าปริญญาตรี/ต่ำกว่าปริญญาโท)',1,1,'2004-01-06 16:39:27',NULL,'52',NULL,NULL,NULL),
	 ('60        ','ปริญญาโทหรือเทียบเท่า',1,1,'2004-01-06 16:39:27',NULL,'53',NULL,'3',NULL);
INSERT INTO DPISEMP1.PER_EDUCLEVEL (EL_CODE,EL_NAME,EL_ACTIVE,UPDATE_USER,UPDATE_DATE,EL_SEQ_NO,EL_CGD_CODE,EL_OTHERNAME,EL_TYPE,EL_SHORTNAME) VALUES
	 ('70        ','ประกาศนียบัตรบัณฑิตชั้นสูง (สูงกว่าปริญญาโท/ต่ำกว่าปริญญาเอก)',1,1,'2004-01-06 16:39:28',NULL,'54',NULL,NULL,NULL),
	 ('80        ','ปริญญาเอกหรือเทียบเท่า',1,1,'2004-01-06 16:39:28',NULL,'55',NULL,'4',NULL),
	 ('00        ','วุฒิอื่น ๆ เป็นกลุ่มที่หน่วยงานผลิตมาเพื่อใช้เฉพาะตำแหน่ง',1,1,'2004-01-06 16:39:27',NULL,'97',NULL,NULL,NULL),
	 ('90        ','สูงกว่าปริญญาเอก',1,1,'2004-01-06 16:39:28',NULL,'56',NULL,NULL,NULL),
	 ('99        ','ยังไม่ระบุ',1,1,'2004-01-09 14:19:36',NULL,'99',NULL,NULL,NULL);
