INSERT INTO DPISEMP1.PER_COMGROUP (COM_GROUP,CG_NAME,CG_ACTIVE,UPDATE_USER,UPDATE_DATE,CG_SEQ_NO,CG_OTHERNAME) VALUES
	 ('523','คำสั่งตัดโอนอัตราเงินเดือน',1,3092,'2011-03-01 09:45:11',23,NULL),
	 ('531','ประกาศ',1,3092,'2011-03-01 09:45:11',31,NULL),
	 ('532','สัญญา',1,3092,'2011-03-01 09:45:11',32,NULL),
	 ('524','คำสั่งปรับอัตราเงินเดือน',1,1,'2011-04-11 16:20:03',24,NULL),
	 ('525','คำสั่งจ่ายเงินรางวัลประจำปี',1,1,'2013-12-19 15:40:26',25,NULL),
	 ('526','คำสั่งจัดคนลง',1,1,'2013-12-19 15:40:26',26,NULL),
	 ('01','บรรจุ',1,1,'2010-04-05 15:41:21',91,NULL),
	 ('02','ย้าย',1,1,'2010-04-05 15:41:21',92,NULL),
	 ('03','เลื่อนระดับ',1,1,'2010-04-05 15:41:21',93,NULL),
	 ('04','เลื่อนตำแหน่ง',1,1,'2010-04-05 15:41:21',94,NULL);
INSERT INTO DPISEMP1.PER_COMGROUP (COM_GROUP,CG_NAME,CG_ACTIVE,UPDATE_USER,UPDATE_DATE,CG_SEQ_NO,CG_OTHERNAME) VALUES
	 ('05','เลื่อนขั้นเงินเดือน',1,1,'2010-04-05 15:41:21',95,NULL),
	 ('06','ออกจากราชการ',1,1,'2010-04-05 15:41:21',96,NULL),
	 ('07','รักษาราชการ',1,1,'2010-04-05 15:41:21',97,NULL),
	 ('08','ยกเลิก/แก้ไขคำสั่ง',1,1,'2010-04-05 15:41:21',98,NULL),
	 ('09','ลงโทษ',1,1,'2010-04-05 15:41:21',99,NULL),
	 ('501','คำสั่งบรรจุ',1,1,'2010-04-05 15:41:21',1,NULL),
	 ('502','คำสั่งย้าย',1,1,'2010-04-05 15:41:21',2,NULL),
	 ('503','คำสั่งรับโอน',1,1,'2010-04-05 15:41:21',3,NULL),
	 ('504','คำสั่งเลื่อน',1,1,'2010-04-05 15:41:21',4,NULL),
	 ('505','คำสั่งแต่งตั้งข้าราชการให้ดำรงตำแหน่งประเภทบริหาร',1,1,'2010-04-05 15:41:21',5,NULL);
INSERT INTO DPISEMP1.PER_COMGROUP (COM_GROUP,CG_NAME,CG_ACTIVE,UPDATE_USER,UPDATE_DATE,CG_SEQ_NO,CG_OTHERNAME) VALUES
	 ('506','คำสั่งให้ข้าราชการได้รับเงินเดือนตามคุณวุฒิ',1,1,'2010-04-05 15:41:21',6,NULL),
	 ('507','คำสั่งเลื่อนขั้นเงินเดือน',1,1,'2010-04-05 15:41:21',7,NULL),
	 ('508','คำสั่งให้ข้าราชการได้รับเงินเดือน',1,1,'2010-04-05 15:41:21',8,NULL),
	 ('509','คำสั่งให้ข้าราชการรักษาราชการแทน',1,1,'2010-04-05 15:41:21',9,NULL),
	 ('510','คำสั่งให้ข้าราชการรักษาการในตำแหน่ง',1,1,'2010-04-05 15:41:21',10,NULL),
	 ('511','คำสั่งให้ออกจากราชการและการอนุญาตให้ข้าราชการลาออกจากราชการ',1,1,'2010-04-05 15:41:21',11,NULL),
	 ('512','คำสั่งเพื่อแก้ไขคำสั่งที่ผิดพลาด',1,1,'2010-04-05 15:41:21',12,NULL),
	 ('513','คำสั่งยกเลิกคำสั่งเดิม',1,1,'2010-04-05 15:41:21',13,NULL),
	 ('514','คำสั่งตามมาตรการปรับปรุงอัตรากำลังของส่วนราชการ (โครงการเกษียณอายุก่อนกำหนด)',1,1,'2010-04-05 15:41:21',14,NULL),
	 ('521','คำสั่งมอบหมายให้ปฏิบัติราชการ/ปฏิบัติราชการแทน',1,1,'2010-05-31 10:46:44',21,NULL);
INSERT INTO DPISEMP1.PER_COMGROUP (COM_GROUP,CG_NAME,CG_ACTIVE,UPDATE_USER,UPDATE_DATE,CG_SEQ_NO,CG_OTHERNAME) VALUES
	 ('522','คำสั่งช่วยราชการ',1,1,'2010-05-31 10:46:44',21,NULL),
	 ('528','คำสั่งตัดโอนตำแหน่งและอัตราเงินเดือน',1,1,'2015-08-29 14:47:36',28,NULL);
