INSERT INTO DPISEMP1.PER_ORG_LEVEL (OL_CODE,OL_NAME,OL_ACTIVE,UPDATE_USER,UPDATE_DATE,OL_SEQ_NO,OL_OTHERNAME) VALUES
	 ('06        ','ต่ำกว่าสำนัก/กอง 3 ระดับ',0,1,'2010-11-20 13:44:52',6,NULL),
	 ('07        ','ต่ำกว่าสำนัก/กอง 4 ระดับ',0,1,'2010-11-20 13:44:52',7,NULL),
	 ('08        ','ต่ำกว่าสำนัก/กอง 5 ระดับ',0,1,'2010-11-20 13:44:52',8,NULL),
	 ('01        ','กระทรวง',1,1,'2001-07-09 12:00:00',1,NULL),
	 ('02        ','กรม',1,1,'2001-07-09 12:00:00',2,NULL),
	 ('03        ','สำนัก/กอง',1,1,'2001-07-09 12:00:00',3,NULL),
	 ('04        ','ต่ำกว่าสำนัก/กอง 1 ระดับ',1,1,'2001-07-09 12:00:00',4,NULL),
	 ('05        ','ต่ำกว่าสำนัก/กอง 2 ระดับ',0,1,'2001-07-09 12:00:00',5,NULL);
