INSERT INTO DPISEMP1.PER_WORK_CYCLE (WC_CODE,WC_NAME,WL_CODE,WC_START,WC_END,WC_ACTIVE,UPDATE_USER,UPDATE_DATE,WC_SEQ_NO) VALUES
	 ('01','กรุงเทพฯ  รอบที่ 1 7:30 น.','01','0730','1530',1,1,'2007-12-27 14:51:22',NULL),
	 ('02','กรุงเทพฯ รอบที่ 2 8:30 น.','01','0830','1630',1,1,'2007-12-27 14:51:22',NULL),
	 ('03','กรุงเทพฯ รอบที่ 3 9:30 น.','01','0930','1730',1,1,'2007-12-27 14:51:22',NULL),
	 ('04','นนทบุรี รอบที่ 1 7:30 น.','02','0730','1530',1,1,'2007-12-27 14:51:22',NULL),
	 ('05','นนทบุรี รอบที่ 2 8:30 น.','02','0830','1630',1,1,'2007-12-27 14:51:22',NULL),
	 ('06','นนทบุรี รอบที่ 3 9:30 น.','02','0930','1730',1,1,'2007-12-27 14:51:22',NULL);
