INSERT INTO DPISEMP1.PER_EMP_STATUS (ES_CODE,ES_NAME,ES_REMARK,ES_ACTIVE,UPDATE_USER,UPDATE_DATE,ES_SEQ_NO,ES_OTHERNAME) VALUES
	 ('02','ตรงตามตำแหน่ง','ระดับหรือคุณสมบัติของข้าราชการหรือลูกจ้างตรงกับตำแหน่งที่ครอง',1,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('03','รักษาการในตำแหน่งระดับที่ต่ำกว่า','ระดับของข้าราชการสูงกว่าระดับที่ครอง',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('04','รักษาการในตำแหน่งที่เท่ากัน',NULL,0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('05','ช่วยราชการ','ช่วยราชการ ไม่ได้ปฏิบัติงานในตำแหน่งที่ดำรงตำแหน่งจริง',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('06','ปฏิบัติหน้าที่',NULL,0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('07','รักษาการในตำแหน่งระดับที่สูงกว่า',NULL,0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('08','ลาศึกษาต่อ','ข้าราชการใช้สิทธิลาศึกษาต่อในระดับต่าง ๆ ตามระเบียบ',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('09','พักราชการ','อาศัยอำนาจตามความในมาตรา 107 แห่ง พ.ร.บ.ระเบียบข้าราชการพลเรือน พ.ศ.2535',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('10','ประจำกรม','สถานที่ปฏิบัติงานตามหมายเหตุ กรม',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('11','ประจำสำนัก/กอง','ประจำสำนัก หรือ ประจำกอง',0,1,'2010-04-05 15:41:21',NULL,NULL);
INSERT INTO DPISEMP1.PER_EMP_STATUS (ES_CODE,ES_NAME,ES_REMARK,ES_ACTIVE,UPDATE_USER,UPDATE_DATE,ES_SEQ_NO,ES_OTHERNAME) VALUES
	 ('12','ประจำจังหวัด','ประจำจังหวัด',0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('26','รักษาราชการแทน',NULL,0,1,'2010-04-05 15:41:21',NULL,NULL),
	 ('13','สัญญาจ้าง 4 ปี','พนักงานทำสัญญาจ้าง 4 ปี',1,6830,'2019-05-11 11:21:33',NULL,NULL);
