INSERT INTO DPISEMP1.PER_ORG_TYPE (OT_CODE,OT_NAME,OT_ACTIVE,UPDATE_USER,UPDATE_DATE,OT_SEQ_NO,OT_OTHERNAME) VALUES
	 ('0200000090','ประกันสังคมจังหวัดบึงกาฬ',0,6825,'2011-05-31 14:19:53',NULL,NULL),
	 ('01        ','ส่วนกลาง',1,1,'2001-07-09 12:00:00',NULL,NULL),
	 ('02        ','ส่วนกลางในภูมิภาค',1,1,'2001-07-09 12:00:00',NULL,NULL),
	 ('03        ','ส่วนภูมิภาค',1,1,'2001-07-09 12:00:00',NULL,NULL),
	 ('04        ','ต่างประเทศ',0,1,'2001-07-09 12:00:00',NULL,NULL),
	 ('05        ','ทั่วประเทศ',0,1224,'2009-05-01 14:47:06',NULL,NULL);
