INSERT INTO DPISEMP1.PER_SALARY_MOVMENT (SM_CODE,SM_NAME,SM_REMARK,SM_FACTOR,SM_ACTIVE,UPDATE_USER,UPDATE_DATE,SM_SEQ_NO,SM_OTHERNAME) VALUES
	 ('1','ครึ่งขั้น','เลื่อนขั้นเงินเดือนประจำครึ่งปี 0.5 ขั้น',0.5,1,3092,'2011-03-01 09:45:11',1,NULL),
	 ('2','หนึ่งขั้น','เลื่อนขั้นเงินเดือนประจำครึ่งปี 1.0 ขั้น กรณีพิเศษ',1,1,3092,'2011-03-01 09:45:11',2,NULL),
	 ('3','หนึ่งขั้นครึ่ง','เลื่อนขั้นเงินเดือนประจำครึ่งปี 1.5 ขั้น กรณีพิเศษ',1.5,1,3092,'2011-03-01 09:45:11',3,NULL),
	 ('4','สองขั้น','เลื่อนขั้นเงินเดือนประจำครึ่งปี 2.0 ขั้น กรณีพิเศษ',2,1,3092,'2011-03-01 09:45:11',4,NULL),
	 ('5','เต็มขั้น (2%)',NULL,0.5,1,3092,'2011-03-01 09:45:11',5,NULL),
	 ('6','ลดครึ่งขั้น','ลงโทษลดขั้นเงินเดือน 0.5 ขั้น',-0.5,1,3092,'2011-03-01 09:45:11',6,NULL),
	 ('7','ลดหนึ่งขั้น','ลงโทษลดขั้นเงินเดือน 1.0 ขั้น',-1,1,3092,'2011-03-01 09:45:11',7,NULL),
	 ('8','ตัดเงินเดือน',NULL,0,1,3092,'2011-03-01 09:45:11',8,NULL),
	 ('9','ตัดโอน',NULL,0,1,3092,'2011-03-01 09:45:11',9,NULL),
	 ('10','งดเลื่อนขั้น',NULL,0,1,3092,'2011-03-01 09:45:11',10,NULL);
INSERT INTO DPISEMP1.PER_SALARY_MOVMENT (SM_CODE,SM_NAME,SM_REMARK,SM_FACTOR,SM_ACTIVE,UPDATE_USER,UPDATE_DATE,SM_SEQ_NO,SM_OTHERNAME) VALUES
	 ('12','-','ปรับอัตราเงินเดือนตาม มติ ค.ร.ม. ฯลฯ',0,1,3092,'2011-03-01 09:45:11',12,NULL),
	 ('14','ปรับวุฒิ',NULL,0,1,3092,'2011-03-01 09:45:11',14,NULL),
	 ('15','บรรจุ',NULL,0,1,3092,'2011-03-01 09:45:11',15,NULL),
	 ('16','รับโอน',NULL,0,1,3092,'2011-03-01 09:45:11',16,NULL),
	 ('17','เต็มขั้น (4%)',NULL,1,1,3092,'2011-03-01 09:45:11',17,NULL),
	 ('18','เต็มขั้น (6%)',NULL,1.5,1,3092,'2011-03-01 09:45:11',18,NULL),
	 ('19','ปรับขั้นต่ำ','ปรับเงินเดือนผู้ยังไม่ถึงขั้นต่ำของระดับตามบัญชีเงินเดือน',0,1,3092,'2011-03-01 09:45:11',19,NULL);
