INSERT INTO DPISEMP1.PER_SERVICE (SV_CODE,SV_NAME,SV_ACTIVE,UPDATE_USER,UPDATE_DATE,SV_SEQ_NO,SV_OTHERNAME) VALUES
	 ('19        ','รักษาราชการแทน',1,3095,'2010-10-04 14:25:33',NULL,NULL),
	 ('20        ','ปฏิบัติหน้าที่ในฐานะผู้อำนวยการกลุ่มงาน',1,6829,'2012-07-24 09:53:48',NULL,NULL),
	 ('18        ','มอบหมายให้ข้าราชการปฏิบัติหน้าที่',1,1223,'2010-01-14 15:56:39',NULL,NULL),
	 ('14        ','ปฏิบัติหน้าที่ในฐานะผู้อำนวยการ',1,1223,'2009-02-10 09:45:25',NULL,NULL),
	 ('01        ','วิทยากร',1,1,'2003-07-30 13:51:34',NULL,NULL),
	 ('02        ','คณะทำงาน',1,1,'2003-07-30 13:51:41',NULL,NULL),
	 ('03        ','คณะกรรมการ',1,1,'2003-07-30 13:51:49',NULL,NULL),
	 ('04        ','อนุกรรมการ',1,1,'2003-07-30 13:51:58',NULL,NULL),
	 ('05        ','เลขานุการคณะกรรมการ',1,1,'2003-07-30 13:52:08',NULL,NULL),
	 ('06        ','เลขานุการคณะทำงาน',1,1,'2003-07-30 13:52:26',NULL,NULL);
INSERT INTO DPISEMP1.PER_SERVICE (SV_CODE,SV_NAME,SV_ACTIVE,UPDATE_USER,UPDATE_DATE,SV_SEQ_NO,SV_OTHERNAME) VALUES
	 ('07        ','ผู้ช่วยเลขานุการคณะกรรมการ',1,1,'2003-07-30 13:52:57',NULL,NULL),
	 ('08        ','ผู้ช่วยเลชานุการคณะทำงาน',1,1,'2003-07-30 13:53:22',NULL,NULL),
	 ('09        ','ผู้แทน',1,1,'2003-07-30 13:53:41',NULL,NULL),
	 ('10        ','ช่วยราชการ',1,1,'2003-07-30 13:54:00',NULL,NULL),
	 ('12        ','หัวหน้าผู้เชี่ยวชาญเฉพาะด้านประกันสังคม',1,1223,'2009-01-23 11:25:37',NULL,NULL),
	 ('17        ','แต่งตั้งข้าราชการให้ปฏิบัติราชการ',1,1223,'2009-02-23 09:40:20',NULL,NULL),
	 ('11        ','ปฏิบัติราชการเป็นการประจำ',1,6829,'2012-07-24 09:59:52',NULL,NULL),
	 ('13        ','รักษาการในตำแหน่ง',1,1223,'2009-01-23 13:55:24',NULL,NULL),
	 ('15        ','นายทะเบียนสำนักงานประกันสังคม',1,1223,'2009-02-10 11:26:40',NULL,NULL),
	 ('16        ','หัวหน้าผู้ตรวจราชการกรม',1,1223,'2009-02-19 11:37:44',NULL,NULL);
